[Killed] BlockStatement
src/dates.ts:3:62
 // ─── Date filter helpers ──────────────────────────────────────────────────────
 
-export function parseRelativeDate(expr: string): Date | null {
-  const m = expr.trim().toLowerCase().match(/^(\d+)([dwm])$/);
-  if (!m) return null;
-  // noUncheckedIndexedAccess makes match groups `string | undefined`. The regex
-  // captures both groups when it matches, so they are guaranteed defined here.
-  const n = parseInt(m[1]!);
-  const unit = m[2]!;
-  const ms = unit === 'd' ? n * 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
-  return new Date(Date.now() - ms);
-}
+export function parseRelativeDate(expr: string): Date | null {}
 
 // Resolve a `since`/`before` bound (relative shorthand OR an ISO date) to a
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Invalid date filter "7d": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] MethodExpression
src/dates.ts:4:13
 // ─── Date filter helpers ──────────────────────────────────────────────────────
 
 export function parseRelativeDate(expr: string): Date | null {
-  const m = expr.trim().toLowerCase().match(/^(\d+)([dwm])$/);
+  const m = expr.trim().toUpperCase().match(/^(\d+)([dwm])$/);
   if (!m) return null;
   // noUncheckedIndexedAccess makes match groups `string | undefined`. The regex
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Invalid date filter "7d": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] MethodExpression
src/dates.ts:4:13
 // ─── Date filter helpers ──────────────────────────────────────────────────────
 
 export function parseRelativeDate(expr: string): Date | null {
-  const m = expr.trim().toLowerCase().match(/^(\d+)([dwm])$/);
+  const m = expr.toLowerCase().match(/^(\d+)([dwm])$/);
   if (!m) return null;
   // noUncheckedIndexedAccess makes match groups `string | undefined`. The regex
killedBy: toCutoff resolves uppercase and padded relative shorthands (7D, 2W, " 1m ")
statusReason: Invalid date filter " 2w ": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] ConditionalExpression
src/dates.ts:5:7
 
 export function parseRelativeDate(expr: string): Date | null {
   const m = expr.trim().toLowerCase().match(/^(\d+)([dwm])$/);
-  if (!m) return null;
+  if (false) return null;
   // noUncheckedIndexedAccess makes match groups `string | undefined`. The regex
   // captures both groups when it matches, so they are guaranteed defined here.
killedBy: toCutoff resolves an ISO date verbatim
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
src/dates.ts:5:7
 
 export function parseRelativeDate(expr: string): Date | null {
   const m = expr.trim().toLowerCase().match(/^(\d+)([dwm])$/);
-  if (!m) return null;
+  if (m) return null;
   // noUncheckedIndexedAccess makes match groups `string | undefined`. The regex
   // captures both groups when it matches, so they are guaranteed defined here.
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Invalid date filter "7d": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] ArithmeticOperator
src/dates.ts:10:29
   // captures both groups when it matches, so they are guaranteed defined here.
   const n = parseInt(m[1]!);
   const unit = m[2]!;
-  const ms = unit === 'd' ? n * 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
+  const ms = unit === 'd' ? n / 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
   return new Date(Date.now() - ms);
 }
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: expected 0 to be greater than 604799000

[Killed] EqualityOperator
src/dates.ts:10:14
   // captures both groups when it matches, so they are guaranteed defined here.
   const n = parseInt(m[1]!);
   const unit = m[2]!;
-  const ms = unit === 'd' ? n * 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
+  const ms = unit !== 'd' ? n * 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
   return new Date(Date.now() - ms);
 }
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: expected 18144000000 to be less than 604801000

[Killed] ArithmeticOperator
src/dates.ts:11:19
   const n = parseInt(m[1]!);
   const unit = m[2]!;
   const ms = unit === 'd' ? n * 86400000 : unit === 'w' ? n * 7 * 86400000 : n * 30 * 86400000;
-  return new Date(Date.now() - ms);
+  return new Date(Date.now() + ms);
 }
 
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: expected -604800000 to be greater than 604799000

[Killed] BlockStatement
src/dates.ts:22:46
 // was silently dropped as if the date filter matched nothing. Surfacing the bad
 // input as an error beats an empty result that looks indistinguishable from
 // "nothing matches".
-export function toCutoff(expr: string): Date {
-  const d = parseRelativeDate(expr) ?? new Date(expr);
-  if (isNaN(d.getTime())) {
-    throw new Error(
-      `Invalid date filter "${expr}": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).`
-    );
-  }
-  return d;
-}
+export function toCutoff(expr: string): Date {}
 
 // True if `updated` falls in the [lower, upper) window. `lower`/`upper` are
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Cannot read properties of undefined (reading 'getTime')

[Killed] LogicalOperator
src/dates.ts:23:13
 // input as an error beats an empty result that looks indistinguishable from
 // "nothing matches".
 export function toCutoff(expr: string): Date {
-  const d = parseRelativeDate(expr) ?? new Date(expr);
+  const d = parseRelativeDate(expr) && new Date(expr);
   if (isNaN(d.getTime())) {
     throw new Error(
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Invalid date filter "7d": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] ConditionalExpression
src/dates.ts:24:7
 // "nothing matches".
 export function toCutoff(expr: string): Date {
   const d = parseRelativeDate(expr) ?? new Date(expr);
-  if (isNaN(d.getTime())) {
+  if (false) {
     throw new Error(
       `Invalid date filter "${expr}": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).`
killedBy: toCutoff throws on an unparseable bound (surfaces bad input instead of a silent empty result)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/dates.ts:24:7
 // "nothing matches".
 export function toCutoff(expr: string): Date {
   const d = parseRelativeDate(expr) ?? new Date(expr);
-  if (isNaN(d.getTime())) {
+  if (true) {
     throw new Error(
       `Invalid date filter "${expr}": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).`
killedBy: toCutoff resolves a relative shorthand (7d) to ~now minus 7 days
statusReason: Invalid date filter "7d": expected a relative shorthand (e.g. 7d, 2w, 1m) or an ISO date (e.g. 2026-06-24).

[Killed] BlockStatement
src/dates.ts:51:115
 // getTimeline passes a `new Date(0)` epoch default for `lower` so its lower is
 // never null and the timeline ALWAYS excludes missing-`updated` entries even with
 // no filters (its prior `new Date(m.updated) >= new Date(0)` behavior).
-export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {
-  if (!updated) return false;
-  const d = new Date(updated);
-  if (isNaN(d.getTime())) return false;
-  if (lower && d < lower) return false;
-  if (upper && d >= upper) return false;
-  return true;
-}
+export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {}
killedBy: inDateWindow keeps an updated strictly inside the [lower, upper) window
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/dates.ts:52:24
 // never null and the timeline ALWAYS excludes missing-`updated` entries even with
 // no filters (its prior `new Date(m.updated) >= new Date(0)` behavior).
 export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {
-  if (!updated) return false;
+  if (!updated) return true;
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
killedBy: inDateWindow drops a missing updated whenever a bound is active (the silent-exclude rule)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dates.ts:52:7
 // never null and the timeline ALWAYS excludes missing-`updated` entries even with
 // no filters (its prior `new Date(m.updated) >= new Date(0)` behavior).
 export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {
-  if (!updated) return false;
+  if (true) return false;
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
killedBy: inDateWindow keeps an updated strictly inside the [lower, upper) window
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dates.ts:54:7
 export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {
   if (!updated) return false;
   const d = new Date(updated);
-  if (isNaN(d.getTime())) return false;
+  if (false) return false;
   if (lower && d < lower) return false;
   if (upper && d >= upper) return false;
killedBy: inDateWindow drops an unparseable updated string (Invalid Date → NaN)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dates.ts:54:34
 export function inDateWindow(updated: string | undefined | null, lower: Date | null, upper: Date | null): boolean {
   if (!updated) return false;
   const d = new Date(updated);
-  if (isNaN(d.getTime())) return false;
+  if (isNaN(d.getTime())) return true;
   if (lower && d < lower) return false;
   if (upper && d >= upper) return false;
killedBy: inDateWindow drops an unparseable updated string (Invalid Date → NaN)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/dates.ts:55:16
   if (!updated) return false;
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
-  if (lower && d < lower) return false;
+  if (lower && d >= lower) return false;
   if (upper && d >= upper) return false;
   return true;
killedBy: inDateWindow keeps an updated strictly inside the [lower, upper) window
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dates.ts:55:16
   if (!updated) return false;
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
-  if (lower && d < lower) return false;
+  if (lower && true) return false;
   if (upper && d >= upper) return false;
   return true;
killedBy: inDateWindow keeps an updated strictly inside the [lower, upper) window
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dates.ts:56:16
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
   if (lower && d < lower) return false;
-  if (upper && d >= upper) return false;
+  if (upper && d > upper) return false;
   return true;
 }
killedBy: inDateWindow drops an updated exactly at upper (upper bound is exclusive, matches <)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dates.ts:56:35
   const d = new Date(updated);
   if (isNaN(d.getTime())) return false;
   if (lower && d < lower) return false;
-  if (upper && d >= upper) return false;
+  if (upper && d >= upper) return true;
   return true;
 }
killedBy: inDateWindow drops an updated exactly at upper (upper bound is exclusive, matches <)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dates.ts:57:10
   if (isNaN(d.getTime())) return false;
   if (lower && d < lower) return false;
   if (upper && d >= upper) return false;
-  return true;
+  return false;
 }
killedBy: inDateWindow keeps an updated strictly inside the [lower, upper) window
statusReason: expected false to be true // Object.is equality
