[Killed] Regex
src/frontmatter.ts:19:15
   content: string;
 }
 
-const FM_RE = /^---\r?\n([\s\S]*?)\r?\n---\r?\n?/;
+const FM_RE = /^---\r?\n([\s\S]*?)\r?\n---\r\n?/;
 
 // Escape regex metacharacters in a parsed frontmatter KEY before interpolating it
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] Regex
src/frontmatter.ts:19:15
   content: string;
 }
 
-const FM_RE = /^---\r?\n([\s\S]*?)\r?\n---\r?\n?/;
+const FM_RE = /^---\r\n([\s\S]*?)\r?\n---\r?\n?/;
 
 // Escape regex metacharacters in a parsed frontmatter KEY before interpolating it
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/frontmatter.ts:28:42
 // catastrophic backtracking (ReDoS) — and because the org vault is shared via
 // git, one malicious teammate could hang every member's boot (parseFrontmatter
 // runs over all vault files at boot via reconcileIndex). Escape first.
-function escapeRegExp(s: string): string {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
-}
+function escapeRegExp(s: string): string {}
 
 // val is the raw text captured after the colon (leading whitespace already
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 122961475, path: "0:1:2:2:1", endOnFailure: true }
Counterexample: [{"_":[]},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/frontmatter.ts:29:20
 // git, one malicious teammate could hang every member's boot (parseFrontmatter
 // runs over all vault files at boot via reconcileIndex). Escape first.
 function escapeRegExp(s: string): string {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return s.replace(/[^.*+?^${}()|[\]\\]/g, '\\$&');
 }
 
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 22 tests
{ seed: 353816020, path: "21:1:0:0:1:2:1:1:2:2", endOnFailure: true }
Counterexample: [{"A0":[]},""]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/frontmatter.ts:29:43
 // git, one malicious teammate could hang every member's boot (parseFrontmatter
 // runs over all vault files at boot via reconcileIndex). Escape first.
 function escapeRegExp(s: string): string {
-  return s.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
+  return s.replace(/[.*+?^${}()|[\]\\]/g, "");
 }
 
killedBy: frontmatter — DoS immunity treats a frontmatter key with regex metacharacters as literal (escapeRegExp)
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/frontmatter.ts:38:49
 // a scalar. Without this, `tags: [a, b] # comment` fails the inline-array
 // check because the captured value ends with `] # comment`, and it is then
 // parsed as the string "[a, b] # comment" instead of an array.
-function trimTrailingComment(s: string): string {
-  let quote: '"' | "'" | null = null;
-  for (let i = 0; i < s.length; i++) {
-    const ch = s[i]!;
-    if (quote) {
-      if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
-      if (ch === quote) {
-        if (quote === "'" && s[i + 1] === "'") { i++; continue; }
-        quote = null;
-      }
-    } else if (ch === '"' || ch === "'") {
-      quote = ch;
-    } else if (ch === '#') {
-      return s.slice(0, i).trimEnd();
-    }
-  }
-  return s.trimEnd();
-}
+function trimTrailingComment(s: string): string {}
 
 export function parseFrontmatter(raw: string): Frontmatter {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1293537442, path: "0:1:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:40:38
 // parsed as the string "[a, b] # comment" instead of an array.
 function trimTrailingComment(s: string): string {
   let quote: '"' | "'" | null = null;
-  for (let i = 0; i < s.length; i++) {
-    const ch = s[i]!;
-    if (quote) {
-      if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
-      if (ch === quote) {
-        if (quote === "'" && s[i + 1] === "'") { i++; continue; }
-        quote = null;
-      }
-    } else if (ch === '"' || ch === "'") {
-      quote = ch;
-    } else if (ch === '#') {
-      return s.slice(0, i).trimEnd();
-    }
-  }
+  for (let i = 0; i < s.length; i++) {}
   return s.trimEnd();
 }
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] ConditionalExpression
src/frontmatter.ts:40:19
 // parsed as the string "[a, b] # comment" instead of an array.
 function trimTrailingComment(s: string): string {
   let quote: '"' | "'" | null = null;
-  for (let i = 0; i < s.length; i++) {
+  for (let i = 0; false; i++) {
     const ch = s[i]!;
     if (quote) {
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] ConditionalExpression
src/frontmatter.ts:42:9
   let quote: '"' | "'" | null = null;
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
-    if (quote) {
+    if (true) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
       if (ch === quote) {
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] ConditionalExpression
src/frontmatter.ts:42:9
   let quote: '"' | "'" | null = null;
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
-    if (quote) {
+    if (false) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
       if (ch === quote) {
killedBy: parseFrontmatter keeps # characters inside quoted scalars, not as comment markers
statusReason: expected '\'Issue' to be 'Issue #42' // Object.is equality

[Survived] ConditionalExpression
src/frontmatter.ts:43:11
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
     if (quote) {
-      if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
+      if (true) { i++; continue; }
       if (ch === quote) {
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }

[Survived] ConditionalExpression
src/frontmatter.ts:43:11
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
     if (quote) {
-      if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
+      if (true && quote === '"') { i++; continue; }
       if (ch === quote) {
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }

[Killed] ConditionalExpression
src/frontmatter.ts:44:11
     const ch = s[i]!;
     if (quote) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
-      if (ch === quote) {
+      if (true) {
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }
         quote = null;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 993815382, path: "0:1:0:1:1:4:8:5", endOnFailure: true }
Counterexample: [{"a":" #"},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:44:11
     const ch = s[i]!;
     if (quote) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
-      if (ch === quote) {
+      if (ch !== quote) {
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }
         quote = null;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -51684033, path: "1:1:2:4:5:9:7:7:6", endOnFailure: true }
Counterexample: [{"a":[" #"]},""]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/frontmatter.ts:45:32
     if (quote) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
       if (ch === quote) {
-        if (quote === "'" && s[i + 1] === "'") { i++; continue; }
+        if (quote === "'" && s[i - 1] === "'") { i++; continue; }
         quote = null;
       }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 197 tests
{ seed: 1483744322, path: "196:1:2:4:2:3:4:4:8:7:7:11:9:8", endOnFailure: true }
Counterexample: [{"a":["'","#"]},""]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] EqualityOperator
src/frontmatter.ts:45:13
     if (quote) {
       if (ch === '\\' && s[i + 1] === '"' && quote === '"') { i++; continue; }
       if (ch === quote) {
-        if (quote === "'" && s[i + 1] === "'") { i++; continue; }
+        if (quote !== "'" && s[i + 1] === "'") { i++; continue; }
         quote = null;
       }

[Killed] ConditionalExpression
src/frontmatter.ts:48:16
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }
         quote = null;
       }
-    } else if (ch === '"' || ch === "'") {
+    } else if (true) {
       quote = ch;
     } else if (ch === '#') {
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] EqualityOperator
src/frontmatter.ts:48:16
         if (quote === "'" && s[i + 1] === "'") { i++; continue; }
         quote = null;
       }
-    } else if (ch === '"' || ch === "'") {
+    } else if (ch !== '"' || ch === "'") {
       quote = ch;
     } else if (ch === '#') {
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] ConditionalExpression
src/frontmatter.ts:50:16
       }
     } else if (ch === '"' || ch === "'") {
       quote = ch;
-    } else if (ch === '#') {
+    } else if (false) {
       return s.slice(0, i).trimEnd();
     }
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Killed] ConditionalExpression
src/frontmatter.ts:50:16
       }
     } else if (ch === '"' || ch === "'") {
       quote = ch;
-    } else if (ch === '#') {
+    } else if (true) {
       return s.slice(0, i).trimEnd();
     }
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected undefined to be 'Foo' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:51:14
     } else if (ch === '"' || ch === "'") {
       quote = ch;
     } else if (ch === '#') {
-      return s.slice(0, i).trimEnd();
+      return s.slice(0, i).trimStart();
     }
   }
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b]' to deeply equal [ 'a', 'b' ]

[Killed] MethodExpression
src/frontmatter.ts:51:14
     } else if (ch === '"' || ch === "'") {
       quote = ch;
     } else if (ch === '#') {
-      return s.slice(0, i).trimEnd();
+      return s.trimEnd();
     }
   }
killedBy: parseFrontmatter parses inline arrays and scalars with trailing comments
statusReason: expected '[a, b] # a comment' to deeply equal [ 'a', 'b' ]

[Survived] MethodExpression
src/frontmatter.ts:54:10
       return s.slice(0, i).trimEnd();
     }
   }
-  return s.trimEnd();
+  return s.trimStart();
 }
 

[Killed] BlockStatement
src/frontmatter.ts:57:60
   return s.trimEnd();
 }
 
-export function parseFrontmatter(raw: string): Frontmatter {
-  // Strip a leading UTF-8 BOM: a teammate's editor (or a git pull through a
-  // BOM-adding tool) can save an org-vault memory with a BOM before the `---`
-  // fence. FM_RE is anchored at ^---, so a BOM would silently break the match
-  // and the whole frontmatter (title/tags/author) would be dropped on boot.
-  // REVIEW 4.5.
-  const bomless = raw.charCodeAt(0) === 0xfeff ? raw.slice(1) : raw;
-  const match = bomless.match(FM_RE);
-  // 10.4 (REVIEW C-21): return bomless, not raw — a BOM-prefixed file with no
-  // frontmatter would otherwise leak the BOM into the content body.
-  if (!match) return { data: {}, content: bomless };
-  // Group 1 of FM_RE is guaranteed by the regex when match succeeds.
-  const data = parseYamlish(match[1]!);
-  const content = bomless.slice(match.index! + match[0]!.length);
-  return { data, content };
-}
+export function parseFrontmatter(raw: string): Frontmatter {}
 
 export function stringifyFrontmatter(content: string, data: object): string {
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: Cannot destructure property 'data' of 'parseFrontmatter(...)' as it is undefined.

[Killed] ConditionalExpression
src/frontmatter.ts:63:19
   // fence. FM_RE is anchored at ^---, so a BOM would silently break the match
   // and the whole frontmatter (title/tags/author) would be dropped on boot.
   // REVIEW 4.5.
-  const bomless = raw.charCodeAt(0) === 0xfeff ? raw.slice(1) : raw;
+  const bomless = false ? raw.slice(1) : raw;
   const match = bomless.match(FM_RE);
   // 10.4 (REVIEW C-21): return bomless, not raw — a BOM-prefixed file with no
killedBy: parseFrontmatter strips a leading UTF-8 BOM so the frontmatter fence still matches (REVIEW 4.5)
statusReason: expected undefined to be 'BOM' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:63:50
   // fence. FM_RE is anchored at ^---, so a BOM would silently break the match
   // and the whole frontmatter (title/tags/author) would be dropped on boot.
   // REVIEW 4.5.
-  const bomless = raw.charCodeAt(0) === 0xfeff ? raw.slice(1) : raw;
+  const bomless = raw.charCodeAt(0) === 0xfeff ? raw : raw;
   const match = bomless.match(FM_RE);
   // 10.4 (REVIEW C-21): return bomless, not raw — a BOM-prefixed file with no
killedBy: parseFrontmatter strips a leading UTF-8 BOM so the frontmatter fence still matches (REVIEW 4.5)
statusReason: expected undefined to be 'BOM' // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:67:7
   const match = bomless.match(FM_RE);
   // 10.4 (REVIEW C-21): return bomless, not raw — a BOM-prefixed file with no
   // frontmatter would otherwise leak the BOM into the content body.
-  if (!match) return { data: {}, content: bomless };
+  if (false) return { data: {}, content: bomless };
   // Group 1 of FM_RE is guaranteed by the regex when match succeeds.
   const data = parseYamlish(match[1]!);
killedBy: parseFrontmatter returns empty data and full raw when no frontmatter present
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
src/frontmatter.ts:67:7
   const match = bomless.match(FM_RE);
   // 10.4 (REVIEW C-21): return bomless, not raw — a BOM-prefixed file with no
   // frontmatter would otherwise leak the BOM into the content body.
-  if (!match) return { data: {}, content: bomless };
+  if (match) return { data: {}, content: bomless };
   // Group 1 of FM_RE is guaranteed by the regex when match succeeds.
   const data = parseYamlish(match[1]!);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1381033610, path: "0:0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArithmeticOperator
src/frontmatter.ts:70:33
   if (!match) return { data: {}, content: bomless };
   // Group 1 of FM_RE is guaranteed by the regex when match succeeds.
   const data = parseYamlish(match[1]!);
-  const content = bomless.slice(match.index! + match[0]!.length);
+  const content = bomless.slice(match.index! - match[0]!.length);
   return { data, content };
 }
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected 'itle: Foo\ntags: [a, b-c, "c"]\nimpor…' to be 'body\n' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:70:19
   if (!match) return { data: {}, content: bomless };
   // Group 1 of FM_RE is guaranteed by the regex when match succeeds.
   const data = parseYamlish(match[1]!);
-  const content = bomless.slice(match.index! + match[0]!.length);
+  const content = bomless;
   return { data, content };
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1809948099, path: "0:0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:74:77
   return { data, content };
 }
 
-export function stringifyFrontmatter(content: string, data: object): string {
-  const lines: string[] = [];
-  const rawData = data as Record<string, unknown>;
-  const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
-
-  const customKeys = Object.keys(rawData)
-    .filter(k => !orderedKeys.includes(k))
-    .sort();
-  const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
-
-  for (const k of keysToSerialize) {
-    const v = rawData[k];
-    if (v === undefined || v === null) continue;
-    lines.push(`${k}: ${serializeValue(v)}`);
-  }
-  return `---\n${lines.join('\n')}\n---\n${content}`;
-}
+export function stringifyFrontmatter(content: string, data: object): string {}
 
 // Ensure a memory body begins with a "## Executive Summary" section. Idempotent:
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1452509469, path: "0:0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/frontmatter.ts:77:24
 export function stringifyFrontmatter(content: string, data: object): string {
   const lines: string[] = [];
   const rawData = data as Record<string, unknown>;
-  const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
+  const orderedKeys = ["", 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
   const customKeys = Object.keys(rawData)
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntags: [a, b-c]\ntitle: Foo\n---\…' to be '---\ntitle: Foo\ntags: [a, b-c]\n---\…' // Object.is equality

[Survived] StringLiteral
src/frontmatter.ts:77:33
 export function stringifyFrontmatter(content: string, data: object): string {
   const lines: string[] = [];
   const rawData = data as Record<string, unknown>;
-  const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
+  const orderedKeys = ['title', "", 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
   const customKeys = Object.keys(rawData)

[Killed] MethodExpression
src/frontmatter.ts:79:22
   const rawData = data as Record<string, unknown>;
   const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
-  const customKeys = Object.keys(rawData)
-    .filter(k => !orderedKeys.includes(k))
-    .sort();
+  const customKeys = Object.keys(rawData).filter(k => !orderedKeys.includes(k));
   const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
 
killedBy: frontmatter property tests emits known keys in canonical order, then unknown keys sorted alphabetically
statusReason: Property failed after 1 tests
{ seed: 1037232654, path: "0:1:0:0:2:1:3:2:2:2:3:4:1:1:3:3", endOnFailure: true }
Counterexample: [{"aa":false,"a":0}]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/frontmatter.ts:79:22
   const rawData = data as Record<string, unknown>;
   const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
-  const customKeys = Object.keys(rawData)
-    .filter(k => !orderedKeys.includes(k))
+  const customKeys = Object.keys(rawData)
     .sort();
   const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: Foo\ntags: [a, b-c]\ntags…' to be '---\ntitle: Foo\ntags: [a, b-c]\n---\…' // Object.is equality

[Killed] ArrowFunction
src/frontmatter.ts:80:13
   const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
   const customKeys = Object.keys(rawData)
-    .filter(k => !orderedKeys.includes(k))
+    .filter(() => undefined)
     .sort();
   const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1900339637, path: "0:1:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/frontmatter.ts:80:18
   const orderedKeys = ['title', 'tags', 'author', 'sessions', 'created', 'updated', 'importanceScore', 'supersededAt'];
 
   const customKeys = Object.keys(rawData)
-    .filter(k => !orderedKeys.includes(k))
+    .filter(k => orderedKeys.includes(k))
     .sort();
   const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1388563178, path: "0:1:1:1:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/frontmatter.ts:82:50
   const customKeys = Object.keys(rawData)
     .filter(k => !orderedKeys.includes(k))
     .sort();
-  const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
+  const keysToSerialize = [...orderedKeys.filter(() => undefined), ...customKeys];
 
   for (const k of keysToSerialize) {
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\n\n---\nbody' to contain 'tags: [a, b-c]'

[Survived] MethodExpression
src/frontmatter.ts:82:31
   const customKeys = Object.keys(rawData)
     .filter(k => !orderedKeys.includes(k))
     .sort();
-  const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
+  const keysToSerialize = [...orderedKeys, ...customKeys];
 
   for (const k of keysToSerialize) {

[Killed] BlockStatement
src/frontmatter.ts:84:36
     .sort();
   const keysToSerialize = [...orderedKeys.filter(k => k in rawData), ...customKeys];
 
-  for (const k of keysToSerialize) {
-    const v = rawData[k];
-    if (v === undefined || v === null) continue;
-    lines.push(`${k}: ${serializeValue(v)}`);
-  }
+  for (const k of keysToSerialize) {}
   return `---\n${lines.join('\n')}\n---\n${content}`;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 921482588, path: "0:1:0:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:86:9
 
   for (const k of keysToSerialize) {
     const v = rawData[k];
-    if (v === undefined || v === null) continue;
+    if (v !== undefined || v === null) continue;
     lines.push(`${k}: ${serializeValue(v)}`);
   }
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\n\n---\nbody' to contain 'tags: [a, b-c]'

[Killed] EqualityOperator
src/frontmatter.ts:86:28
 
   for (const k of keysToSerialize) {
     const v = rawData[k];
-    if (v === undefined || v === null) continue;
+    if (v === undefined || v !== null) continue;
     lines.push(`${k}: ${serializeValue(v)}`);
   }
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\n\n---\nbody' to contain 'tags: [a, b-c]'

[Killed] StringLiteral
src/frontmatter.ts:87:16
   for (const k of keysToSerialize) {
     const v = rawData[k];
     if (v === undefined || v === null) continue;
-    lines.push(`${k}: ${serializeValue(v)}`);
+    lines.push(``);
   }
   return `---\n${lines.join('\n')}\n---\n${content}`;
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\n\n\n---\nbody' to contain 'tags: [a, b-c]'

[Killed] StringLiteral
src/frontmatter.ts:89:10
     if (v === undefined || v === null) continue;
     lines.push(`${k}: ${serializeValue(v)}`);
   }
-  return `---\n${lines.join('\n')}\n---\n${content}`;
+  return ``;
 }
 
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '' to contain 'tags: [a, b-c]'

[Killed] StringLiteral
src/frontmatter.ts:89:29
     if (v === undefined || v === null) continue;
     lines.push(`${k}: ${serializeValue(v)}`);
   }
-  return `---\n${lines.join('\n')}\n---\n${content}`;
+  return `---\n${lines.join("")}\n---\n${content}`;
 }
 
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: Footags: [a, b-c]\n---\nb…' to be '---\ntitle: Foo\ntags: [a, b-c]\n---\…' // Object.is equality

[Killed] BlockStatement
src/frontmatter.ts:97:63
 // it when a caller passes content that already includes the heading). Returns the
 // body string to hand to stringifyFrontmatter — leading newline included so the
 // on-disk body matches what parseFrontmatter(content) yields on the read path.
-export function withExecutiveSummary(content: string): string {
-  return content.trimStart().startsWith('## Executive Summary')
-    ? `\n${content.trimStart()}`
-    : `\n## Executive Summary\n\n${content}`;
-}
+export function withExecutiveSummary(content: string): string {}
 
 // ─── parse ───────────────────────────────────────────────────────────────────
killedBy: withExecutiveSummary prepends the header when the content has none (first-time write path)
statusReason: expected undefined to be '\n## Executive Summary\n\nJust a body.' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:98:10
 // body string to hand to stringifyFrontmatter — leading newline included so the
 // on-disk body matches what parseFrontmatter(content) yields on the read path.
 export function withExecutiveSummary(content: string): string {
-  return content.trimStart().startsWith('## Executive Summary')
+  return content.trimStart().endsWith('## Executive Summary')
     ? `\n${content.trimStart()}`
     : `\n## Executive Summary\n\n${content}`;
killedBy: withExecutiveSummary does NOT double the header when called on content that already starts with it (T5 idempotency)
statusReason: expected '\n## Executive Summary\n\n## Executiv…' to be '\n## Executive Summary\n\nExisting bo…' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:98:10
 // body string to hand to stringifyFrontmatter — leading newline included so the
 // on-disk body matches what parseFrontmatter(content) yields on the read path.
 export function withExecutiveSummary(content: string): string {
-  return content.trimStart().startsWith('## Executive Summary')
+  return content.trimEnd().startsWith('## Executive Summary')
     ? `\n${content.trimStart()}`
     : `\n## Executive Summary\n\n${content}`;
killedBy: withExecutiveSummary handles leading whitespace before the existing header (trimStart cover)
statusReason: expected 2 to be 1 // Object.is equality

[Survived] MethodExpression
src/frontmatter.ts:99:12
 // on-disk body matches what parseFrontmatter(content) yields on the read path.
 export function withExecutiveSummary(content: string): string {
   return content.trimStart().startsWith('## Executive Summary')
-    ? `\n${content.trimStart()}`
+    ? `\n${content.trimEnd()}`
     : `\n## Executive Summary\n\n${content}`;
 }
