[Killed] BlockStatement
src/embeddings.ts:29:9
  */
 export function __testSetEmbedder(
   embedder: ((text: string) => Promise<number[] | null>) | null
-): void {
-  if (process.env.NODE_ENV !== 'test') {
-    throw new Error('__testSetEmbedder is test-only');
-  }
-  if (embedder === null) {
-    // Simulate "model unavailable": getEmbedder returns null.
-    testEmbedder = null;
-    loadPromise = Promise.resolve(null);
-    pipeline = null;
-  } else {
-    testEmbedder = embedder;
-    loadPromise = Promise.resolve(embedder);
-    pipeline = embedder as (text: string) => Promise<number[]>;
-  }
-}
+): void {}
 
 // getEmbedder resolves to the in-process HuggingFace embed function:
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/embeddings.ts:30:7
 export function __testSetEmbedder(
   embedder: ((text: string) => Promise<number[] | null>) | null
 ): void {
-  if (process.env.NODE_ENV !== 'test') {
+  if (process.env.NODE_ENV === 'test') {
     throw new Error('__testSetEmbedder is test-only');
   }
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: __testSetEmbedder is test-only

[Killed] ConditionalExpression
src/embeddings.ts:30:7
 export function __testSetEmbedder(
   embedder: ((text: string) => Promise<number[] | null>) | null
 ): void {
-  if (process.env.NODE_ENV !== 'test') {
+  if (true) {
     throw new Error('__testSetEmbedder is test-only');
   }
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: __testSetEmbedder is test-only

[Killed] ConditionalExpression
src/embeddings.ts:33:7
   if (process.env.NODE_ENV !== 'test') {
     throw new Error('__testSetEmbedder is test-only');
   }
-  if (embedder === null) {
+  if (true) {
     // Simulate "model unavailable": getEmbedder returns null.
     testEmbedder = null;
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/embeddings.ts:33:7
   if (process.env.NODE_ENV !== 'test') {
     throw new Error('__testSetEmbedder is test-only');
   }
-  if (embedder === null) {
+  if (embedder !== null) {
     // Simulate "model unavailable": getEmbedder returns null.
     testEmbedder = null;
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/embeddings.ts:38:10
     testEmbedder = null;
     loadPromise = Promise.resolve(null);
     pipeline = null;
-  } else {
-    testEmbedder = embedder;
-    loadPromise = Promise.resolve(embedder);
-    pipeline = embedder as (text: string) => Promise<number[]>;
-  }
+  } else {}
 }
 
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/embeddings.ts:53:92
 // A load failure is NOT cached (3.9): loadPromise is cleared in the catch so
 // the next embed() retries — a first-run model-download hiccup no longer
 // permanently disables vectors for the session.
-async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
-  if (testEmbedder !== undefined) return testEmbedder;
-  if (loadPromise) return loadPromise;
-  loadPromise = (async () => {
-    try {
-      const { pipeline: hfPipeline } = await import('@huggingface/transformers');
-      const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
-      const extractor = await hfPipeline('feature-extraction', model);
-      pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
-        return Array.from(output.data as Float32Array);
-      };
-      return pipeline;
-    } catch {
-      // Don't cache the failure: clear loadPromise so the next call retries
-      // (mirrors vectorStore.getDb "only cache successful loads"). A transient
-      // model-download error shouldn't latch vectors off for the whole session.
-      pipeline = null;
-      loadPromise = null;
-      return null;
-    }
-  })();
-  return loadPromise;
-}
+async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {}
 
 // Canonical text fed to the embedder for a (title, body) memory (3.3). The
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/embeddings.ts:54:7
 // the next embed() retries — a first-run model-download hiccup no longer
 // permanently disables vectors for the session.
 async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
-  if (testEmbedder !== undefined) return testEmbedder;
+  if (testEmbedder === undefined) return testEmbedder;
   if (loadPromise) return loadPromise;
   loadPromise = (async () => {

[Survived] ConditionalExpression
src/embeddings.ts:54:7
 // the next embed() retries — a first-run model-download hiccup no longer
 // permanently disables vectors for the session.
 async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
-  if (testEmbedder !== undefined) return testEmbedder;
+  if (true) return testEmbedder;
   if (loadPromise) return loadPromise;
   loadPromise = (async () => {

[NoCoverage] ConditionalExpression
src/embeddings.ts:55:7
 // permanently disables vectors for the session.
 async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
   if (testEmbedder !== undefined) return testEmbedder;
-  if (loadPromise) return loadPromise;
+  if (true) return loadPromise;
   loadPromise = (async () => {
     try {

[NoCoverage] ConditionalExpression
src/embeddings.ts:55:7
 // permanently disables vectors for the session.
 async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
   if (testEmbedder !== undefined) return testEmbedder;
-  if (loadPromise) return loadPromise;
+  if (false) return loadPromise;
   loadPromise = (async () => {
     try {

[NoCoverage] BlockStatement
src/embeddings.ts:56:30
 async function getEmbedder(): Promise<((text: string) => Promise<number[] | null>) | null> {
   if (testEmbedder !== undefined) return testEmbedder;
   if (loadPromise) return loadPromise;
-  loadPromise = (async () => {
-    try {
-      const { pipeline: hfPipeline } = await import('@huggingface/transformers');
-      const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
-      const extractor = await hfPipeline('feature-extraction', model);
-      pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
-        return Array.from(output.data as Float32Array);
-      };
-      return pipeline;
-    } catch {
-      // Don't cache the failure: clear loadPromise so the next call retries
-      // (mirrors vectorStore.getDb "only cache successful loads"). A transient
-      // model-download error shouldn't latch vectors off for the whole session.
-      pipeline = null;
-      loadPromise = null;
-      return null;
-    }
-  })();
+  loadPromise = (async () => {})();
   return loadPromise;
 }

[NoCoverage] BlockStatement
src/embeddings.ts:57:9
   if (testEmbedder !== undefined) return testEmbedder;
   if (loadPromise) return loadPromise;
   loadPromise = (async () => {
-    try {
-      const { pipeline: hfPipeline } = await import('@huggingface/transformers');
-      const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
-      const extractor = await hfPipeline('feature-extraction', model);
-      pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
-        return Array.from(output.data as Float32Array);
-      };
-      return pipeline;
-    } catch {
+    try {} catch {
       // Don't cache the failure: clear loadPromise so the next call retries
       // (mirrors vectorStore.getDb "only cache successful loads"). A transient

[NoCoverage] LogicalOperator
src/embeddings.ts:59:21
   loadPromise = (async () => {
     try {
       const { pipeline: hfPipeline } = await import('@huggingface/transformers');
-      const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
+      const model = loadConfig().embeddingModel && 'Xenova/all-MiniLM-L6-v2';
       const extractor = await hfPipeline('feature-extraction', model);
       pipeline = async (text: string) => {

[NoCoverage] ConditionalExpression
src/embeddings.ts:59:21
   loadPromise = (async () => {
     try {
       const { pipeline: hfPipeline } = await import('@huggingface/transformers');
-      const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
+      const model = true;
       const extractor = await hfPipeline('feature-extraction', model);
       pipeline = async (text: string) => {

[NoCoverage] BlockStatement
src/embeddings.ts:61:42
       const { pipeline: hfPipeline } = await import('@huggingface/transformers');
       const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
       const extractor = await hfPipeline('feature-extraction', model);
-      pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
-        return Array.from(output.data as Float32Array);
-      };
+      pipeline = async (text: string) => {};
       return pipeline;
     } catch {

[NoCoverage] BooleanLiteral
src/embeddings.ts:62:76
       const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
       const extractor = await hfPipeline('feature-extraction', model);
       pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
+        const output = await extractor(text, { pooling: 'mean', normalize: false });
         return Array.from(output.data as Float32Array);
       };

[NoCoverage] ObjectLiteral
src/embeddings.ts:62:46
       const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
       const extractor = await hfPipeline('feature-extraction', model);
       pipeline = async (text: string) => {
-        const output = await extractor(text, { pooling: 'mean', normalize: true });
+        const output = await extractor(text, {});
         return Array.from(output.data as Float32Array);
       };

[NoCoverage] BlockStatement
src/embeddings.ts:66:13
         return Array.from(output.data as Float32Array);
       };
       return pipeline;
-    } catch {
-      // Don't cache the failure: clear loadPromise so the next call retries
-      // (mirrors vectorStore.getDb "only cache successful loads"). A transient
-      // model-download error shouldn't latch vectors off for the whole session.
-      pipeline = null;
-      loadPromise = null;
-      return null;
-    }
+    } catch {}
   })();
   return loadPromise;

[Survived] BlockStatement
src/embeddings.ts:89:67
 // EMBED_BODY_SLICE (MiniLM-L6 truncates at 256 tokens anyway, so a longer body
 // adds no signal — the slice loses nothing and bounds the embed input).
 export const EMBED_BODY_SLICE = 2000;
-export function embedTextFor(title: string, body: string): string {
-  return `${title || ''}\n\n${(body || '').slice(0, EMBED_BODY_SLICE)}`;
-}
+export function embedTextFor(title: string, body: string): string {}
 
 export async function embed(text: string): Promise<number[] | null> {

[Killed] ConditionalExpression
src/embeddings.ts:90:32
 // adds no signal — the slice loses nothing and bounds the embed input).
 export const EMBED_BODY_SLICE = 2000;
 export function embedTextFor(title: string, body: string): string {
-  return `${title || ''}\n\n${(body || '').slice(0, EMBED_BODY_SLICE)}`;
+  return `${title || ''}\n\n${(true).slice(0, EMBED_BODY_SLICE)}`;
 }
 
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).slice is not a function

[Killed] ConditionalExpression
src/embeddings.ts:90:32
 // adds no signal — the slice loses nothing and bounds the embed input).
 export const EMBED_BODY_SLICE = 2000;
 export function embedTextFor(title: string, body: string): string {
-  return `${title || ''}\n\n${(body || '').slice(0, EMBED_BODY_SLICE)}`;
+  return `${title || ''}\n\n${(false).slice(0, EMBED_BODY_SLICE)}`;
 }
 
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).slice is not a function

[Killed] BooleanLiteral
src/embeddings.ts:95:7
 
 export async function embed(text: string): Promise<number[] | null> {
   const embedder = await getEmbedder();
-  if (!embedder) return null;
+  if (embedder) return null;
   // Let a per-call inference error propagate: the fire-and-forget write path's
   // .catch attributes it under the key prefix (embedAndUpsert(key): …), and the
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/embeddings.ts:95:7
 
 export async function embed(text: string): Promise<number[] | null> {
   const embedder = await getEmbedder();
-  if (!embedder) return null;
+  if (false) return null;
   // Let a per-call inference error propagate: the fire-and-forget write path's
   // .catch attributes it under the key prefix (embedAndUpsert(key): …), and the
killedBy: embeddings — embedder unavailable returns null when the embedder is unavailable
statusReason: embedder is not a function

[Killed] EqualityOperator
src/embeddings.ts:110:30
   // null-skips the write, recall falls back to TF-IDF) instead of corrupting
   // the index with a zero-length row. isVectorAvailable() is unaffected — it
   // reflects pipeline-load state, not a single call's output.
-  if (!Array.isArray(vec) || vec.length === 0) {
+  if (!Array.isArray(vec) || vec.length !== 0) {
     recordError(
       `embed: model returned ${Array.isArray(vec) ? 'empty' : 'non-array'} vector ` +
killedBy: embeddings — success path returns a float array when pipeline loads and runs successfully
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/embeddings.ts:110:7
   // null-skips the write, recall falls back to TF-IDF) instead of corrupting
   // the index with a zero-length row. isVectorAvailable() is unaffected — it
   // reflects pipeline-load state, not a single call's output.
-  if (!Array.isArray(vec) || vec.length === 0) {
+  if (!Array.isArray(vec) && vec.length === 0) {
     recordError(
       `embed: model returned ${Array.isArray(vec) ? 'empty' : 'non-array'} vector ` +
killedBy: embeddings — success path embed() returns null and records when the model returns an empty array (3.4)
statusReason: expected [] to be null

[Killed] StringLiteral
src/embeddings.ts:112:53
   // reflects pipeline-load state, not a single call's output.
   if (!Array.isArray(vec) || vec.length === 0) {
     recordError(
-      `embed: model returned ${Array.isArray(vec) ? 'empty' : 'non-array'} vector ` +
+      `embed: model returned ${Array.isArray(vec) ? "" : 'non-array'} vector ` +
       `for text of length ${text.length}`
     );
killedBy: embeddings — success path embed() returns null and records when the model returns an empty array (3.4)
statusReason: expected 'embed: model returned  vector for tex…' to contain 'empty'

[Killed] StringLiteral
src/embeddings.ts:112:63
   // reflects pipeline-load state, not a single call's output.
   if (!Array.isArray(vec) || vec.length === 0) {
     recordError(
-      `embed: model returned ${Array.isArray(vec) ? 'empty' : 'non-array'} vector ` +
+      `embed: model returned ${Array.isArray(vec) ? 'empty' : ""} vector ` +
       `for text of length ${text.length}`
     );
killedBy: embeddings — success path embed() returns null and records when the model returns a non-array (3.4)
statusReason: expected 'embed: model returned  vector for tex…' to contain 'non-array'

[Killed] BlockStatement
src/embeddings.ts:141:65
 // (vault-scan.ts) closes pre-existing holes; this closes new ones.
 const pendingEmbeds = new Set<Promise<void>>();
 
-export function embedAndUpsert(key: string, body: string): void {
-  // 3.3: embed the CANONICAL (title + body) text so a memory's vector reflects
-  // its heading — matching what rerank_memories computes for the same key, so a
-  // stored vector and a fresh rerank vector agree (and a title query finds the
-  // memory). The title is looked up from memIndex at call time (already
-  // populated by the time any write path reaches here). The (key, body)
-  // signature is preserved so store/update call sites and their tests stay
-  // unchanged; body is sliced inside embedTextFor (MiniLM truncates past 256
-  // tokens, so the slice loses no signal).
-  const title = memIndex[key]?.title ?? '';
-  const p = embed(embedTextFor(title, body))
-    .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
-    .catch(e => { recordError(`embedAndUpsert(${key}): ${e instanceof Error ? e.message : String(e)}`); });
-  pendingEmbeds.add(p);
-  p.finally(() => pendingEmbeds.delete(p));
-}
+export function embedAndUpsert(key: string, body: string): void {}
 
 // Await in-flight embed/upsert promises, bounded by `timeoutMs`, so the
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] OptionalChaining
src/embeddings.ts:150:17
   // signature is preserved so store/update call sites and their tests stay
   // unchanged; body is sliced inside embedTextFor (MiniLM truncates past 256
   // tokens, so the slice loses no signal).
-  const title = memIndex[key]?.title ?? '';
+  const title = memIndex[key].title ?? '';
   const p = embed(embedTextFor(title, body))
     .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: Cannot read properties of undefined (reading 'title')

[Survived] LogicalOperator
src/embeddings.ts:150:17
   // signature is preserved so store/update call sites and their tests stay
   // unchanged; body is sliced inside embedTextFor (MiniLM truncates past 256
   // tokens, so the slice loses no signal).
-  const title = memIndex[key]?.title ?? '';
+  const title = memIndex[key]?.title && '';
   const p = embed(embedTextFor(title, body))
     .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })

[Killed] ConditionalExpression
src/embeddings.ts:152:24
   // tokens, so the slice loses no signal).
   const title = memIndex[key]?.title ?? '';
   const p = embed(embedTextFor(title, body))
-    .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
+    .then(vec => { if (false) return upsertVector(VECTORS_DB, key, vec); })
     .catch(e => { recordError(`embedAndUpsert(${key}): ${e instanceof Error ? e.message : String(e)}`); });
   pendingEmbeds.add(p);
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/embeddings.ts:152:18
   // tokens, so the slice loses no signal).
   const title = memIndex[key]?.title ?? '';
   const p = embed(embedTextFor(title, body))
-    .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
+    .then(vec => {})
     .catch(e => { recordError(`embedAndUpsert(${key}): ${e instanceof Error ? e.message : String(e)}`); });
   pendingEmbeds.add(p);
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/embeddings.ts:153:17
   const title = memIndex[key]?.title ?? '';
   const p = embed(embedTextFor(title, body))
     .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
-    .catch(e => { recordError(`embedAndUpsert(${key}): ${e instanceof Error ? e.message : String(e)}`); });
+    .catch(e => {});
   pendingEmbeds.add(p);
   p.finally(() => pendingEmbeds.delete(p));
killedBy: embeddings — transient upsert failure is recorded (#14) records via recordError when upsertVector rejects
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArrowFunction
src/embeddings.ts:155:13
     .then(vec => { if (vec) return upsertVector(VECTORS_DB, key, vec); })
     .catch(e => { recordError(`embedAndUpsert(${key}): ${e instanceof Error ? e.message : String(e)}`); });
   pendingEmbeds.add(p);
-  p.finally(() => pendingEmbeds.delete(p));
+  p.finally(() => undefined);
 }
 

[Killed] BlockStatement
src/embeddings.ts:163:72
 // promise that exceeds the timeout is left to settle in the background; its
 // key is backfilled on the next boot if it still misses. No-op when nothing is
 // pending (the common exit path — keeps shutdown fast).
-export async function flushEmbeddings(timeoutMs = 2000): Promise<void> {
-  if (pendingEmbeds.size === 0) return;
-  const snapshot = [...pendingEmbeds];
-  let timer: NodeJS.Timeout | undefined;
-  const timeout = new Promise<void>(r => { timer = setTimeout(r, timeoutMs); });
-  try {
-    await Promise.race([Promise.allSettled(snapshot), timeout]);
-  } finally {
-    if (timer) clearTimeout(timer);
-  }
-}
+export async function flushEmbeddings(timeoutMs = 2000): Promise<void> {}
 
 // Honest signal: true only once the pipeline has actually loaded. Used for
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/embeddings.ts:164:7
 // key is backfilled on the next boot if it still misses. No-op when nothing is
 // pending (the common exit path — keeps shutdown fast).
 export async function flushEmbeddings(timeoutMs = 2000): Promise<void> {
-  if (pendingEmbeds.size === 0) return;
+  if (true) return;
   const snapshot = [...pendingEmbeds];
   let timer: NodeJS.Timeout | undefined;
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/embeddings.ts:164:7
 // key is backfilled on the next boot if it still misses. No-op when nothing is
 // pending (the common exit path — keeps shutdown fast).
 export async function flushEmbeddings(timeoutMs = 2000): Promise<void> {
-  if (pendingEmbeds.size === 0) return;
+  if (pendingEmbeds.size !== 0) return;
   const snapshot = [...pendingEmbeds];
   let timer: NodeJS.Timeout | undefined;
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/embeddings.ts:167:42
   if (pendingEmbeds.size === 0) return;
   const snapshot = [...pendingEmbeds];
   let timer: NodeJS.Timeout | undefined;
-  const timeout = new Promise<void>(r => { timer = setTimeout(r, timeoutMs); });
+  const timeout = new Promise<void>(r => {});
   try {
     await Promise.race([Promise.allSettled(snapshot), timeout]);
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) is bounded by the timeout when an upsert never resolves
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/embeddings.ts:168:7
   const snapshot = [...pendingEmbeds];
   let timer: NodeJS.Timeout | undefined;
   const timeout = new Promise<void>(r => { timer = setTimeout(r, timeoutMs); });
-  try {
-    await Promise.race([Promise.allSettled(snapshot), timeout]);
-  } finally {
+  try {} finally {
     if (timer) clearTimeout(timer);
   }
killedBy: embeddings — flushEmbeddings drains pending upserts (#3) awaits a pending embed→upsert before resolving
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/embeddings.ts:170:13
   const timeout = new Promise<void>(r => { timer = setTimeout(r, timeoutMs); });
   try {
     await Promise.race([Promise.allSettled(snapshot), timeout]);
-  } finally {
-    if (timer) clearTimeout(timer);
-  }
+  } finally {}
 }
 

[Survived] ConditionalExpression
src/embeddings.ts:171:9
   try {
     await Promise.race([Promise.allSettled(snapshot), timeout]);
   } finally {
-    if (timer) clearTimeout(timer);
+    if (false) clearTimeout(timer);
   }
 }

[Survived] ConditionalExpression
src/embeddings.ts:171:9
   try {
     await Promise.race([Promise.allSettled(snapshot), timeout]);
   } finally {
-    if (timer) clearTimeout(timer);
+    if (true) clearTimeout(timer);
   }
 }

[Killed] BlockStatement
src/embeddings.ts:180:46
 // not falsely advertise vector search as enabled. The recall hybrid gate does not
 // consult this — it always attempts embed() when hybrid is requested and degrades
 // to TF-IDF via the embed()->null path, which is what triggers the lazy load.
-export function isVectorAvailable(): boolean {
-  if (testEmbedder !== undefined && testEmbedder !== null) return true;
-  if (testEmbedder === null) return false;
-  return pipeline !== null;
-}
+export function isVectorAvailable(): boolean {}
 
 /** Test-only seam: reset the embedder state so each test starts clean. */
killedBy: embeddings — success path isVectorAvailable returns true when pipeline loaded
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/embeddings.ts:181:37
 // consult this — it always attempts embed() when hybrid is requested and degrades
 // to TF-IDF via the embed()->null path, which is what triggers the lazy load.
 export function isVectorAvailable(): boolean {
-  if (testEmbedder !== undefined && testEmbedder !== null) return true;
+  if (testEmbedder !== undefined && testEmbedder === null) return true;
   if (testEmbedder === null) return false;
   return pipeline !== null;
killedBy: embeddings — embedder unavailable isVectorAvailable returns false when the embedder is unavailable
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/embeddings.ts:181:7
 // consult this — it always attempts embed() when hybrid is requested and degrades
 // to TF-IDF via the embed()->null path, which is what triggers the lazy load.
 export function isVectorAvailable(): boolean {
-  if (testEmbedder !== undefined && testEmbedder !== null) return true;
+  if (true) return true;
   if (testEmbedder === null) return false;
   return pipeline !== null;
killedBy: embeddings — embedder unavailable isVectorAvailable returns false when the embedder is unavailable
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/embeddings.ts:182:37
 // to TF-IDF via the embed()->null path, which is what triggers the lazy load.
 export function isVectorAvailable(): boolean {
   if (testEmbedder !== undefined && testEmbedder !== null) return true;
-  if (testEmbedder === null) return false;
+  if (testEmbedder === null) return true;
   return pipeline !== null;
 }
killedBy: embeddings — embedder unavailable isVectorAvailable returns false when the embedder is unavailable
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/embeddings.ts:182:7
 // to TF-IDF via the embed()->null path, which is what triggers the lazy load.
 export function isVectorAvailable(): boolean {
   if (testEmbedder !== undefined && testEmbedder !== null) return true;
-  if (testEmbedder === null) return false;
+  if (false) return false;
   return pipeline !== null;
 }

[NoCoverage] ConditionalExpression
src/embeddings.ts:183:10
 export function isVectorAvailable(): boolean {
   if (testEmbedder !== undefined && testEmbedder !== null) return true;
   if (testEmbedder === null) return false;
-  return pipeline !== null;
+  return true;
 }
 

[NoCoverage] EqualityOperator
src/embeddings.ts:183:10
 export function isVectorAvailable(): boolean {
   if (testEmbedder !== undefined && testEmbedder !== null) return true;
   if (testEmbedder === null) return false;
-  return pipeline !== null;
+  return pipeline === null;
 }
 

[NoCoverage] BlockStatement
src/embeddings.ts:187:55
 }
 
 /** Test-only seam: reset the embedder state so each test starts clean. */
-export function __testResetVectorAvailability(): void {
-  if (process.env.NODE_ENV !== 'test') {
-    throw new Error('__testResetVectorAvailability is test-only');
-  }
-  // Clear the test-embedder seam: a prior test that called __testSetEmbedder(null)
-  // (e.g. the "model unavailable" case) leaves testEmbedder=null, which makes
-  // getEmbedder() return null for EVERY later test — embed() then bails before
-  // loading the pipeline. Resetting here keeps tests isolated by file order.
-  testEmbedder = undefined;
-  pipeline = null;
-  loadPromise = null;
-}
+export function __testResetVectorAvailability(): void {}
