[Killed] BlockStatement
src/frontmatter.ts:105:37
 
 // ─── parse ───────────────────────────────────────────────────────────────────
 
-function unquote(s: string): string {
-  const t = s.trim();
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
-    const inner = t.slice(1, -1);
-    return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
-  }
-  return t;
-}
+function unquote(s: string): string {}
 
 function coerceScalar(s: string): unknown {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1606350713, path: "0:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":""},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/frontmatter.ts:106:13
 // ─── parse ───────────────────────────────────────────────────────────────────
 
 function unquote(s: string): string {
-  const t = s.trim();
+  const t = s;
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
     const inner = t.slice(1, -1);
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected [ 'a', ' b-c', ' "c"' ] to deeply equal [ 'a', 'b-c', 'c' ]

[Killed] BlockStatement
src/frontmatter.ts:107:89
 
 function unquote(s: string): string {
   const t = s.trim();
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
-    const inner = t.slice(1, -1);
-    return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
-  }
+  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {}
   return t;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1572258021, path: "0:1:0:1:1:2:4:3:5:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:107:50
 
 function unquote(s: string): string {
   const t = s.trim();
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
+  if ((t.startsWith("'") && t.endsWith("'")) || (false)) {
     const inner = t.slice(1, -1);
     return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected '"Full"' to be 'Full' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:108:19
 function unquote(s: string): string {
   const t = s.trim();
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
-    const inner = t.slice(1, -1);
+    const inner = t;
     return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: 1592627553, path: "2:1:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":""},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UnaryOperator
src/frontmatter.ts:108:30
 function unquote(s: string): string {
   const t = s.trim();
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
-    const inner = t.slice(1, -1);
+    const inner = t.slice(1, +1);
     return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: 1679205880, path: "2:1:0:1:4:3:2:2", endOnFailure: true }
Counterexample: [{"_":[" "]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/frontmatter.ts:109:12
   const t = s.trim();
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
     const inner = t.slice(1, -1);
-    return t.startsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
+    return t.endsWith("'") ? inner.replace(/''/g, "'") : inner.replace(/\\"/g, '"');
   }
   return t;

[Killed] BlockStatement
src/frontmatter.ts:114:43
   return t;
 }
 
-function coerceScalar(s: string): unknown {
-  const t = s.trim();
-  if (t === '') return '';
-  // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but
-  // our writer only quotes when necessary, so a quoted value is meant to be a string).
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
-    return unquote(t);
-  }
-  if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
-  if (t === 'true' || t === 'True' || t === 'TRUE') return true;
-  if (t === 'false' || t === 'False' || t === 'FALSE') return false;
-  if (t === 'null' || t === '~') return null;
-  return t;
-}
+function coerceScalar(s: string): unknown {}
 
 function parseInlineArray(s: string): string[] {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -41438134, path: "0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":false},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/frontmatter.ts:115:13
 }
 
 function coerceScalar(s: string): unknown {
-  const t = s.trim();
+  const t = s;
   if (t === '') return '';
   // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but

[Killed] ConditionalExpression
src/frontmatter.ts:116:7
 
 function coerceScalar(s: string): unknown {
   const t = s.trim();
-  if (t === '') return '';
+  if (true) return '';
   // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but
   // our writer only quotes when necessary, so a quoted value is meant to be a string).
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1162668960, path: "0:1:0:1:2:2:2", endOnFailure: true }
Counterexample: [{"_":" "},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:116:7
 
 function coerceScalar(s: string): unknown {
   const t = s.trim();
-  if (t === '') return '';
+  if (t !== '') return '';
   // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but
   // our writer only quotes when necessary, so a quoted value is meant to be a string).
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -2020377055, path: "0:2:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":0},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:119:7
   if (t === '') return '';
   // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but
   // our writer only quotes when necessary, so a quoted value is meant to be a string).
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
+  if (t.startsWith("'") && t.endsWith("'") && t.startsWith('"') && t.endsWith('"')) {
     return unquote(t);
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 5 tests
{ seed: -136220795, path: "4:1:0:0:1:1:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:119:7
   if (t === '') return '';
   // Already-quoted → string (don't coerce "0.7" that was intentionally quoted, but
   // our writer only quotes when necessary, so a quoted value is meant to be a string).
-  if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
+  if (true) {
     return unquote(t);
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -1288956591, path: "1:1:0:1:1", endOnFailure: true }
Counterexample: [{"_":0},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:122:7
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
     return unquote(t);
   }
-  if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
+  if (false) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 1986667574, path: "1:1:1:1", endOnFailure: true }
Counterexample: [{"_":0},""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:122:7
   if ((t.startsWith("'") && t.endsWith("'")) || (t.startsWith('"') && t.endsWith('"'))) {
     return unquote(t);
   }
-  if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
+  if (true) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -1311466571, path: "1:1:0:0:1:1:2:1:3:3:2:3:2:3:3", endOnFailure: true }
Counterexample: [{"A":";"},""]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:123:7
     return unquote(t);
   }
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
-  if (t === 'true' || t === 'True' || t === 'TRUE') return true;
+  if ((t === 'true' || t === 'True') && t === 'TRUE') return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
   if (t === 'null' || t === '~') return null;
killedBy: parseFrontmatter coerces booleans and null
statusReason: expected 'true' to be true // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:123:7
     return unquote(t);
   }
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
-  if (t === 'true' || t === 'True' || t === 'TRUE') return true;
+  if (false) return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
   if (t === 'null' || t === '~') return null;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -1855113774, path: "1:1:0:1:1:2:2", endOnFailure: true }
Counterexample: [{"a":true},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:124:7
   }
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
-  if (t === 'false' || t === 'False' || t === 'FALSE') return false;
+  if (false) return false;
   if (t === 'null' || t === '~') return null;
   return t;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 429004540, path: "0:1:2:2:1", endOnFailure: true }
Counterexample: [{"A":false},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:124:7
   }
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
-  if (t === 'false' || t === 'False' || t === 'FALSE') return false;
+  if (false || t === 'FALSE') return false;
   if (t === 'null' || t === '~') return null;
   return t;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 1730473729, path: "1:3:2:1", endOnFailure: true }
Counterexample: [{"_":false},""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:125:7
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
-  if (t === 'null' || t === '~') return null;
+  if (t === 'null' && t === '~') return null;
   return t;
 }
killedBy: parseFrontmatter coerces booleans and null
statusReason: expected 'null' to be null // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:125:7
   if (/^-?\d+(\.\d+)?$/.test(t)) return Number(t);
   if (t === 'true' || t === 'True' || t === 'TRUE') return true;
   if (t === 'false' || t === 'False' || t === 'FALSE') return false;
-  if (t === 'null' || t === '~') return null;
+  if (false) return null;
   return t;
 }
killedBy: parseFrontmatter coerces booleans and null
statusReason: expected 'null' to be null // Object.is equality

[Killed] StringLiteral
src/frontmatter.ts:147:13
   // unquote() on the full token. Preserves the prior behavior for unquoted
   // simple tokens (whitespace trimmed, empties dropped).
   const out: string[] = [];
-  let cur = '';
+  let cur = "Stryker was here!";
   let quote: '"' | "'" | null = null;
   for (let i = 0; i < s.length; i++) {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 787542491, path: "0:1:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":[]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:149:19
   const out: string[] = [];
   let cur = '';
   let quote: '"' | "'" | null = null;
-  for (let i = 0; i < s.length; i++) {
+  for (let i = 0; i <= s.length; i++) {
     const ch = s[i]!;
     if (quote) {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 2028045121, path: "0:1:1:1:2:2:1", endOnFailure: true }
Counterexample: [{"_":[]},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:152:11
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
     if (quote) {
-      if (ch === quote) quote = null;
+      if (true) quote = null;
       cur += ch;
     } else if (ch === "'" || ch === '"') {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -656223658, path: "0:1:0:1:1:5:3:3", endOnFailure: true }
Counterexample: [{"a":[" "," "]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:152:11
   for (let i = 0; i < s.length; i++) {
     const ch = s[i]!;
     if (quote) {
-      if (ch === quote) quote = null;
+      if (false) quote = null;
       cur += ch;
     } else if (ch === "'" || ch === '"') {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 4 tests
{ seed: -675799561, path: "3:2:1:4:3:3:3:3:3:3:3:3", endOnFailure: true }
Counterexample: [{"a":[" "," "]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
src/frontmatter.ts:153:7
     const ch = s[i]!;
     if (quote) {
       if (ch === quote) quote = null;
-      cur += ch;
+      cur -= ch;
     } else if (ch === "'" || ch === '"') {
       quote = ch;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 346530802, path: "0:2:1:3:4:3:4:6:6:4:4:2", endOnFailure: true }
Counterexample: [{"A":[" "]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:154:16
     if (quote) {
       if (ch === quote) quote = null;
       cur += ch;
-    } else if (ch === "'" || ch === '"') {
+    } else if (true) {
       quote = ch;
       cur += ch;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 141186070, path: "0:1:0:0:0:1:1:2:1:2:2:2:2:2:3:3:3:3:3:3", endOnFailure: true }
Counterexample: [{"a":[" "," "]},""]
Shrunk 19 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:154:16
     if (quote) {
       if (ch === quote) quote = null;
       cur += ch;
-    } else if (ch === "'" || ch === '"') {
+    } else if (ch === "'" && ch === '"') {
       quote = ch;
       cur += ch;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 9 tests
{ seed: 545811044, path: "8:1:0:1:3:7:6:6", endOnFailure: true }
Counterexample: [{"_":[","]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
src/frontmatter.ts:156:7
       cur += ch;
     } else if (ch === "'" || ch === '"') {
       quote = ch;
-      cur += ch;
+      cur -= ch;
     } else if (ch === ',') {
       const v = unquote(cur);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1186237558, path: "0:2:1:4:3:3:3:3:3:2", endOnFailure: true }
Counterexample: [{"_":[" "]},""]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:157:16
     } else if (ch === "'" || ch === '"') {
       quote = ch;
       cur += ch;
-    } else if (ch === ',') {
+    } else if (true) {
       const v = unquote(cur);
       if (v !== '') out.push(v);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: 1581862844, path: "2:1:0:0:0:1:2:1:4:5:3:4:3", endOnFailure: true }
Counterexample: [{"a":["A"]},""]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:157:16
     } else if (ch === "'" || ch === '"') {
       quote = ch;
       cur += ch;
-    } else if (ch === ',') {
+    } else if (false) {
       const v = unquote(cur);
       if (v !== '') out.push(v);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 133441901, path: "0:1:2:2:3:2:3:3:3:3:4:4:4:4:4:3", endOnFailure: true }
Counterexample: [{"a":[" "," "]},""]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:159:11
       cur += ch;
     } else if (ch === ',') {
       const v = unquote(cur);
-      if (v !== '') out.push(v);
+      if (false) out.push(v);
       cur = '';
     } else {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1846964088, path: "0:1:0:1:1:3:2:2:2:2:3:3:3:3:3", endOnFailure: true }
Counterexample: [{"a":[" "," "]},""]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:159:11
       cur += ch;
     } else if (ch === ',') {
       const v = unquote(cur);
-      if (v !== '') out.push(v);
+      if (v === '') out.push(v);
       cur = '';
     } else {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1011945456, path: "0:1:0:1:2:1:2:2:2:3:3:3", endOnFailure: true }
Counterexample: [{"_":[" "," "]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/frontmatter.ts:160:13
     } else if (ch === ',') {
       const v = unquote(cur);
       if (v !== '') out.push(v);
-      cur = '';
+      cur = "Stryker was here!";
     } else {
       cur += ch;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: 2118262885, path: "2:3:1:2:3:3:4:4:4:4:4:4:3", endOnFailure: true }
Counterexample: [{"A":[" "," "]},""]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:161:12
       const v = unquote(cur);
       if (v !== '') out.push(v);
       cur = '';
-    } else {
-      cur += ch;
-    }
+    } else {}
   }
   const last = unquote(cur);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 368033898, path: "0:1:2:1:2:2:4:3:4:4:4:3", endOnFailure: true }
Counterexample: [{"_":["."]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] AssignmentOperator
src/frontmatter.ts:162:7
       if (v !== '') out.push(v);
       cur = '';
     } else {
-      cur += ch;
+      cur -= ch;
     }
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: -1698473541, path: "2:2:2:1:2:2:2:3:1:4:2:3:2:3:3", endOnFailure: true }
Counterexample: [{"A":[";"]},""]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:166:7
     }
   }
   const last = unquote(cur);
-  if (last !== '') out.push(last);
+  if (true) out.push(last);
   return out;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 1726145887, path: "1:1:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":[]},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:166:7
     }
   }
   const last = unquote(cur);
-  if (last !== '') out.push(last);
+  if (false) out.push(last);
   return out;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -816633780, path: "0:2:1:2:1:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:174:10
   const data: Record<string, unknown> = {};
   const lines = body.split(/\r?\n/);
   let i = 0;
-  while (i < lines.length) {
+  while (false) {
     const line = lines[i]!;
     i++;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1468248388, path: "0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":[]},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:174:10
   const data: Record<string, unknown> = {};
   const lines = body.split(/\r?\n/);
   let i = 0;
-  while (i < lines.length) {
+  while (i <= lines.length) {
     const line = lines[i]!;
     i++;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1422534523, path: "0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UpdateOperator
src/frontmatter.ts:176:5
   let i = 0;
   while (i < lines.length) {
     const line = lines[i]!;
-    i++;
+    i--;
     if (line.trim() === '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -205840581, path: "0:0", endOnFailure: true }
Counterexample: [{},""]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:177:9
   while (i < lines.length) {
     const line = lines[i]!;
     i++;
-    if (line.trim() === '' || line.trim().startsWith('#')) continue;
+    if (true) continue;
     // Block sequence item belonging to a pending key: "  - value"
     const blockItem = line.match(/^\s+-\s+(.+)$/);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -1108620179, path: "1:1:1:1:1", endOnFailure: true }
Counterexample: [{"_":0},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:177:9
   while (i < lines.length) {
     const line = lines[i]!;
     i++;
-    if (line.trim() === '' || line.trim().startsWith('#')) continue;
+    if (line.trim() !== '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
     const blockItem = line.match(/^\s+-\s+(.+)$/);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1744525119, path: "0:1:0:0:1:1", endOnFailure: true }
Counterexample: [{"_":[]},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] Regex
src/frontmatter.ts:179:34
     i++;
     if (line.trim() === '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
-    const blockItem = line.match(/^\s+-\s+(.+)$/);
+    const blockItem = line.match(/^\s+-\s+(.)$/);
     if (blockItem) {
       // Attach to the most recently seen array-typed key. There is at most one
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected [ 'a' ] to deeply equal [ 'a', 'b-c' ]

[Killed] Regex
src/frontmatter.ts:179:34
     i++;
     if (line.trim() === '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
-    const blockItem = line.match(/^\s+-\s+(.+)$/);
+    const blockItem = line.match(/^\S+-\s+(.+)$/);
     if (blockItem) {
       // Attach to the most recently seen array-typed key. There is at most one
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected [] to deeply equal [ 'a', 'b-c' ]

[Killed] ConditionalExpression
src/frontmatter.ts:180:9
     if (line.trim() === '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
     const blockItem = line.match(/^\s+-\s+(.+)$/);
-    if (blockItem) {
+    if (false) {
       // Attach to the most recently seen array-typed key. There is at most one
       // "open" block-sequence array at any time (parsed top-down; the writer
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected [] to deeply equal [ 'a', 'b-c' ]
