[Killed] ConditionalExpression
src/frontmatter.ts:180:9
     if (line.trim() === '' || line.trim().startsWith('#')) continue;
     // Block sequence item belonging to a pending key: "  - value"
     const blockItem = line.match(/^\s+-\s+(.+)$/);
-    if (blockItem) {
+    if (true) {
       // Attach to the most recently seen array-typed key. There is at most one
       // "open" block-sequence array at any time (parsed top-down; the writer
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected undefined to be 'Foo' // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:186:54
       // emits inline arrays, so a block-sequence here is a legacy / hand-edited
       // fallback). Walk data once for the block, find the array key if any.
       let lastArrayKey: string | null = null;
-      for (const [k, v] of Object.entries(data)) if (Array.isArray(v)) lastArrayKey = k;
+      for (const [k, v] of Object.entries(data)) if (false) lastArrayKey = k;
       if (lastArrayKey) {
         (data[lastArrayKey] as string[]).push(unquote(blockItem[1]!));
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected [] to deeply equal [ 'a', 'b-c' ]

[Survived] ConditionalExpression
src/frontmatter.ts:186:54
       // emits inline arrays, so a block-sequence here is a legacy / hand-edited
       // fallback). Walk data once for the block, find the array key if any.
       let lastArrayKey: string | null = null;
-      for (const [k, v] of Object.entries(data)) if (Array.isArray(v)) lastArrayKey = k;
+      for (const [k, v] of Object.entries(data)) if (true) lastArrayKey = k;
       if (lastArrayKey) {
         (data[lastArrayKey] as string[]).push(unquote(blockItem[1]!));

[Killed] ConditionalExpression
src/frontmatter.ts:187:11
       // fallback). Walk data once for the block, find the array key if any.
       let lastArrayKey: string | null = null;
       for (const [k, v] of Object.entries(data)) if (Array.isArray(v)) lastArrayKey = k;
-      if (lastArrayKey) {
+      if (true) {
         (data[lastArrayKey] as string[]).push(unquote(blockItem[1]!));
         continue;
killedBy: frontmatter — DoS immunity drops __proto__/constructor/prototype keys (no prototype pollution)
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/frontmatter.ts:187:25
       // fallback). Walk data once for the block, find the array key if any.
       let lastArrayKey: string | null = null;
       for (const [k, v] of Object.entries(data)) if (Array.isArray(v)) lastArrayKey = k;
-      if (lastArrayKey) {
-        (data[lastArrayKey] as string[]).push(unquote(blockItem[1]!));
-        continue;
-      }
+      if (lastArrayKey) {}
       // Orphan block item — ignore
       continue;
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected [] to deeply equal [ 'a', 'b-c' ]

[Killed] Regex
src/frontmatter.ts:194:27
       // Orphan block item — ignore
       continue;
     }
-    const kv = line.match(/^([^:\s]+):\s*(.*)$/);
+    const kv = line.match(/([^:\s]+):\s*(.*)$/);
     if (!kv) continue;
     const key = kv[1]!;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Survived] Regex
src/frontmatter.ts:194:27
       // Orphan block item — ignore
       continue;
     }
-    const kv = line.match(/^([^:\s]+):\s*(.*)$/);
+    const kv = line.match(/^([^:\s]+):\s*(.*)/);
     if (!kv) continue;
     const key = kv[1]!;

[Killed] BooleanLiteral
src/frontmatter.ts:195:9
       continue;
     }
     const kv = line.match(/^([^:\s]+):\s*(.*)$/);
-    if (!kv) continue;
+    if (kv) continue;
     const key = kv[1]!;
     // Coerce through "" so the undefined type from noUncheckedIndexedAccess
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 974563349, path: "0:1:0:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:195:9
       continue;
     }
     const kv = line.match(/^([^:\s]+):\s*(.*)$/);
-    if (!kv) continue;
+    if (true) continue;
     const key = kv[1]!;
     // Coerce through "" so the undefined type from noUncheckedIndexedAccess
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1960015382, path: "0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":""},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:199:17
     const key = kv[1]!;
     // Coerce through "" so the undefined type from noUncheckedIndexedAccess
     // doesn't propagate; the next branches all read `val` as a string.
-    const val = kv[2] ?? '';
+    const val = kv[2] && '';
     // Strip trailing comments/whitespace before deciding shape so
     // `tags: [a, b] # comment` is parsed as an inline array, not a scalar.
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1495202726, path: "0:1:0:1:2:1:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"A":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:211:9
     // and Object.keys (which exclude inherited), so the impact is currently
     // inert, but this is a known YAML-parser vuln class; drop the key fail-closed
     // rather than let a teammate control the shape of a parsed object.
-    if (key === '__proto__' || key === 'constructor' || key === 'prototype') continue;
+    if (true) continue;
     if (cleanVal === '' ) {
       // Could be a block sequence (value on following lines) — preset an array
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1729857754, path: "0:1:0:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/frontmatter.ts:211:9
     // and Object.keys (which exclude inherited), so the impact is currently
     // inert, but this is a known YAML-parser vuln class; drop the key fail-closed
     // rather than let a teammate control the shape of a parsed object.
-    if (key === '__proto__' || key === 'constructor' || key === 'prototype') continue;
+    if ((key === '__proto__' || key === 'constructor') && key === 'prototype') continue;
     if (cleanVal === '' ) {
       // Could be a block sequence (value on following lines) — preset an array
killedBy: frontmatter — DoS immunity drops __proto__/constructor/prototype keys (no prototype pollution)
statusReason: expected [] to be { …(12) } // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:212:9
     // inert, but this is a known YAML-parser vuln class; drop the key fail-closed
     // rather than let a teammate control the shape of a parsed object.
     if (key === '__proto__' || key === 'constructor' || key === 'prototype') continue;
-    if (cleanVal === '' ) {
+    if (false ) {
       // Could be a block sequence (value on following lines) — preset an array
       // so subsequent "  - x" items attach to it. If no items follow, drop it.
killedBy: parseFrontmatter parses block-style arrays (written by legacy gray-matter)
statusReason: expected '' to deeply equal [ 'a', 'b-c' ]

[Killed] EqualityOperator
src/frontmatter.ts:212:9
     // inert, but this is a known YAML-parser vuln class; drop the key fail-closed
     // rather than let a teammate control the shape of a parsed object.
     if (key === '__proto__' || key === 'constructor' || key === 'prototype') continue;
-    if (cleanVal === '' ) {
+    if (cleanVal !== '' ) {
       // Could be a block sequence (value on following lines) — preset an array
       // so subsequent "  - x" items attach to it. If no items follow, drop it.
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected undefined to be 'Foo' // Object.is equality

[Killed] MethodExpression
src/frontmatter.ts:218:9
       data[key] = [];
       continue;
     }
-    if (cleanVal.startsWith('[') && cleanVal.endsWith(']')) {
+    if (cleanVal.endsWith('[') && cleanVal.endsWith(']')) {
       data[key] = parseInlineArray(cleanVal.slice(1, -1));
       continue;
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected '[a, b-c, "c"]' to deeply equal [ 'a', 'b-c', 'c' ]

[Killed] BlockStatement
src/frontmatter.ts:218:61
       data[key] = [];
       continue;
     }
-    if (cleanVal.startsWith('[') && cleanVal.endsWith(']')) {
-      data[key] = parseInlineArray(cleanVal.slice(1, -1));
-      continue;
-    }
+    if (cleanVal.startsWith('[') && cleanVal.endsWith(']')) {}
     data[key] = coerceScalar(cleanVal);
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 502387359, path: "0:2:1:1:1", endOnFailure: true }
Counterexample: [{"_":[]},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
src/frontmatter.ts:219:36
       continue;
     }
     if (cleanVal.startsWith('[') && cleanVal.endsWith(']')) {
-      data[key] = parseInlineArray(cleanVal.slice(1, -1));
+      data[key] = parseInlineArray(cleanVal);
       continue;
     }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 322457123, path: "0:1:0:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] UnaryOperator
src/frontmatter.ts:219:54
       continue;
     }
     if (cleanVal.startsWith('[') && cleanVal.endsWith(']')) {
-      data[key] = parseInlineArray(cleanVal.slice(1, -1));
+      data[key] = parseInlineArray(cleanVal.slice(1, +1));
       continue;
     }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 957748992, path: "0:1:0:0:1:1:2:1:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"A":[" "]},""]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:226:46
   }
   // Drop keys that are empty arrays because a block sequence was expected but
   // none followed (keeps `data` clean for keys like `tags:` with nothing under).
-  for (const [k, v] of Object.entries(data)) {
-    if (Array.isArray(v) && v.length === 0 && !hadBlockItems(body, k)) {
-      // Keep empty arrays only if explicitly written as `[]`; a bare `key:` with
-      // no items is treated as absent.
-      // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-      if (!new RegExp(`^${escapeRegExp(k)}:\\s*\\[\\s*\\]\\s*$`, 'm').test(body)) delete data[k];
-    }
-  }
+  for (const [k, v] of Object.entries(data)) {}
   return data;
 }
killedBy: parseFrontmatter drops a bare key: with no items (no spurious empty array)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/frontmatter.ts:227:47
   // Drop keys that are empty arrays because a block sequence was expected but
   // none followed (keeps `data` clean for keys like `tags:` with nothing under).
   for (const [k, v] of Object.entries(data)) {
-    if (Array.isArray(v) && v.length === 0 && !hadBlockItems(body, k)) {
+    if (Array.isArray(v) && v.length === 0 && hadBlockItems(body, k)) {
       // Keep empty arrays only if explicitly written as `[]`; a bare `key:` with
       // no items is treated as absent.
killedBy: parseFrontmatter drops a bare key: with no items (no spurious empty array)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/frontmatter.ts:227:29
   // Drop keys that are empty arrays because a block sequence was expected but
   // none followed (keeps `data` clean for keys like `tags:` with nothing under).
   for (const [k, v] of Object.entries(data)) {
-    if (Array.isArray(v) && v.length === 0 && !hadBlockItems(body, k)) {
+    if (Array.isArray(v) && v.length !== 0 && !hadBlockItems(body, k)) {
       // Keep empty arrays only if explicitly written as `[]`; a bare `key:` with
       // no items is treated as absent.
killedBy: parseFrontmatter parses inline arrays and coerces numbers
statusReason: expected undefined to deeply equal [ 'a', 'b-c', 'c' ]

[Killed] ConditionalExpression
src/frontmatter.ts:231:11
       // Keep empty arrays only if explicitly written as `[]`; a bare `key:` with
       // no items is treated as absent.
       // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-      if (!new RegExp(`^${escapeRegExp(k)}:\\s*\\[\\s*\\]\\s*$`, 'm').test(body)) delete data[k];
+      if (false) delete data[k];
     }
   }
killedBy: parseFrontmatter drops a bare key: with no items (no spurious empty array)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/frontmatter.ts:231:11
       // Keep empty arrays only if explicitly written as `[]`; a bare `key:` with
       // no items is treated as absent.
       // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-      if (!new RegExp(`^${escapeRegExp(k)}:\\s*\\[\\s*\\]\\s*$`, 'm').test(body)) delete data[k];
+      if (true) delete data[k];
     }
   }
killedBy: parseFrontmatter treats an explicit empty array as []
statusReason: expected undefined to deeply equal []

[Survived] BlockStatement
src/frontmatter.ts:237:60
   return data;
 }
 
-function hadBlockItems(body: string, key: string): boolean {
-  // True if `key:` is followed by indented "- " items before the next non-indented line.
-  // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-  const re = new RegExp(`^${escapeRegExp(key)}:\\s*\\n(\\s+-\\s+.+\\n)+`, 'm');
-  return re.test(body);
-}
+function hadBlockItems(body: string, key: string): boolean {}
 
 // ─── serialize ───────────────────────────────────────────────────────────────

[Killed] StringLiteral
src/frontmatter.ts:240:25
 function hadBlockItems(body: string, key: string): boolean {
   // True if `key:` is followed by indented "- " items before the next non-indented line.
   // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-  const re = new RegExp(`^${escapeRegExp(key)}:\\s*\\n(\\s+-\\s+.+\\n)+`, 'm');
+  const re = new RegExp(``, 'm');
   return re.test(body);
 }
killedBy: parseFrontmatter drops a bare key: with no items (no spurious empty array)
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/frontmatter.ts:240:75
 function hadBlockItems(body: string, key: string): boolean {
   // True if `key:` is followed by indented "- " items before the next non-indented line.
   // nosemgrep: detect-non-literal-regexp — key is escapeRegExp()'d, so it matches literally; reviewed.
-  const re = new RegExp(`^${escapeRegExp(key)}:\\s*\\n(\\s+-\\s+.+\\n)+`, 'm');
+  const re = new RegExp(`^${escapeRegExp(key)}:\\s*\\n(\\s+-\\s+.+\\n)+`, "");
   return re.test(body);
 }

[Killed] BlockStatement
src/frontmatter.ts:246:45
 
 // ─── serialize ───────────────────────────────────────────────────────────────
 
-function serializeValue(v: unknown): string {
-  if (Array.isArray(v)) {
-    if (v.length === 0) return '[]';
-    return `[${v.map(serializeArrayItem).join(', ')}]`;
-  }
-  if (typeof v === 'number') return String(v);
-  if (typeof v === 'boolean') return v ? 'true' : 'false';
-  return serializeString(String(v));
-}
+function serializeValue(v: unknown): string {}
 
 function serializeArrayItem(s: unknown): string {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 253608596, path: "0:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":[]},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:247:25
 // ─── serialize ───────────────────────────────────────────────────────────────
 
 function serializeValue(v: unknown): string {
-  if (Array.isArray(v)) {
-    if (v.length === 0) return '[]';
-    return `[${v.map(serializeArrayItem).join(', ')}]`;
-  }
+  if (Array.isArray(v)) {}
   if (typeof v === 'number') return String(v);
   if (typeof v === 'boolean') return v ? 'true' : 'false';
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -940293574, path: "0:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"a":[]},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:247:7
 // ─── serialize ───────────────────────────────────────────────────────────────
 
 function serializeValue(v: unknown): string {
-  if (Array.isArray(v)) {
+  if (false) {
     if (v.length === 0) return '[]';
     return `[${v.map(serializeArrayItem).join(', ')}]`;
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 197137706, path: "1:1:0:1:1:1:1", endOnFailure: true }
Counterexample: [{"A":[]},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:248:9
 
 function serializeValue(v: unknown): string {
   if (Array.isArray(v)) {
-    if (v.length === 0) return '[]';
+    if (v.length !== 0) return '[]';
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -318869434, path: "0:1:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"_":[" "]},""]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:248:9
 
 function serializeValue(v: unknown): string {
   if (Array.isArray(v)) {
-    if (v.length === 0) return '[]';
+    if (true) return '[]';
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -727515796, path: "0:2:1:2:1:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:251:7
     if (v.length === 0) return '[]';
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
-  if (typeof v === 'number') return String(v);
+  if (false) return String(v);
   if (typeof v === 'boolean') return v ? 'true' : 'false';
   return serializeString(String(v));
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 2018729988, path: "0:1:1:1:2:2:2:1", endOnFailure: true }
Counterexample: [{"A":0},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:251:7
     if (v.length === 0) return '[]';
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
-  if (typeof v === 'number') return String(v);
+  if (true) return String(v);
   if (typeof v === 'boolean') return v ? 'true' : 'false';
   return serializeString(String(v));
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 22 tests
{ seed: 637998244, path: "21:1:1:1", endOnFailure: true }
Counterexample: [{"A":""},""]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:252:7
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
   if (typeof v === 'number') return String(v);
-  if (typeof v === 'boolean') return v ? 'true' : 'false';
+  if (false) return v ? 'true' : 'false';
   return serializeString(String(v));
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: -415447602, path: "2:2:1:1:1", endOnFailure: true }
Counterexample: [{"a":false},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:252:7
     return `[${v.map(serializeArrayItem).join(', ')}]`;
   }
   if (typeof v === 'number') return String(v);
-  if (typeof v === 'boolean') return v ? 'true' : 'false';
+  if (true) return v ? 'true' : 'false';
   return serializeString(String(v));
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -673738778, path: "1:2:0:1:2:2:2:1", endOnFailure: true }
Counterexample: [{"A":""},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:256:49
   return serializeString(String(v));
 }
 
-function serializeArrayItem(s: unknown): string {
-  if (typeof s === 'number') return String(s);
-  if (typeof s === 'boolean') return s ? 'true' : 'false';
-  const str = String(s);
-  // A literal newline in an inline-array item would terminate the frontmatter
-  // line and inject a following line as a new key on re-parse. Single-quoted
-  // YAML scalars can't span lines either, so refuse rather than mis-emit.
-  if (/[\r\n]/.test(str)) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
-  return needsArrayItemQuotes(str) ? `'${str.replace(/'/g, "''")}'` : str;
-}
+function serializeArrayItem(s: unknown): string {}
 
 function serializeString(s: string): string {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: 1070626250, path: "0:2:1:2:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"_":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:257:7
 }
 
 function serializeArrayItem(s: unknown): string {
-  if (typeof s === 'number') return String(s);
+  if (true) return String(s);
   if (typeof s === 'boolean') return s ? 'true' : 'false';
   const str = String(s);
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: -438780177, path: "1:2:1:2:3:3:3:3:3:3:3:2", endOnFailure: true }
Counterexample: [{"A":[" "]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:257:7
 }
 
 function serializeArrayItem(s: unknown): string {
-  if (typeof s === 'number') return String(s);
+  if (false) return String(s);
   if (typeof s === 'boolean') return s ? 'true' : 'false';
   const str = String(s);
killedBy: withExecutiveSummary serializes arrays containing non-string primitive items (e.g. numbers in tags)
statusReason: expected '---\ntags: [\'2026\', org]\n---\nbody' to contain 'tags: [2026, org]'

[Killed] EqualityOperator
src/frontmatter.ts:258:7
 
 function serializeArrayItem(s: unknown): string {
   if (typeof s === 'number') return String(s);
-  if (typeof s === 'boolean') return s ? 'true' : 'false';
+  if (typeof s !== 'boolean') return s ? 'true' : 'false';
   const str = String(s);
   // A literal newline in an inline-array item would terminate the frontmatter
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: Foo\ntags: [true, true]\n…' to contain 'tags: [a, b-c]'

[Killed] ConditionalExpression
src/frontmatter.ts:258:7
 
 function serializeArrayItem(s: unknown): string {
   if (typeof s === 'number') return String(s);
-  if (typeof s === 'boolean') return s ? 'true' : 'false';
+  if (true) return s ? 'true' : 'false';
   const str = String(s);
   // A literal newline in an inline-array item would terminate the frontmatter
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: Foo\ntags: [true, true]\n…' to contain 'tags: [a, b-c]'

[Killed] ConditionalExpression
src/frontmatter.ts:263:7
   // A literal newline in an inline-array item would terminate the frontmatter
   // line and inject a following line as a new key on re-parse. Single-quoted
   // YAML scalars can't span lines either, so refuse rather than mis-emit.
-  if (/[\r\n]/.test(str)) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
+  if (true) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
   return needsArrayItemQuotes(str) ? `'${str.replace(/'/g, "''")}'` : str;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 542859825, path: "1:1:0:0:1:1:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:263:7
   // A literal newline in an inline-array item would terminate the frontmatter
   // line and inject a following line as a new key on re-parse. Single-quoted
   // YAML scalars can't span lines either, so refuse rather than mis-emit.
-  if (/[\r\n]/.test(str)) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
+  if (false) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
   return needsArrayItemQuotes(str) ? `'${str.replace(/'/g, "''")}'` : str;
 }
killedBy: stringifyFrontmatter throws on a newline in an inline-array item (T4, frontmatter-key injection guard)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/frontmatter.ts:264:38
   // line and inject a following line as a new key on re-parse. Single-quoted
   // YAML scalars can't span lines either, so refuse rather than mis-emit.
   if (/[\r\n]/.test(str)) throw new Error('Frontmatter array item contains a newline — refusing to emit.');
-  return needsArrayItemQuotes(str) ? `'${str.replace(/'/g, "''")}'` : str;
+  return needsArrayItemQuotes(str) ? `` : str;
 }
 
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -1799365716, path: "0:1:0:1:1:2:2:2:3:3:2:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/frontmatter.ts:267:45
   return needsArrayItemQuotes(str) ? `'${str.replace(/'/g, "''")}'` : str;
 }
 
-function serializeString(s: string): string {
-  // Same injection risk as array items: a newline in a scalar value would spill
-  // onto the next frontmatter line and be parsed as an extra key. Fail closed.
-  if (/[\r\n]/.test(s)) throw new Error('Frontmatter value contains a newline — refusing to emit.');
-  return needsQuotes(s) ? `'${s.replace(/'/g, "''")}'` : s;
-}
+function serializeString(s: string): string {}
 
 function needsQuotes(s: string): boolean {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 6 tests
{ seed: 1810707971, path: "5:2:1:1:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
