[NoCoverage] BlockStatement
src/embeddings.ts:188:40
 
 /** Test-only seam: reset the embedder state so each test starts clean. */
 export function __testResetVectorAvailability(): void {
-  if (process.env.NODE_ENV !== 'test') {
-    throw new Error('__testResetVectorAvailability is test-only');
-  }
+  if (process.env.NODE_ENV !== 'test') {}
   // Clear the test-embedder seam: a prior test that called __testSetEmbedder(null)
   // (e.g. the "model unavailable" case) leaves testEmbedder=null, which makes

[NoCoverage] ConditionalExpression
src/embeddings.ts:188:7
 
 /** Test-only seam: reset the embedder state so each test starts clean. */
 export function __testResetVectorAvailability(): void {
-  if (process.env.NODE_ENV !== 'test') {
+  if (false) {
     throw new Error('__testResetVectorAvailability is test-only');
   }
