[NoCoverage] BlockStatement
src/errors.ts:11:45
 // (a normal, recoverable round-trip collision) rather than "error".
 export class MemoryExistsError extends Error {
   readonly key: string;
-  constructor(key: string, message: string) {
-    super(message);
-    this.name = 'MemoryExistsError';
-    // Preserve the prototype chain across transpilation targets (ES5 down-level
-    // breaks `instanceof` without this).
-    Object.setPrototypeOf(this, MemoryExistsError.prototype);
-    this.key = key;
-  }
+  constructor(key: string, message: string) {}
 }
