[Killed] ConditionalExpression
src/frontmatter.ts:270:7
 function serializeString(s: string): string {
   // Same injection risk as array items: a newline in a scalar value would spill
   // onto the next frontmatter line and be parsed as an extra key. Fail closed.
-  if (/[\r\n]/.test(s)) throw new Error('Frontmatter value contains a newline — refusing to emit.');
+  if (true) throw new Error('Frontmatter value contains a newline — refusing to emit.');
   return needsQuotes(s) ? `'${s.replace(/'/g, "''")}'` : s;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 3 tests
{ seed: -1714420081, path: "2:1:0:1:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] ConditionalExpression
src/frontmatter.ts:270:7
 function serializeString(s: string): string {
   // Same injection risk as array items: a newline in a scalar value would spill
   // onto the next frontmatter line and be parsed as an extra key. Fail closed.
-  if (/[\r\n]/.test(s)) throw new Error('Frontmatter value contains a newline — refusing to emit.');
+  if (false) throw new Error('Frontmatter value contains a newline — refusing to emit.');
   return needsQuotes(s) ? `'${s.replace(/'/g, "''")}'` : s;
 }

[Killed] BlockStatement
src/frontmatter.ts:274:42
   return needsQuotes(s) ? `'${s.replace(/'/g, "''")}'` : s;
 }
 
-function needsQuotes(s: string): boolean {
-  if (s === '') return true;
-  if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
-  if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
-  if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
-  if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
-  if (/#/.test(s)) return true; // comment marker
-  if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
-  if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
-  return false;
-}
+function needsQuotes(s: string): boolean {}
 
 function needsArrayItemQuotes(s: string): boolean {
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 4 tests
{ seed: -394096263, path: "3:1:0:0:1:4:3:3:3:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
src/frontmatter.ts:275:7
 }
 
 function needsQuotes(s: string): boolean {
-  if (s === '') return true;
+  if (s !== '') return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 4 tests
{ seed: -1758435397, path: "3:1:2:2:2:1", endOnFailure: true }
Counterexample: [{"a":""},""]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:275:7
 }
 
 function needsQuotes(s: string): boolean {
-  if (s === '') return true;
+  if (false) return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 5 tests
{ seed: 150984375, path: "4:2:1:2:1", endOnFailure: true }
Counterexample: [{"_":""},""]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/frontmatter.ts:276:33
 
 function needsQuotes(s: string): boolean {
   if (s === '') return true;
-  if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
+  if (/^\s|\s$/.test(s)) return false; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 14 tests
{ seed: -140051511, path: "13:1:1:1:1:2:4:2:2:2", endOnFailure: true }
Counterexample: [{"a":[" "]},""]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:276:7
 
 function needsQuotes(s: string): boolean {
   if (s === '') return true;
-  if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
+  if (true) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] ConditionalExpression
src/frontmatter.ts:277:7
 function needsQuotes(s: string): boolean {
   if (s === '') return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
-  if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
+  if (false) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
killedBy: stringifyFrontmatter quotes and doubles apostrophes when a string starts with one
statusReason: expected '---\ntitle: \'quoted\'\n---\nbody' to contain 'title: \'\'\'quoted\'\'\''

[Killed] BooleanLiteral
src/frontmatter.ts:277:48
 function needsQuotes(s: string): boolean {
   if (s === '') return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
-  if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
+  if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return false; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
killedBy: stringifyFrontmatter quotes and doubles apostrophes when a string starts with one
statusReason: expected '---\ntitle: \'quoted\'\n---\nbody' to contain 'title: \'\'\'quoted\'\'\''

[Killed] BooleanLiteral
src/frontmatter.ts:278:27
   if (s === '') return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
-  if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
+  if (/:/.test(s)) return false; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
killedBy: stringifyFrontmatter quotes strings containing colons (keeps ISO dates as quoted strings)
statusReason: expected '---\ntitle: Kafka: CDC\ncreated: 2026…' to contain 'created: \'2026-04-01T10:00:00.000Z\''

[Killed] ConditionalExpression
src/frontmatter.ts:278:7
   if (s === '') return true;
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
-  if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
+  if (true) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] ConditionalExpression
src/frontmatter.ts:279:7
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
-  if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
+  if (false) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
killedBy: stringifyFrontmatter round-trips a tag containing a comma (quotes the item, parses back intact)
statusReason: expected '---\ntitle: CDC\ntags: [kafka, cdc,ou…' to contain 'tags: [kafka, \'cdc,outbox\']'

[Killed] ConditionalExpression
src/frontmatter.ts:279:7
   if (/^\s|\s$/.test(s)) return true; // leading/trailing whitespace
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
-  if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
+  if (true) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] ConditionalExpression
src/frontmatter.ts:280:7
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
-  if (/#/.test(s)) return true; // comment marker
+  if (true) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
   if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] BooleanLiteral
src/frontmatter.ts:280:27
   if (/^[!&*?|>%@`"'#,[\]{}-]/.test(s)) return true; // YAML indicator chars at start
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
-  if (/#/.test(s)) return true; // comment marker
+  if (/#/.test(s)) return false; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
   if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 2 tests
{ seed: 105476130, path: "1:3:2:3:7:6:6:8:13:8:8:7", endOnFailure: true }
Counterexample: [{"A":["(#"]},""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:281:7
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
-  if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
+  if (true) return true; // YAML keywords
   if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
   return false;
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Survived] BooleanLiteral
src/frontmatter.ts:281:55
   if (/:/.test(s)) return true; // any colon (ISO dates, "Title: Sub") — dates stay strings
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
-  if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
+  if (/^(true|false|null|~|yes|no)$/i.test(s)) return false; // YAML keywords
   if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
   return false;

[Killed] ConditionalExpression
src/frontmatter.ts:282:7
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
-  if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
+  if (false) return true; // looks numeric
   return false;
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 160 tests
{ seed: -1999512279, path: "159:2:0:1:3:5:4:3:4:3", endOnFailure: true }
Counterexample: [{"_":"0"},""]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:282:7
   if (/,/.test(s)) return true; // any comma — would otherwise re-split on parseInlineArray (see round-trip fix there)
   if (/#/.test(s)) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
-  if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
+  if (true) return true; // looks numeric
   return false;
 }
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] BooleanLiteral
src/frontmatter.ts:283:10
   if (/#/.test(s)) return true; // comment marker
   if (/^(true|false|null|~|yes|no)$/i.test(s)) return true; // YAML keywords
   if (/^-?\d+(\.\d+)?$/.test(s)) return true; // looks numeric
-  return false;
+  return true;
 }
 
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: \'Foo\'\ntags: [\'a\', \'…' to contain 'tags: [a, b-c]'

[Killed] BlockStatement
src/frontmatter.ts:286:51
   return false;
 }
 
-function needsArrayItemQuotes(s: string): boolean {
-  // Inline-array items are scanned by a quote-aware comma splitter. Any unquoted
-  // single or double quote inside an item would flip the scanner's quote state
-  // and corrupt the split, so array items must be quoted when they contain a
-  // quote character anywhere (not just at the start).
-  if (/['"]/.test(s)) return true;
-  return needsQuotes(s);
-}
+function needsArrayItemQuotes(s: string): boolean {}
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -716657375, path: "0:1:0:1:3:2:2:3:3:2:2", endOnFailure: true }
Counterexample: [{"_":[" "]},""]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/frontmatter.ts:291:7
   // single or double quote inside an item would flip the scanner's quote state
   // and corrupt the split, so array items must be quoted when they contain a
   // quote character anywhere (not just at the start).
-  if (/['"]/.test(s)) return true;
+  if (true) return true;
   return needsQuotes(s);
 }
killedBy: stringifyFrontmatter serializes arrays inline (compatible with the .cjs sync parser)
statusReason: expected '---\ntitle: Foo\ntags: [\'a\', \'b-c\…' to contain 'tags: [a, b-c]'

[Killed] BooleanLiteral
src/frontmatter.ts:291:30
   // single or double quote inside an item would flip the scanner's quote state
   // and corrupt the split, so array items must be quoted when they contain a
   // quote character anywhere (not just at the start).
-  if (/['"]/.test(s)) return true;
+  if (/['"]/.test(s)) return false;
   return needsQuotes(s);
 }
killedBy: frontmatter property tests round-trips arbitrary serializable data and content (stringify -> parse)
statusReason: Property failed after 1 tests
{ seed: -2051781201, path: "0:2:1:3:8:9:8:7", endOnFailure: true }
Counterexample: [{"a":["'"]},""]
Shrunk 7 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
