[Killed] ArrayDeclaration
src/state.ts:16:38
 export const memIndex: Index = {};
 export const invertedIndex: InvertedIndex = {};
 export const errors: Array<{ time: string; msg: string }> = [];
-export const perfSamples: number[] = [];
+export const perfSamples: number[] = ["Stryker was here"];
 
 // #21: amortized-O(1) bounded append. The prior `if (length > CAP) shift()`
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/state.ts:35:49
 // the exact cap is invisible to consumers either way.
 const ERROR_CAP = 1000;
 const PERF_CAP = 1000;
-function trimTo<T>(arr: T[], cap: number): void {
-  if (arr.length > cap * 2) arr.splice(0, arr.length - cap);
-}
+function trimTo<T>(arr: T[], cap: number): void {}
 
 // Append to the shared `errors` singleton with a cap (see trimTo above). A
killedBy: recordError bounds the errors array at CAP via amortized batched trim (newest preserved)
statusReason: expected 2001 to be 1000 // Object.is equality

[Killed] ConditionalExpression
src/state.ts:36:7
 const ERROR_CAP = 1000;
 const PERF_CAP = 1000;
 function trimTo<T>(arr: T[], cap: number): void {
-  if (arr.length > cap * 2) arr.splice(0, arr.length - cap);
+  if (true) arr.splice(0, arr.length - cap);
 }
 
killedBy: vectorStore — getVectors batch read (real sqlite-vec) 11.3a (3.2): returns an empty Map when expectedDim mismatches the stored dim (rerank re-embeds fresh)
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] EqualityOperator
src/state.ts:36:7
 const ERROR_CAP = 1000;
 const PERF_CAP = 1000;
 function trimTo<T>(arr: T[], cap: number): void {
-  if (arr.length > cap * 2) arr.splice(0, arr.length - cap);
+  if (arr.length >= cap * 2) arr.splice(0, arr.length - cap);
 }
 
killedBy: vectorStore — getVectors batch read (real sqlite-vec) 11.3a (3.2): returns an empty Map when expectedDim mismatches the stored dim (rerank re-embeds fresh)
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/state.ts:45:48
 // every reconcile — would otherwise grow `errors` without limit. Centralized
 // here so every push site (server.ts dispatch catch, vault-scan indexFile catch,
 // persistence debounce/flush catches) is bounded uniformly.
-export function recordError(msg: string): void {
-  errors.push({ time: new Date().toISOString(), msg });
-  trimTo(errors, ERROR_CAP);
-}
+export function recordError(msg: string): void {}
 
 // Record a tool-call latency sample with the same bounded-append policy as
killedBy: recordError bounds the errors array at CAP via amortized batched trim (newest preserved)
statusReason: expected +0 to be 1001 // Object.is equality

[NoCoverage] BlockStatement
src/state.ts:55:52
 // derives p50/p95/p99 from [...perfSamples].sort. Centralized so the cap + trim
 // live in one place (the prior inline `push; if (>1000) shift` in server.ts was
 // a second copy of the same O(N²) pattern).
-export function recordPerfSample(ms: number): void {
-  perfSamples.push(ms);
-  trimTo(perfSamples, PERF_CAP);
-}
+export function recordPerfSample(ms: number): void {}
 
 // Bump the access-tracking fields (accessCount + lastAccessed) on a memory entry

[Killed] BlockStatement
src/state.ts:79:55
 // rewrite per access on a read-heavy session). Writes (store/update/delete/
 // reconcile) still call scheduleSave, which sets the dirtyTokens flag and
 // schedules the rebuild.
-export function bumpAccess(meta: Index[string]): void {
-  meta.accessCount++;
-  meta.lastAccessed = new Date().toISOString();
-  scheduleAccessSave();
-}
+export function bumpAccess(meta: Index[string]): void {}
killedBy: bumpAccess increments accessCount and updates lastAccessed in place
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/state.ts:80:3
 // reconcile) still call scheduleSave, which sets the dirtyTokens flag and
 // schedules the rebuild.
 export function bumpAccess(meta: Index[string]): void {
-  meta.accessCount++;
+  meta.accessCount--;
   meta.lastAccessed = new Date().toISOString();
   scheduleAccessSave();
killedBy: bumpAccess increments accessCount and updates lastAccessed in place
statusReason: expected -1 to be 1 // Object.is equality
