[Survived] MethodExpression
src/journal.ts:9:17
 // ─── Journal append ──────────────────────────────────────────────────────────
 
 export function appendJournal(action: string, key: string, title: string) {
-  const today = new Date().toISOString().slice(0, 10);
+  const today = new Date().toISOString();
   const journalPath = path.join(PERSONAL_VAULT, 'journal', `${today}.md`);
   ensureDir(path.dirname(journalPath));

[Survived] BlockStatement
src/journal.ts:21:7
   // effect that must never throw into a store_memory call. ENOENT (first append of
   // the day) is let through by assertRegularFile, so the happy create-then-append
   // path is unchanged. Mirrors store.ts / mutate.ts.
-  try {
-    assertRegularFile(journalPath, key);
-  } catch {
+  try {} catch {
     return;
   }

[NoCoverage] BlockStatement
src/journal.ts:23:11
   // path is unchanged. Mirrors store.ts / mutate.ts.
   try {
     assertRegularFile(journalPath, key);
-  } catch {
-    return;
-  }
+  } catch {}
   const entry = `\n- ${new Date().toISOString()} [${action}] **${title}** (\`${key}\`)\n`;
   // The journal append is the LAST step of store_memory, AFTER the .md file

[Survived] StringLiteral
src/journal.ts:26:17
   } catch {
     return;
   }
-  const entry = `\n- ${new Date().toISOString()} [${action}] **${title}** (\`${key}\`)\n`;
+  const entry = ``;
   // The journal append is the LAST step of store_memory, AFTER the .md file
   // write, memIndex update, and scheduleSave() have already succeeded — so the

[Killed] BlockStatement
src/journal.ts:38:7
   // The header invariant ("must never throw into a store_memory call") holds
   // only if this append is guarded too. Swallow; the memory itself is safe and
   // a missed journal line is cosmetic. Mirrors the assertRegularFile guard.
-  try {
-    fs.appendFileSync(journalPath, entry);
-  } catch {
+  try {} catch {
     /* best-effort journal; must never throw into store_memory (would surface as isError and trigger a duplicate-key retry) */
   }
killedBy: appendJournal does not throw when fs.appendFileSync fails (best-effort journal)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
