[Killed] BooleanLiteral
src/vectorStore.ts:34:24
 // path) and retry the import once. Latched per-process so a persistent failure
 // (no build tools, offline) blocks for one timeout, not on every recall.
 // sqlite-vec is pure JS (no native binding), so only better-sqlite3 needs this.
-let rebuildAttempted = false;
+let rebuildAttempted = true;
 
 type RebuildResult = { attempted: boolean; ok: boolean; detail?: string };
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[NoCoverage] BlockStatement
src/vectorStore.ts:43:48
 // tsx/dev it is the source file (src/vectorStore.ts). In both cases the parent
 // of its directory is the plugin root. Returns null when better-sqlite3 isn't
 // installed under that root (optional-dep-absent → nothing to rebuild).
-function pluginRootForRebuild(): string | null {
-  try {
-    const here = path.dirname(fileURLToPath(import.meta.url));
-    const root = path.resolve(here, '..');
-    return existsSync(path.join(root, 'node_modules', 'better-sqlite3')) ? root : null;
-  } catch {
-    return null;
-  }
-}
+function pluginRootForRebuild(): string | null {}
 
 // Locate npm's CLI entry without relying on PATH. nvm / standard Node installs

[NoCoverage] BlockStatement
src/vectorStore.ts:44:7
 // of its directory is the plugin root. Returns null when better-sqlite3 isn't
 // installed under that root (optional-dep-absent → nothing to rebuild).
 function pluginRootForRebuild(): string | null {
-  try {
-    const here = path.dirname(fileURLToPath(import.meta.url));
-    const root = path.resolve(here, '..');
-    return existsSync(path.join(root, 'node_modules', 'better-sqlite3')) ? root : null;
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] BlockStatement
src/vectorStore.ts:48:11
     const here = path.dirname(fileURLToPath(import.meta.url));
     const root = path.resolve(here, '..');
     return existsSync(path.join(root, 'node_modules', 'better-sqlite3')) ? root : null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/vectorStore.ts:57:41
 // place it at <nodeDir>/../lib/node_modules/npm/bin/npm-cli.js. Spawning
 // `process.execPath <npm-cli.js> rebuild ...` avoids the shell and the `npm`
 // bin shim, so it works even when the MCP process inherited a stripped PATH.
-function resolveNpmCli(): string | null {
-  const nodeDir = path.dirname(process.execPath);
-  const candidates = [
-    path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-    path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-  ];
-  for (const c of candidates) if (existsSync(c)) return c;
-  return null;
-}
+function resolveNpmCli(): string | null {}
 
 async function rebuildNativeBindings(): Promise<RebuildResult> {

[NoCoverage] ArrayDeclaration
src/vectorStore.ts:59:22
 // bin shim, so it works even when the MCP process inherited a stripped PATH.
 function resolveNpmCli(): string | null {
   const nodeDir = path.dirname(process.execPath);
-  const candidates = [
-    path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-    path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-  ];
+  const candidates = [];
   for (const c of candidates) if (existsSync(c)) return c;
   return null;

[NoCoverage] StringLiteral
src/vectorStore.ts:60:24
 function resolveNpmCli(): string | null {
   const nodeDir = path.dirname(process.execPath);
   const candidates = [
-    path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
+    path.join(nodeDir, "", 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
     path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
   ];

[NoCoverage] StringLiteral
src/vectorStore.ts:61:24
   const nodeDir = path.dirname(process.execPath);
   const candidates = [
     path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-    path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
+    path.join(nodeDir, "", 'npm', 'bin', 'npm-cli.js'),
   ];
   for (const c of candidates) if (existsSync(c)) return c;

[NoCoverage] StringLiteral
src/vectorStore.ts:61:54
   const nodeDir = path.dirname(process.execPath);
   const candidates = [
     path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
-    path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
+    path.join(nodeDir, 'node_modules', 'npm', 'bin', ""),
   ];
   for (const c of candidates) if (existsSync(c)) return c;

[NoCoverage] ConditionalExpression
src/vectorStore.ts:63:35
     path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
     path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
   ];
-  for (const c of candidates) if (existsSync(c)) return c;
+  for (const c of candidates) if (true) return c;
   return null;
 }

[NoCoverage] ConditionalExpression
src/vectorStore.ts:63:35
     path.join(nodeDir, '..', 'lib', 'node_modules', 'npm', 'bin', 'npm-cli.js'),
     path.join(nodeDir, 'node_modules', 'npm', 'bin', 'npm-cli.js'),
   ];
-  for (const c of candidates) if (existsSync(c)) return c;
+  for (const c of candidates) if (false) return c;
   return null;
 }

[NoCoverage] BooleanLiteral
src/vectorStore.ts:69:7
 
 async function rebuildNativeBindings(): Promise<RebuildResult> {
   const root = pluginRootForRebuild();
-  if (!root) return { attempted: false, ok: false }; // nothing to rebuild
+  if (root) return { attempted: false, ok: false }; // nothing to rebuild
   const npmCli = resolveNpmCli();
   const tail = (s: string | Buffer | undefined) =>

[NoCoverage] BooleanLiteral
src/vectorStore.ts:69:34
 
 async function rebuildNativeBindings(): Promise<RebuildResult> {
   const root = pluginRootForRebuild();
-  if (!root) return { attempted: false, ok: false }; // nothing to rebuild
+  if (!root) return { attempted: true, ok: false }; // nothing to rebuild
   const npmCli = resolveNpmCli();
   const tail = (s: string | Buffer | undefined) =>

[NoCoverage] ArrowFunction
src/vectorStore.ts:71:16
   const root = pluginRootForRebuild();
   if (!root) return { attempted: false, ok: false }; // nothing to rebuild
   const npmCli = resolveNpmCli();
-  const tail = (s: string | Buffer | undefined) =>
-    typeof s === 'string' ? s.slice(-500) : '';
+  const tail = () => undefined;
   try {
     const result = npmCli

[NoCoverage] ConditionalExpression
src/vectorStore.ts:72:5
   if (!root) return { attempted: false, ok: false }; // nothing to rebuild
   const npmCli = resolveNpmCli();
   const tail = (s: string | Buffer | undefined) =>
-    typeof s === 'string' ? s.slice(-500) : '';
+    false ? s.slice(-500) : '';
   try {
     const result = npmCli

[NoCoverage] EqualityOperator
src/vectorStore.ts:72:5
   if (!root) return { attempted: false, ok: false }; // nothing to rebuild
   const npmCli = resolveNpmCli();
   const tail = (s: string | Buffer | undefined) =>
-    typeof s === 'string' ? s.slice(-500) : '';
+    typeof s !== 'string' ? s.slice(-500) : '';
   try {
     const result = npmCli

[NoCoverage] BlockStatement
src/vectorStore.ts:73:7
   const npmCli = resolveNpmCli();
   const tail = (s: string | Buffer | undefined) =>
     typeof s === 'string' ? s.slice(-500) : '';
-  try {
-    const result = npmCli
-      ? spawnSync(process.execPath, [npmCli, 'rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
-        })
-      : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
-        });
-    if (result.error || result.status !== 0) {
-      return {
-        attempted: true,
-        ok: false,
-        detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
-      };
-    }
-    return { attempted: true, ok: true };
-  } catch (e: any) {
+  try {} catch (e: any) {
     return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };
   }

[NoCoverage] StringLiteral
src/vectorStore.ts:76:32
   try {
     const result = npmCli
       ? spawnSync(process.execPath, [npmCli, 'rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
+          cwd: root, encoding: "", timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
         })
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {

[NoCoverage] StringLiteral
src/vectorStore.ts:76:75
   try {
     const result = npmCli
       ? spawnSync(process.execPath, [npmCli, 'rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
+          cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', "", 'pipe'],
         })
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {

[NoCoverage] StringLiteral
src/vectorStore.ts:78:38
       ? spawnSync(process.execPath, [npmCli, 'rebuild', 'better-sqlite3'], {
           cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
         })
-      : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
+      : spawnSync('npm', ['rebuild', ""], {
           cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });

[NoCoverage] StringLiteral
src/vectorStore.ts:78:19
       ? spawnSync(process.execPath, [npmCli, 'rebuild', 'better-sqlite3'], {
           cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
         })
-      : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
+      : spawnSync("", ['rebuild', 'better-sqlite3'], {
           cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });

[NoCoverage] BooleanLiteral
src/vectorStore.ts:79:64
           cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
         })
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
+          cwd: root, encoding: 'utf8', timeout: 180000, shell: false, stdio: ['ignore', 'pipe', 'pipe'],
         });
     if (result.error || result.status !== 0) {

[NoCoverage] StringLiteral
src/vectorStore.ts:79:32
           cwd: root, encoding: 'utf8', timeout: 180000, stdio: ['ignore', 'pipe', 'pipe'],
         })
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
-          cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
+          cwd: root, encoding: "", timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });
     if (result.error || result.status !== 0) {

[NoCoverage] ConditionalExpression
src/vectorStore.ts:81:9
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
           cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });
-    if (result.error || result.status !== 0) {
+    if (false) {
       return {
         attempted: true,

[NoCoverage] ConditionalExpression
src/vectorStore.ts:81:9
       : spawnSync('npm', ['rebuild', 'better-sqlite3'], {
           cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });
-    if (result.error || result.status !== 0) {
+    if (true) {
       return {
         attempted: true,

[NoCoverage] ObjectLiteral
src/vectorStore.ts:82:14
           cwd: root, encoding: 'utf8', timeout: 180000, shell: true, stdio: ['ignore', 'pipe', 'pipe'],
         });
     if (result.error || result.status !== 0) {
-      return {
-        attempted: true,
-        ok: false,
-        detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
-      };
+      return {};
     }
     return { attempted: true, ok: true };

[NoCoverage] BooleanLiteral
src/vectorStore.ts:83:20
         });
     if (result.error || result.status !== 0) {
       return {
-        attempted: true,
+        attempted: false,
         ok: false,
         detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),

[NoCoverage] BooleanLiteral
src/vectorStore.ts:84:13
     if (result.error || result.status !== 0) {
       return {
         attempted: true,
-        ok: false,
+        ok: true,
         detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
       };

[NoCoverage] MethodExpression
src/vectorStore.ts:85:17
       return {
         attempted: true,
         ok: false,
-        detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
+        detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`,
       };
     }

[NoCoverage] LogicalOperator
src/vectorStore.ts:85:25
       return {
         attempted: true,
         ok: false,
-        detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
+        detail: `exit ${result.status && 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
       };
     }

[NoCoverage] BooleanLiteral
src/vectorStore.ts:88:35
         detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
       };
     }
-    return { attempted: true, ok: true };
+    return { attempted: true, ok: false };
   } catch (e: any) {
     return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };

[NoCoverage] BooleanLiteral
src/vectorStore.ts:88:25
         detail: `exit ${result.status ?? 'n/a'}: ${result.error ? result.error.message : tail(result.stderr)}`.trim(),
       };
     }
-    return { attempted: true, ok: true };
+    return { attempted: false, ok: true };
   } catch (e: any) {
     return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };

[NoCoverage] BlockStatement
src/vectorStore.ts:89:20
       };
     }
     return { attempted: true, ok: true };
-  } catch (e: any) {
-    return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };
-  }
+  } catch (e: any) {}
 }
 

[NoCoverage] LogicalOperator
src/vectorStore.ts:90:60
     }
     return { attempted: true, ok: true };
   } catch (e: any) {
-    return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };
+    return { attempted: true, ok: false, detail: `threw: ${e?.message && String(e)}` };
   }
 }

[NoCoverage] OptionalChaining
src/vectorStore.ts:90:60
     }
     return { attempted: true, ok: true };
   } catch (e: any) {
-    return { attempted: true, ok: false, detail: `threw: ${e?.message ?? String(e)}` };
+    return { attempted: true, ok: false, detail: `threw: ${e.message ?? String(e)}` };
   }
 }

[Killed] BlockStatement
src/vectorStore.ts:97:63
 // Test seam (mirrors __testsSetEmbedder in embeddings.ts). The default impl is
 // a no-op under NODE_ENV=test so existing degrade tests stay silent (no spawn,
 // no recordError); self-heal tests inject a fake to exercise the retry/latch.
-let __rebuildImpl: () => Promise<RebuildResult> = async () => {
-  if (process.env.NODE_ENV === 'test') return { attempted: false, ok: false };
-  return rebuildNativeBindings();
-};
+let __rebuildImpl: () => Promise<RebuildResult> = async () => {};
 export function __testsSetRebuildImpl(fn: () => Promise<RebuildResult>): void {
   if (process.env.NODE_ENV === 'test') __rebuildImpl = fn;
killedBy: vectorStore — graceful degradation upsertVector resolves without throwing
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BooleanLiteral
src/vectorStore.ts:98:60
 // a no-op under NODE_ENV=test so existing degrade tests stay silent (no spawn,
 // no recordError); self-heal tests inject a fake to exercise the retry/latch.
 let __rebuildImpl: () => Promise<RebuildResult> = async () => {
-  if (process.env.NODE_ENV === 'test') return { attempted: false, ok: false };
+  if (process.env.NODE_ENV === 'test') return { attempted: true, ok: false };
   return rebuildNativeBindings();
 };
killedBy: vectorStore — native-binding self-heal degrades silently when no rebuild is attempted (optional-dep-absent / test default)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:98:7
 // a no-op under NODE_ENV=test so existing degrade tests stay silent (no spawn,
 // no recordError); self-heal tests inject a fake to exercise the retry/latch.
 let __rebuildImpl: () => Promise<RebuildResult> = async () => {
-  if (process.env.NODE_ENV === 'test') return { attempted: false, ok: false };
+  if (false) return { attempted: false, ok: false };
   return rebuildNativeBindings();
 };
killedBy: vectorStore — native-binding self-heal degrades silently when no rebuild is attempted (optional-dep-absent / test default)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/vectorStore.ts:101:79
   if (process.env.NODE_ENV === 'test') return { attempted: false, ok: false };
   return rebuildNativeBindings();
 };
-export function __testsSetRebuildImpl(fn: () => Promise<RebuildResult>): void {
-  if (process.env.NODE_ENV === 'test') __rebuildImpl = fn;
-}
+export function __testsSetRebuildImpl(fn: () => Promise<RebuildResult>): void {}
 // Test-only handle to drive getDb directly without going through upsert/search.
 export async function __testsGetDb(dbPath: string): Promise<any> {
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/vectorStore.ts:102:7
   return rebuildNativeBindings();
 };
 export function __testsSetRebuildImpl(fn: () => Promise<RebuildResult>): void {
-  if (process.env.NODE_ENV === 'test') __rebuildImpl = fn;
+  if (process.env.NODE_ENV !== 'test') __rebuildImpl = fn;
 }
 // Test-only handle to drive getDb directly without going through upsert/search.
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:102:7
   return rebuildNativeBindings();
 };
 export function __testsSetRebuildImpl(fn: () => Promise<RebuildResult>): void {
-  if (process.env.NODE_ENV === 'test') __rebuildImpl = fn;
+  if (false) __rebuildImpl = fn;
 }
 // Test-only handle to drive getDb directly without going through upsert/search.
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/vectorStore.ts:105:66
   if (process.env.NODE_ENV === 'test') __rebuildImpl = fn;
 }
 // Test-only handle to drive getDb directly without going through upsert/search.
-export async function __testsGetDb(dbPath: string): Promise<any> {
-  return getDb(dbPath);
-}
+export async function __testsGetDb(dbPath: string): Promise<any> {}
 
 async function getDb(dbPath: string): Promise<any> {
killedBy: vectorStore — native-binding self-heal retries the load after a successful rebuild and returns a db
statusReason: expected undefined to be truthy

[Killed] LogicalOperator
src/vectorStore.ts:110:7
 }
 
 async function getDb(dbPath: string): Promise<any> {
-  if (cachedDbPath !== null && cachedDbPath !== dbPath) {
+  if (cachedDbPath !== null || cachedDbPath !== dbPath) {
     throw new Error(`vectorStore already initialized with ${cachedDbPath}, cannot switch to ${dbPath}`);
   }
killedBy: vectorStore — native-binding self-heal retries the load after a successful rebuild and returns a db
statusReason: vectorStore already initialized with null, cannot switch to /home/adrianb/.cache/podman-tmp/tr-vec-selfheal-151063.db

[Killed] EqualityOperator
src/vectorStore.ts:110:7
 }
 
 async function getDb(dbPath: string): Promise<any> {
-  if (cachedDbPath !== null && cachedDbPath !== dbPath) {
+  if (cachedDbPath === null && cachedDbPath !== dbPath) {
     throw new Error(`vectorStore already initialized with ${cachedDbPath}, cannot switch to ${dbPath}`);
   }
killedBy: vectorStore — native-binding self-heal retries the load after a successful rebuild and returns a db
statusReason: vectorStore already initialized with null, cannot switch to /home/adrianb/.cache/podman-tmp/tr-vec-selfheal-151063.db

[Killed] ConditionalExpression
src/vectorStore.ts:117:7
   // boolean synchronously before the dynamic import resolved, so a concurrent upsert
   // arriving mid-import saw a transient null db and silently dropped its write.
   // Awaiting one shared promise means every concurrent caller gets the same outcome.
-  if (dbPromise) return dbPromise;
+  if (true) return dbPromise;
   cachedDbPath = dbPath;
   dbPromise = (async () => {
killedBy: vectorStore — dbPath mismatch throws when called with a different dbPath after initialisation
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ConditionalExpression
src/vectorStore.ts:117:7
   // boolean synchronously before the dynamic import resolved, so a concurrent upsert
   // arriving mid-import saw a transient null db and silently dropped its write.
   // Awaiting one shared promise means every concurrent caller gets the same outcome.
-  if (dbPromise) return dbPromise;
+  if (false) return dbPromise;
   cachedDbPath = dbPath;
   dbPromise = (async () => {

[Killed] BlockStatement
src/vectorStore.ts:120:9
   if (dbPromise) return dbPromise;
   cachedDbPath = dbPath;
   dbPromise = (async () => {
-    try {
-      const sqliteVec = await import('sqlite-vec');
-      const Database = (await import('better-sqlite3')).default;
-      const d = new Database(dbPath);
-      sqliteVec.load(d);
-      return d;
-    } catch (loadErr: any) {
+    try {} catch (loadErr: any) {
       // Self-heal: a fresh plugin-cache dir (from `claude plugin update`) can
       // ship better-sqlite3 source-only — its install script didn't produce
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/vectorStore.ts:142:11
       // load RETRY below is the ground truth — never claim success from npm's
       // exit code alone. When the retry still fails, record an honest, actionable
       // error (not "succeeded") so the user knows to run the rebuild manually.
-      if (!rebuildAttempted) {
+      if (rebuildAttempted) {
         rebuildAttempted = true;
         const r = await __rebuildImpl();
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:142:11
       // load RETRY below is the ground truth — never claim success from npm's
       // exit code alone. When the retry still fails, record an honest, actionable
       // error (not "succeeded") so the user knows to run the rebuild manually.
-      if (!rebuildAttempted) {
+      if (false) {
         rebuildAttempted = true;
         const r = await __rebuildImpl();
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/vectorStore.ts:143:28
       // exit code alone. When the retry still fails, record an honest, actionable
       // error (not "succeeded") so the user knows to run the rebuild manually.
       if (!rebuildAttempted) {
-        rebuildAttempted = true;
+        rebuildAttempted = false;
         const r = await __rebuildImpl();
         if (r.attempted) {
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/vectorStore.ts:145:26
       if (!rebuildAttempted) {
         rebuildAttempted = true;
         const r = await __rebuildImpl();
-        if (r.attempted) {
-          try {
-            const sqliteVec = await import('sqlite-vec');
-            const Database = (await import('better-sqlite3')).default;
-            const d = new Database(dbPath);
-            sqliteVec.load(d);
-            return d;
-          } catch (retryErr: any) {
-            const outcome = r.ok
-              ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
-                `(prebuild-install likely failed to download — offline or no matching prebuild ` +
-                `for this Node ABI — and node-gyp is not installed to compile from source)`
-              : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
-            recordError(
-              `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
-              `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
-              `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
-              `in the plugin dir to restore vector search. TF-IDF search still works.`
-            );
-          }
-        }
+        if (r.attempted) {}
         // r.attempted === false (test default, or no node_modules/better-sqlite3
         // found): silent degrade — preserves the pre-self-heal optional-dep-absent
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/vectorStore.ts:145:13
       if (!rebuildAttempted) {
         rebuildAttempted = true;
         const r = await __rebuildImpl();
-        if (r.attempted) {
+        if (false) {
           try {
             const sqliteVec = await import('sqlite-vec');
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vectorStore.ts:146:15
         rebuildAttempted = true;
         const r = await __rebuildImpl();
         if (r.attempted) {
-          try {
-            const sqliteVec = await import('sqlite-vec');
-            const Database = (await import('better-sqlite3')).default;
-            const d = new Database(dbPath);
-            sqliteVec.load(d);
-            return d;
-          } catch (retryErr: any) {
+          try {} catch (retryErr: any) {
             const outcome = r.ok
               ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vectorStore.ts:152:35
             const d = new Database(dbPath);
             sqliteVec.load(d);
             return d;
-          } catch (retryErr: any) {
-            const outcome = r.ok
-              ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
-                `(prebuild-install likely failed to download — offline or no matching prebuild ` +
-                `for this Node ABI — and node-gyp is not installed to compile from source)`
-              : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
-            recordError(
-              `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
-              `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
-              `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
-              `in the plugin dir to restore vector search. TF-IDF search still works.`
-            );
-          }
+          } catch (retryErr: any) {}
         }
         // r.attempted === false (test default, or no node_modules/better-sqlite3
killedBy: vectorStore — native-binding self-heal latch attempts the rebuild exactly once across repeated getDb calls (latch), then degrades
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/vectorStore.ts:154:17
             return d;
           } catch (retryErr: any) {
             const outcome = r.ok
-              ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
+              ? `` +
                 `(prebuild-install likely failed to download — offline or no matching prebuild ` +
                 `for this Node ABI — and node-gyp is not installed to compile from source)`
killedBy: vectorStore — native-binding self-heal latch records the "npm reported success but binding still absent" outcome when ok=true yet load still fails
statusReason: expected 'vectorStore: better-sqlite3 native bi…' to match /npm rebuild reported success .* bindi…/
