[Killed] BlockStatement
src/lru-cache.ts:9:30
   private misses = 0;
   constructor(private maxSize: number, private ttlMs: number) {}
 
-  get(key: K): V | undefined {
-    const entry = this.map.get(key);
-    if (!entry || Date.now() > entry.expiry) {
-      this.misses++;
-      this.map.delete(key);
-      return undefined;
-    }
-    this.hits++;
-    this.map.delete(key);
-    this.map.set(key, entry);
-    return entry.value;
-  }
+  get(key: K): V | undefined {}
 
   set(key: K, value: V) {
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected undefined to be '\nhello\n' // Object.is equality

[Killed] LogicalOperator
src/lru-cache.ts:11:9
 
   get(key: K): V | undefined {
     const entry = this.map.get(key);
-    if (!entry || Date.now() > entry.expiry) {
+    if (!entry && Date.now() > entry.expiry) {
       this.misses++;
       this.map.delete(key);
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: Cannot read properties of undefined (reading 'expiry')

[Killed] BooleanLiteral
src/lru-cache.ts:11:9
 
   get(key: K): V | undefined {
     const entry = this.map.get(key);
-    if (!entry || Date.now() > entry.expiry) {
+    if (entry || Date.now() > entry.expiry) {
       this.misses++;
       this.map.delete(key);
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: Cannot read properties of undefined (reading 'expiry')

[Survived] UpdateOperator
src/lru-cache.ts:12:7
   get(key: K): V | undefined {
     const entry = this.map.get(key);
     if (!entry || Date.now() > entry.expiry) {
-      this.misses++;
+      this.misses--;
       this.map.delete(key);
       return undefined;

[Survived] UpdateOperator
src/lru-cache.ts:16:5
       this.map.delete(key);
       return undefined;
     }
-    this.hits++;
+    this.hits--;
     this.map.delete(key);
     this.map.set(key, entry);

[Killed] BlockStatement
src/lru-cache.ts:22:25
     return entry.value;
   }
 
-  set(key: K, value: V) {
-    // If the key already exists, refresh it in place (delete then re-insert at
-    // MRU) rather than evicting the LRU entry first — otherwise updating an
-    // existing key would evict an innocent entry AND fail to move the updated key
-    // to the most-recently-used position. Map insertion order === LRU order, so
-    // delete-then-set puts the key at the end (MRU).
-    if (this.map.has(key)) {
-      this.map.delete(key);
-    } else if (this.map.size >= this.maxSize) {
-      this.map.delete(this.map.keys().next().value!);
-    }
-    this.map.set(key, { value, expiry: Date.now() + this.ttlMs });
-  }
+  set(key: K, value: V) {}
 
   delete(key: K) { this.map.delete(key); }
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected undefined to be '\nhello\n' // Object.is equality

[Survived] BlockStatement
src/lru-cache.ts:28:28
     // existing key would evict an innocent entry AND fail to move the updated key
     // to the most-recently-used position. Map insertion order === LRU order, so
     // delete-then-set puts the key at the end (MRU).
-    if (this.map.has(key)) {
-      this.map.delete(key);
-    } else if (this.map.size >= this.maxSize) {
+    if (this.map.has(key)) {} else if (this.map.size >= this.maxSize) {
       this.map.delete(this.map.keys().next().value!);
     }

[Survived] ConditionalExpression
src/lru-cache.ts:28:9
     // existing key would evict an innocent entry AND fail to move the updated key
     // to the most-recently-used position. Map insertion order === LRU order, so
     // delete-then-set puts the key at the end (MRU).
-    if (this.map.has(key)) {
+    if (false) {
       this.map.delete(key);
     } else if (this.map.size >= this.maxSize) {

[Survived] ConditionalExpression
src/lru-cache.ts:30:16
     // delete-then-set puts the key at the end (MRU).
     if (this.map.has(key)) {
       this.map.delete(key);
-    } else if (this.map.size >= this.maxSize) {
+    } else if (true) {
       this.map.delete(this.map.keys().next().value!);
     }

[Survived] EqualityOperator
src/lru-cache.ts:30:16
     // delete-then-set puts the key at the end (MRU).
     if (this.map.has(key)) {
       this.map.delete(key);
-    } else if (this.map.size >= this.maxSize) {
+    } else if (this.map.size < this.maxSize) {
       this.map.delete(this.map.keys().next().value!);
     }

[Killed] ArithmeticOperator
src/lru-cache.ts:33:40
     } else if (this.map.size >= this.maxSize) {
       this.map.delete(this.map.keys().next().value!);
     }
-    this.map.set(key, { value, expiry: Date.now() + this.ttlMs });
+    this.map.set(key, { value, expiry: Date.now() - this.ttlMs });
   }
 
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected undefined to be '\nhello\n' // Object.is equality

[Killed] ObjectLiteral
src/lru-cache.ts:33:23
     } else if (this.map.size >= this.maxSize) {
       this.map.delete(this.map.keys().next().value!);
     }
-    this.map.set(key, { value, expiry: Date.now() + this.ttlMs });
+    this.map.set(key, {});
   }
 
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected undefined to be '\nhello\n' // Object.is equality

[Killed] BlockStatement
src/lru-cache.ts:36:18
     this.map.set(key, { value, expiry: Date.now() + this.ttlMs });
   }
 
-  delete(key: K) { this.map.delete(key); }
+  delete(key: K) {}
   stats() { return { hits: this.hits, misses: this.misses, size: this.map.size }; }
 }
killedBy: reconcileIndex — boot walk drops a memIndex entry whose file no longer exists and purges its cache
statusReason: expected 'gone body' to be undefined

[NoCoverage] BlockStatement
src/lru-cache.ts:37:11
   }
 
   delete(key: K) { this.map.delete(key); }
-  stats() { return { hits: this.hits, misses: this.misses, size: this.map.size }; }
+  stats() {}
 }
 

[NoCoverage] ObjectLiteral
src/lru-cache.ts:37:20
   }
 
   delete(key: K) { this.map.delete(key); }
-  stats() { return { hits: this.hits, misses: this.misses, size: this.map.size }; }
+  stats() { return {}; }
 }
 

[Killed] ArithmeticOperator
src/lru-cache.ts:40:63
   stats() { return { hits: this.hits, misses: this.misses, size: this.map.size }; }
 }
 
-export const contentCache = new LRUCache<string, string>(100, 30 * 60 * 1000);
+export const contentCache = new LRUCache<string, string>(100, 30 / 60 * 1000);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ArithmeticOperator
src/lru-cache.ts:40:63
   stats() { return { hits: this.hits, misses: this.misses, size: this.map.size }; }
 }
 
-export const contentCache = new LRUCache<string, string>(100, 30 * 60 * 1000);
+export const contentCache = new LRUCache<string, string>(100, 30 * 60 / 1000);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key
