[Killed] UnaryOperator
src/paths.ts:35:19
 // same-mtime window (index.test.ts writes/removes config.json once per setup,
 // each advancing mtime), so the cache is test-safe.
 let cachedConfig: TotalRecallConfig | null = null;
-let cachedMtime = -1;
+let cachedMtime = +1;
 
 export function loadConfig(): TotalRecallConfig {
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/paths.ts:37:49
 let cachedConfig: TotalRecallConfig | null = null;
 let cachedMtime = -1;
 
-export function loadConfig(): TotalRecallConfig {
-  let mtime: number;
-  try {
-    mtime = fs.statSync(CONFIG_PATH).mtimeMs;
-  } catch {
-    cachedConfig = null;
-    cachedMtime = -1;
-    return {};
-  }
-  if (cachedConfig !== null && mtime === cachedMtime) return cachedConfig;
-  try {
-    const parsed = JSON.parse(fs.readFileSync(CONFIG_PATH, 'utf8'));
-    cachedConfig = parsed;
-    cachedMtime = mtime;
-    return parsed;
-  } catch {
-    cachedConfig = null;
-    cachedMtime = -1;
-    return {};
-  }
-}
+export function loadConfig(): TotalRecallConfig {}
 
 const config = loadConfig();
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: Cannot read properties of undefined (reading 'personalVault')

[Killed] BlockStatement
src/paths.ts:39:7
 
 export function loadConfig(): TotalRecallConfig {
   let mtime: number;
-  try {
-    mtime = fs.statSync(CONFIG_PATH).mtimeMs;
-  } catch {
+  try {} catch {
     cachedConfig = null;
     cachedMtime = -1;
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/paths.ts:41:11
   let mtime: number;
   try {
     mtime = fs.statSync(CONFIG_PATH).mtimeMs;
-  } catch {
-    cachedConfig = null;
-    cachedMtime = -1;
-    return {};
-  }
+  } catch {}
   if (cachedConfig !== null && mtime === cachedMtime) return cachedConfig;
   try {
killedBy: loadConfig mtime cache returns {} and skips readFileSync when statSync throws (no config / cold start)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/home/adrianb/.total-recall/config.json",

[Survived] UnaryOperator
src/paths.ts:43:19
     mtime = fs.statSync(CONFIG_PATH).mtimeMs;
   } catch {
     cachedConfig = null;
-    cachedMtime = -1;
+    cachedMtime = +1;
     return {};
   }

[Killed] EqualityOperator
src/paths.ts:46:32
     cachedMtime = -1;
     return {};
   }
-  if (cachedConfig !== null && mtime === cachedMtime) return cachedConfig;
+  if (cachedConfig !== null && mtime !== cachedMtime) return cachedConfig;
   try {
     const parsed = JSON.parse(fs.readFileSync(CONFIG_PATH, 'utf8'));
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/paths.ts:46:7
     cachedMtime = -1;
     return {};
   }
-  if (cachedConfig !== null && mtime === cachedMtime) return cachedConfig;
+  if (false) return cachedConfig;
   try {
     const parsed = JSON.parse(fs.readFileSync(CONFIG_PATH, 'utf8'));
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/paths.ts:47:7
     return {};
   }
   if (cachedConfig !== null && mtime === cachedMtime) return cachedConfig;
-  try {
-    const parsed = JSON.parse(fs.readFileSync(CONFIG_PATH, 'utf8'));
-    cachedConfig = parsed;
-    cachedMtime = mtime;
-    return parsed;
-  } catch {
+  try {} catch {
     cachedConfig = null;
     cachedMtime = -1;
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: Cannot read properties of undefined (reading 'personalVault')

[Killed] BlockStatement
src/paths.ts:52:11
     cachedConfig = parsed;
     cachedMtime = mtime;
     return parsed;
-  } catch {
-    cachedConfig = null;
-    cachedMtime = -1;
-    return {};
-  }
+  } catch {}
 }
 
killedBy: loadConfig mtime cache resets the cache on a parse error so a later valid read re-populates
statusReason: expected undefined to deeply equal {}

[NoCoverage] Regex
src/paths.ts:62:47
 const config = loadConfig();
 
 export const PERSONAL_VAULT = config.personalVault 
-  ? path.resolve(config.personalVault.replace(/^~(?=\/|$)/, HOME))
+  ? path.resolve(config.personalVault.replace(/^~(?!\/|$)/, HOME))
   : path.join(TOTAL_RECALL_DIR, 'personal-vault');
 

[NoCoverage] Regex
src/paths.ts:62:47
 const config = loadConfig();
 
 export const PERSONAL_VAULT = config.personalVault 
-  ? path.resolve(config.personalVault.replace(/^~(?=\/|$)/, HOME))
+  ? path.resolve(config.personalVault.replace(/^~(?=\/)/, HOME))
   : path.join(TOTAL_RECALL_DIR, 'personal-vault');
 

[NoCoverage] Regex
src/paths.ts:66:42
   : path.join(TOTAL_RECALL_DIR, 'personal-vault');
 
 export const ORG_VAULT = config.orgVault
-  ? path.resolve(config.orgVault.replace(/^~(?=\/|$)/, HOME))
+  ? path.resolve(config.orgVault.replace(/^~(?=\/)/, HOME))
   : path.join(TOTAL_RECALL_DIR, 'org', 'org-vault');
 

[Killed] StringLiteral
src/paths.ts:67:40
 
 export const ORG_VAULT = config.orgVault
   ? path.resolve(config.orgVault.replace(/^~(?=\/|$)/, HOME))
-  : path.join(TOTAL_RECALL_DIR, 'org', 'org-vault');
+  : path.join(TOTAL_RECALL_DIR, 'org', "");
 
 export const VECTORS_DB = path.join(PERSONAL_VAULT, 'vectors.db');
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:69:53
   ? path.resolve(config.orgVault.replace(/^~(?=\/|$)/, HOME))
   : path.join(TOTAL_RECALL_DIR, 'org', 'org-vault');
 
-export const VECTORS_DB = path.join(PERSONAL_VAULT, 'vectors.db');
+export const VECTORS_DB = path.join(PERSONAL_VAULT, "");
 export const INDEX_PATH = path.join(TOTAL_RECALL_DIR, 'index.json');
 export const INVERTED_INDEX_PATH = path.join(TOTAL_RECALL_DIR, 'invertedIndex.json');
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:70:55
   : path.join(TOTAL_RECALL_DIR, 'org', 'org-vault');
 
 export const VECTORS_DB = path.join(PERSONAL_VAULT, 'vectors.db');
-export const INDEX_PATH = path.join(TOTAL_RECALL_DIR, 'index.json');
+export const INDEX_PATH = path.join(TOTAL_RECALL_DIR, "");
 export const INVERTED_INDEX_PATH = path.join(TOTAL_RECALL_DIR, 'invertedIndex.json');
 export const INDEX_CACHE_PATH = path.join(TOTAL_RECALL_DIR, '.index-cache.txt');
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ArrayDeclaration
src/paths.ts:75:38
 export const INDEX_CACHE_PATH = path.join(TOTAL_RECALL_DIR, '.index-cache.txt');
 export const RECONCILE_REQUEST_FLAG = path.join(TOTAL_RECALL_DIR, '.reconcile-requested');
 
-export const EXCLUDED_DIRS = new Set([
-  'projects', 'templates', '.obsidian', 'reference-docs', 'in-progress', 'completed',
-  // Graphiti "supersede, don't overwrite" archive (Tech Radar vol.34 #45): on a
-  // store_memory(force=true) overwrite, the prior body is archived here. The
-  // archive is a provenance sidecar — never re-indexed — so the superseded fact
-  // stays recoverable ("what did I believe and when") without polluting search.
-  '.superseded',
-]);
+export const EXCLUDED_DIRS = new Set([]);
 
 // 7.1 (REVIEW 7.3): redact absolute vault/HOME paths from strings surfaced to MCP
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:76:74
 export const RECONCILE_REQUEST_FLAG = path.join(TOTAL_RECALL_DIR, '.reconcile-requested');
 
 export const EXCLUDED_DIRS = new Set([
-  'projects', 'templates', '.obsidian', 'reference-docs', 'in-progress', 'completed',
+  'projects', 'templates', '.obsidian', 'reference-docs', 'in-progress', "",
   // Graphiti "supersede, don't overwrite" archive (Tech Radar vol.34 #45): on a
   // store_memory(force=true) overwrite, the prior body is archived here. The
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:76:3
 export const RECONCILE_REQUEST_FLAG = path.join(TOTAL_RECALL_DIR, '.reconcile-requested');
 
 export const EXCLUDED_DIRS = new Set([
-  'projects', 'templates', '.obsidian', 'reference-docs', 'in-progress', 'completed',
+  "", 'templates', '.obsidian', 'reference-docs', 'in-progress', 'completed',
   // Graphiti "supersede, don't overwrite" archive (Tech Radar vol.34 #45): on a
   // store_memory(force=true) overwrite, the prior body is archived here. The
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ArrayDeclaration
src/paths.ts:95:47
 // missing/empty path is skipped (split on '' would shred the string). The
 // basename is used as the label so a redacted message still names which vault
 // the path was in (personal-vault vs org-vault) — useful context, not PII.
-const REDACT_PAIRS: Array<[string, string]> = [];
+const REDACT_PAIRS: Array<[string, string]> = ["Stryker was here"];
 for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
   if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/paths.ts:96:52
 // basename is used as the label so a redacted message still names which vault
 // the path was in (personal-vault vs org-vault) — useful context, not PII.
 const REDACT_PAIRS: Array<[string, string]> = [];
-for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
-  if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
-}
+for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {}
 export function redactPaths(msg: string): string {
   let out = String(msg);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ArrayDeclaration
src/paths.ts:96:17
 // basename is used as the label so a redacted message still names which vault
 // the path was in (personal-vault vs org-vault) — useful context, not PII.
 const REDACT_PAIRS: Array<[string, string]> = [];
-for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
+for (const p of []) {
   if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
 }
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/paths.ts:97:32
 // the path was in (personal-vault vs org-vault) — useful context, not PII.
 const REDACT_PAIRS: Array<[string, string]> = [];
 for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
-  if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
+  if (p) REDACT_PAIRS.push([p, false ? '~' : `<${path.basename(p)}>`]);
 }
 export function redactPaths(msg: string): string {
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/paths.ts:97:7
 // the path was in (personal-vault vs org-vault) — useful context, not PII.
 const REDACT_PAIRS: Array<[string, string]> = [];
 for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
-  if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
+  if (false) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
 }
 export function redactPaths(msg: string): string {
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/paths.ts:99:50
 for (const p of [PERSONAL_VAULT, ORG_VAULT, HOME]) {
   if (p) REDACT_PAIRS.push([p, p === HOME ? '~' : `<${path.basename(p)}>`]);
 }
-export function redactPaths(msg: string): string {
-  let out = String(msg);
-  for (const [p, label] of REDACT_PAIRS) out = out.split(p).join(label);
-  return out;
-}
+export function redactPaths(msg: string): string {}
 export const DEFAULT_CATEGORIES = [
   'architecture', 'decisions', 'troubleshooting', 'meetings', 'knowledge', 'journal',
killedBy: redactPaths (7.1) collapses a personal-vault path to the <personal-vault> label
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/paths.ts:105:63
   return out;
 }
 export const DEFAULT_CATEGORIES = [
-  'architecture', 'decisions', 'troubleshooting', 'meetings', 'knowledge', 'journal',
+  'architecture', 'decisions', 'troubleshooting', 'meetings', "", 'journal',
 ];
 
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:105:19
   return out;
 }
 export const DEFAULT_CATEGORIES = [
-  'architecture', 'decisions', 'troubleshooting', 'meetings', 'knowledge', 'journal',
+  'architecture', "", 'troubleshooting', 'meetings', 'knowledge', 'journal',
 ];
 
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/paths.ts:115:29
 // every decision is immortal — immortality is an explicit per-memory opt-in (e.g.
 // an ADR you never want pruned or removed). Single-sourced here so the two tools
 // agree on the literal string.
-export const NO_PRUNE_TAG = 'no-prune';
+export const NO_PRUNE_TAG = "";
 
 export function ensureDir(p: string) {
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Survived] BlockStatement
src/paths.ts:117:38
 // agree on the literal string.
 export const NO_PRUNE_TAG = 'no-prune';
 
-export function ensureDir(p: string) {
-  fs.mkdirSync(p, { recursive: true });
-}
+export function ensureDir(p: string) {}

[Killed] BooleanLiteral
src/paths.ts:118:32
 export const NO_PRUNE_TAG = 'no-prune';
 
 export function ensureDir(p: string) {
-  fs.mkdirSync(p, { recursive: true });
+  fs.mkdirSync(p, { recursive: false });
 }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected [Function] to not throw an error but 'Error: EEXIST: file already exists, m…' was thrown
