[Survived] LogicalOperator
src/vectorStore.ts:157:40
               ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
                 `(prebuild-install likely failed to download — offline or no matching prebuild ` +
                 `for this Node ABI — and node-gyp is not installed to compile from source)`
-              : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
+              : `npm rebuild failed (${r.detail && 'non-zero exit'})`;
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +

[Survived] StringLiteral
src/vectorStore.ts:157:52
               ? `npm rebuild reported success (exit 0) but the binding is still absent ` +
                 `(prebuild-install likely failed to download — offline or no matching prebuild ` +
                 `for this Node ABI — and node-gyp is not installed to compile from source)`
-              : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
+              : `npm rebuild failed (${r.detail ?? ""})`;
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +

[Survived] LogicalOperator
src/vectorStore.ts:160:67
               : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
-              `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
+              `not restore it (${outcome}; original load error: ${loadErr?.message && loadErr}; ` +
               `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
               `in the plugin dir to restore vector search. TF-IDF search still works.`

[Survived] OptionalChaining
src/vectorStore.ts:160:67
               : `npm rebuild failed (${r.detail ?? 'non-zero exit'})`;
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
-              `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
+              `not restore it (${outcome}; original load error: ${loadErr.message ?? loadErr}; ` +
               `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
               `in the plugin dir to restore vector search. TF-IDF search still works.`

[Survived] LogicalOperator
src/vectorStore.ts:161:36
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
               `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
-              `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
+              `retry load error: ${retryErr?.message && retryErr}). Run 'npm rebuild better-sqlite3' ` +
               `in the plugin dir to restore vector search. TF-IDF search still works.`
             );

[Survived] OptionalChaining
src/vectorStore.ts:161:36
             recordError(
               `vectorStore: better-sqlite3 native binding missing and in-process rebuild did ` +
               `not restore it (${outcome}; original load error: ${loadErr?.message ?? loadErr}; ` +
-              `retry load error: ${retryErr?.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
+              `retry load error: ${retryErr.message ?? retryErr}). Run 'npm rebuild better-sqlite3' ` +
               `in the plugin dir to restore vector search. TF-IDF search still works.`
             );

[Killed] BlockStatement
src/vectorStore.ts:180:61
   return dbPromise;
 }
 
-function parseExistingDimension(sql: string): number | null {
-  const match = sql.match(/embedding\s+FLOAT\[(\d+)\]/i);
-  return match ? parseInt(match[1] as string, 10) : null;
-}
+function parseExistingDimension(sql: string): number | null {}
 
 // sqlite-vec requires a fixed dimension declared at table creation. The table is
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: expected 1 to be 2 // Object.is equality

[Killed] Regex
src/vectorStore.ts:181:27
 }
 
 function parseExistingDimension(sql: string): number | null {
-  const match = sql.match(/embedding\s+FLOAT\[(\d+)\]/i);
+  const match = sql.match(/embedding\sFLOAT\[(\d+)\]/i);
   return match ? parseInt(match[1] as string, 10) : null;
 }
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:202:7
   const existing = d.prepare(
     "SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'"
   ).get() as { sql: string } | undefined;
-  if (existing) {
+  if (false) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:202:7
   const existing = d.prepare(
     "SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'"
   ).get() as { sql: string } | undefined;
-  if (existing) {
+  if (true) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] Regex
src/vectorStore.ts:204:23
   ).get() as { sql: string } | undefined;
   if (existing) {
     const existingDim = parseExistingDimension(existing.sql);
-    const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
+    const hasCosine = /distance_metric\S*=\s*cosine/i.test(existing.sql);
     if (existingDim === dim && hasCosine) return;
     // 3.1: the DROP here is correct (the write path is about to re-insert vectors
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:205:9
   if (existing) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim === dim && hasCosine) return;
+    if (false) return;
     // 3.1: the DROP here is correct (the write path is about to re-insert vectors
     // at the new dim), but it wipes every stored vector — record it so a user
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:205:9
   if (existing) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim === dim && hasCosine) return;
+    if (true) return;
     // 3.1: the DROP here is correct (the write path is about to re-insert vectors
     // at the new dim), but it wipes every stored vector — record it so a user
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Survived] StringLiteral
src/vectorStore.ts:212:7
     // get_stats.recentErrors instead of a silent disappearance.
     recordError(
       `vector index rebuilt: stored vec_memories dim ${existingDim} != new dim ${dim} ` +
-      `(embedding model changed?) — old table dropped; memories are re-embedded lazily on their next write/rerank, not all at once`
+      ``
     );
     d.exec("DROP TABLE vec_memories");

[Killed] StringLiteral
src/vectorStore.ts:217:5
     d.exec("DROP TABLE vec_memories");
   }
   d.exec(
-    `CREATE VIRTUAL TABLE IF NOT EXISTS vec_memories ` +
+    `` +
     `USING vec0(key TEXT PRIMARY KEY, embedding FLOAT[${dim}] distance_metric=cosine);`
   );
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/vectorStore.ts:235:50
 // A mismatch between the two is exactly the dim-correctness bug class 3.1/3.2
 // guard against; making it visible turns a silent degradation into a diagnosable
 // state.
-function writeVecMeta(d: any, dim: number): void {
-  try {
-    d.exec('CREATE TABLE IF NOT EXISTS vec_meta (key TEXT PRIMARY KEY, value TEXT)');
-    const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
-    d.prepare("INSERT OR REPLACE INTO vec_meta(key, value) VALUES ('model', ?), ('dim', ?)")
-      .run(model, String(dim));
-  } catch {
-    // best-effort fingerprint; absence is handled by getVecMeta returning null
-  }
-}
+function writeVecMeta(d: any, dim: number): void {}
 
 export async function getVecMeta(
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/vectorStore.ts:236:7
 // guard against; making it visible turns a silent degradation into a diagnosable
 // state.
 function writeVecMeta(d: any, dim: number): void {
-  try {
-    d.exec('CREATE TABLE IF NOT EXISTS vec_meta (key TEXT PRIMARY KEY, value TEXT)');
-    const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
-    d.prepare("INSERT OR REPLACE INTO vec_meta(key, value) VALUES ('model', ?), ('dim', ?)")
-      .run(model, String(dim));
-  } catch {
+  try {} catch {
     // best-effort fingerprint; absence is handled by getVecMeta returning null
   }
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:238:19
 function writeVecMeta(d: any, dim: number): void {
   try {
     d.exec('CREATE TABLE IF NOT EXISTS vec_meta (key TEXT PRIMARY KEY, value TEXT)');
-    const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
+    const model = true;
     d.prepare("INSERT OR REPLACE INTO vec_meta(key, value) VALUES ('model', ?), ('dim', ?)")
       .run(model, String(dim));
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:238:19
 function writeVecMeta(d: any, dim: number): void {
   try {
     d.exec('CREATE TABLE IF NOT EXISTS vec_meta (key TEXT PRIMARY KEY, value TEXT)');
-    const model = loadConfig().embeddingModel || 'Xenova/all-MiniLM-L6-v2';
+    const model = false;
     d.prepare("INSERT OR REPLACE INTO vec_meta(key, value) VALUES ('model', ?), ('dim', ?)")
       .run(model, String(dim));
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[NoCoverage] BlockStatement
src/vectorStore.ts:248:58
 
 export async function getVecMeta(
   dbPath: string
-): Promise<{ model: string; dim: number | null } | null> {
-  const d = await getDb(dbPath);
-  if (!d) return null;
-  try {
-    const exists = d
-      .prepare("SELECT name FROM sqlite_master WHERE type='table' AND name='vec_meta'")
-      .get();
-    if (!exists) return null;
-    const rows = d
-      .prepare("SELECT key, value FROM vec_meta WHERE key IN ('model', 'dim')")
-      .all() as Array<{ key: string; value: string }>;
-    const m: Record<string, string> = {};
-    for (const r of rows) m[r.key] = r.value;
-    return { model: m.model ?? '', dim: m.dim ? Number(m.dim) : null };
-  } catch {
-    return null;
-  }
-}
+): Promise<{ model: string; dim: number | null } | null> {}
 
 // Read-path variant: create the table if it doesn't exist yet (so the MATCH

[NoCoverage] ConditionalExpression
src/vectorStore.ts:250:7
   dbPath: string
 ): Promise<{ model: string; dim: number | null } | null> {
   const d = await getDb(dbPath);
-  if (!d) return null;
+  if (false) return null;
   try {
     const exists = d

[NoCoverage] BooleanLiteral
src/vectorStore.ts:250:7
   dbPath: string
 ): Promise<{ model: string; dim: number | null } | null> {
   const d = await getDb(dbPath);
-  if (!d) return null;
+  if (d) return null;
   try {
     const exists = d

[NoCoverage] BlockStatement
src/vectorStore.ts:251:7
 ): Promise<{ model: string; dim: number | null } | null> {
   const d = await getDb(dbPath);
   if (!d) return null;
-  try {
-    const exists = d
-      .prepare("SELECT name FROM sqlite_master WHERE type='table' AND name='vec_meta'")
-      .get();
-    if (!exists) return null;
-    const rows = d
-      .prepare("SELECT key, value FROM vec_meta WHERE key IN ('model', 'dim')")
-      .all() as Array<{ key: string; value: string }>;
-    const m: Record<string, string> = {};
-    for (const r of rows) m[r.key] = r.value;
-    return { model: m.model ?? '', dim: m.dim ? Number(m.dim) : null };
-  } catch {
+  try {} catch {
     return null;
   }

[NoCoverage] StringLiteral
src/vectorStore.ts:253:16
   if (!d) return null;
   try {
     const exists = d
-      .prepare("SELECT name FROM sqlite_master WHERE type='table' AND name='vec_meta'")
+      .prepare("")
       .get();
     if (!exists) return null;

[NoCoverage] ConditionalExpression
src/vectorStore.ts:255:9
     const exists = d
       .prepare("SELECT name FROM sqlite_master WHERE type='table' AND name='vec_meta'")
       .get();
-    if (!exists) return null;
+    if (false) return null;
     const rows = d
       .prepare("SELECT key, value FROM vec_meta WHERE key IN ('model', 'dim')")

[NoCoverage] ConditionalExpression
src/vectorStore.ts:255:9
     const exists = d
       .prepare("SELECT name FROM sqlite_master WHERE type='table' AND name='vec_meta'")
       .get();
-    if (!exists) return null;
+    if (true) return null;
     const rows = d
       .prepare("SELECT key, value FROM vec_meta WHERE key IN ('model', 'dim')")

[NoCoverage] LogicalOperator
src/vectorStore.ts:261:21
       .all() as Array<{ key: string; value: string }>;
     const m: Record<string, string> = {};
     for (const r of rows) m[r.key] = r.value;
-    return { model: m.model ?? '', dim: m.dim ? Number(m.dim) : null };
+    return { model: m.model && '', dim: m.dim ? Number(m.dim) : null };
   } catch {
     return null;

[NoCoverage] BlockStatement
src/vectorStore.ts:262:11
     const m: Record<string, string> = {};
     for (const r of rows) m[r.key] = r.value;
     return { model: m.model ?? '', dim: m.dim ? Number(m.dim) : null };
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/vectorStore.ts:271:62
 // query doesn't throw `no such table`), but NEVER drop an existing table whose
 // dim differs from the query. Returns true when the table is usable for this
 // query dim, false on a dim mismatch (caller bails to [] + recordError).
-function ensureVecTableForRead(d: any, dim: number): boolean {
-  const existing = d.prepare(
-    "SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'"
-  ).get() as { sql: string } | undefined;
-  if (existing) {
-    const existingDim = parseExistingDimension(existing.sql);
-    const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim !== null && (existingDim !== dim || !hasCosine)) return false;
-    return true;
-  }
-  d.exec(
-    `CREATE VIRTUAL TABLE IF NOT EXISTS vec_memories ` +
-    `USING vec0(key TEXT PRIMARY KEY, embedding FLOAT[${dim}] distance_metric=cosine);`
-  );
-  // 3.7: fingerprint the freshly-created table (cold read path) too, so get_stats
-  // can report the model/dim even before any upsert lands a row.
-  writeVecMeta(d, dim);
-  return true;
-}
+function ensureVecTableForRead(d: any, dim: number): boolean {}
 
 export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vectorStore.ts:275:17
   const existing = d.prepare(
     "SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'"
   ).get() as { sql: string } | undefined;
-  if (existing) {
-    const existingDim = parseExistingDimension(existing.sql);
-    const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim !== null && (existingDim !== dim || !hasCosine)) return false;
-    return true;
-  }
+  if (existing) {}
   d.exec(
     `CREATE VIRTUAL TABLE IF NOT EXISTS vec_memories ` +
killedBy: vectorStore — dynamic dimension migration searchVector does NOT drop the table on a dim mismatch — returns [] and records the error
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/vectorStore.ts:278:9
   if (existing) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim !== null && (existingDim !== dim || !hasCosine)) return false;
+    if (existingDim === null && (existingDim !== dim || !hasCosine)) return false;
     return true;
   }
killedBy: vectorStore — dynamic dimension migration searchVector does NOT drop the table on a dim mismatch — returns [] and records the error
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/vectorStore.ts:278:34
   if (existing) {
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
-    if (existingDim !== null && (existingDim !== dim || !hasCosine)) return false;
+    if (existingDim !== null && (existingDim !== dim && !hasCosine)) return false;
     return true;
   }
killedBy: vectorStore — dynamic dimension migration searchVector does NOT drop the table on a dim mismatch — returns [] and records the error
statusReason: expected 0 to be greater than 0

[NoCoverage] BooleanLiteral
src/vectorStore.ts:279:12
     const existingDim = parseExistingDimension(existing.sql);
     const hasCosine = /distance_metric\s*=\s*cosine/i.test(existing.sql);
     if (existingDim !== null && (existingDim !== dim || !hasCosine)) return false;
-    return true;
+    return false;
   }
   d.exec(

[Survived] StringLiteral
src/vectorStore.ts:283:5
   }
   d.exec(
     `CREATE VIRTUAL TABLE IF NOT EXISTS vec_memories ` +
-    `USING vec0(key TEXT PRIMARY KEY, embedding FLOAT[${dim}] distance_metric=cosine);`
+    ``
   );
   // 3.7: fingerprint the freshly-created table (cold read path) too, so get_stats

[Killed] BooleanLiteral
src/vectorStore.ts:288:10
   // 3.7: fingerprint the freshly-created table (cold read path) too, so get_stats
   // can report the model/dim even before any upsert lands a row.
   writeVecMeta(d, dim);
-  return true;
+  return false;
 }
 
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vectorStore.ts:291:101
   return true;
 }
 
-export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
-  const d = await getDb(dbPath);
-  if (!d) return;
-  if (!Array.isArray(embedding) || embedding.length === 0) return;
-  ensureVecTable(d, embedding.length);
-  d.prepare(`INSERT OR REPLACE INTO vec_memories(key, embedding) VALUES (?, ?)`).run(
-    key,
-    JSON.stringify(embedding)
-  );
-}
+export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {}
 
 export async function searchVector(
killedBy: vectorStore — getVectors batch read (real sqlite-vec) 11.3a (3.2): returns vectors when expectedDim matches the stored dim
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:293:7
 
 export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
   const d = await getDb(dbPath);
-  if (!d) return;
+  if (true) return;
   if (!Array.isArray(embedding) || embedding.length === 0) return;
   ensureVecTable(d, embedding.length);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) 11.3a (3.2): returns vectors when expectedDim matches the stored dim
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vectorStore.ts:293:7
 
 export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
   const d = await getDb(dbPath);
-  if (!d) return;
+  if (false) return;
   if (!Array.isArray(embedding) || embedding.length === 0) return;
   ensureVecTable(d, embedding.length);
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:294:7
 export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
   const d = await getDb(dbPath);
   if (!d) return;
-  if (!Array.isArray(embedding) || embedding.length === 0) return;
+  if (false) return;
   ensureVecTable(d, embedding.length);
   d.prepare(`INSERT OR REPLACE INTO vec_memories(key, embedding) VALUES (?, ?)`).run(
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] LogicalOperator
src/vectorStore.ts:294:7
 export async function upsertVector(dbPath: string, key: string, embedding: number[]): Promise<void> {
   const d = await getDb(dbPath);
   if (!d) return;
-  if (!Array.isArray(embedding) || embedding.length === 0) return;
+  if (!Array.isArray(embedding) && embedding.length === 0) return;
   ensureVecTable(d, embedding.length);
   d.prepare(`INSERT OR REPLACE INTO vec_memories(key, embedding) VALUES (?, ?)`).run(
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:312:7
   // ensureVecTableForRead with queryEmbedding.length = 0 / undefined and either
   // create a FLOAT[0] table or throw inside MATCH. Bail to [] so recall degrades
   // to TF-IDF rather than corrupting the table or crashing the query.
-  if (!Array.isArray(queryEmbedding) || queryEmbedding.length === 0) return [];
+  if (true) return [];
   const d = await getDb(dbPath);
   if (!d) return [];
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/vectorStore.ts:312:7
   // ensureVecTableForRead with queryEmbedding.length = 0 / undefined and either
   // create a FLOAT[0] table or throw inside MATCH. Bail to [] so recall degrades
   // to TF-IDF rather than corrupting the table or crashing the query.
-  if (!Array.isArray(queryEmbedding) || queryEmbedding.length === 0) return [];
+  if (Array.isArray(queryEmbedding) || queryEmbedding.length === 0) return [];
   const d = await getDb(dbPath);
   if (!d) return [];
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/vectorStore.ts:314:7
   // to TF-IDF rather than corrupting the table or crashing the query.
   if (!Array.isArray(queryEmbedding) || queryEmbedding.length === 0) return [];
   const d = await getDb(dbPath);
-  if (!d) return [];
+  if (false) return [];
   // Read path: never DROP the stored table on a dim mismatch (REVIEW 1.5). A
   // mismatch means the embedding model changed since the vectors were stored —
killedBy: vectorStore — graceful degradation searchVector returns empty array
statusReason: Cannot read properties of null (reading 'prepare')

[Killed] ConditionalExpression
src/vectorStore.ts:314:7
   // to TF-IDF rather than corrupting the table or crashing the query.
   if (!Array.isArray(queryEmbedding) || queryEmbedding.length === 0) return [];
   const d = await getDb(dbPath);
-  if (!d) return [];
+  if (true) return [];
   // Read path: never DROP the stored table on a dim mismatch (REVIEW 1.5). A
   // mismatch means the embedding model changed since the vectors were stored —
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/vectorStore.ts:321:7
   // next upsertVector (write path) or an explicit rebuild_index recreates the
   // table with the new dim. Dropping here would wipe every stored vector off a
   // single recall attempt.
-  if (!ensureVecTableForRead(d, queryEmbedding.length)) {
+  if (ensureVecTableForRead(d, queryEmbedding.length)) {
     recordError(
       `vector search skipped: query embedding dim ${queryEmbedding.length} != stored vec_memories dim ` +
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vectorStore.ts:321:57
   // next upsertVector (write path) or an explicit rebuild_index recreates the
   // table with the new dim. Dropping here would wipe every stored vector off a
   // single recall attempt.
-  if (!ensureVecTableForRead(d, queryEmbedding.length)) {
-    recordError(
-      `vector search skipped: query embedding dim ${queryEmbedding.length} != stored vec_memories dim ` +
-      `(embedding model changed?) — recall degrades to TF-IDF. NOTE: rebuild_index backfills MISSING vectors only; ` +
-      `it does NOT re-embed existing vectors stored at the old dim. To re-embed at the new dim, store/update each memory (or drop vec_memories so they backfill)`
-    );
-    return [];
-  }
+  if (!ensureVecTableForRead(d, queryEmbedding.length)) {}
   const rows = d
     .prepare(
killedBy: vectorStore — dynamic dimension migration searchVector does NOT drop the table on a dim mismatch — returns [] and records the error
statusReason: expected 0 to be greater than 0

[Survived] StringLiteral
src/vectorStore.ts:331:7
   }
   const rows = d
     .prepare(
-      `SELECT key, distance FROM vec_memories
-       WHERE embedding MATCH ?
-       ORDER BY distance LIMIT ?`
+      ``
     )
     .all(JSON.stringify(queryEmbedding), limit);

[Killed] ArrowFunction
src/vectorStore.ts:336:19
        ORDER BY distance LIMIT ?`
     )
     .all(JSON.stringify(queryEmbedding), limit);
-  return rows.map((r: any) => ({ key: r.key, score: 1 - r.distance }));
+  return rows.map(() => undefined);
 }
 
killedBy: vectorStore — success path with real sqlite searchVector returns results when db available
statusReason: Cannot convert undefined or null to object

[Survived] ArithmeticOperator
src/vectorStore.ts:336:53
        ORDER BY distance LIMIT ?`
     )
     .all(JSON.stringify(queryEmbedding), limit);
-  return rows.map((r: any) => ({ key: r.key, score: 1 - r.distance }));
+  return rows.map((r: any) => ({ key: r.key, score: 1 + r.distance }));
 }
 

[Killed] ConditionalExpression
src/vectorStore.ts:353:7
   expectedDim?: number
 ): Promise<Map<string, number[]>> {
   const result = new Map<string, number[]>();
-  if (keys.length === 0) return result;
+  if (true) return result;
   const d = await getDb(dbPath);
   if (!d) return result;
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:353:7
   expectedDim?: number
 ): Promise<Map<string, number[]>> {
   const result = new Map<string, number[]>();
-  if (keys.length === 0) return result;
+  if (false) return result;
   const d = await getDb(dbPath);
   if (!d) return result;
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BooleanLiteral
src/vectorStore.ts:355:7
   const result = new Map<string, number[]>();
   if (keys.length === 0) return result;
   const d = await getDb(dbPath);
-  if (!d) return result;
+  if (d) return result;
   // 3.2: when the caller knows the dim it will score against (rerank passes its
   // query vector's length), refuse to return rows from a table built with a
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key
