[Killed] ConditionalExpression
src/vectorStore.ts:355:7
   const result = new Map<string, number[]>();
   if (keys.length === 0) return result;
   const d = await getDb(dbPath);
-  if (!d) return result;
+  if (true) return result;
   // 3.2: when the caller knows the dim it will score against (rerank passes its
   // query vector's length), refuse to return rows from a table built with a
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] ConditionalExpression
src/vectorStore.ts:364:7
   // once here lets rerank short-circuit to fresh embeds (and record the model
   // change) instead of reading incomparable rows. The vec_memories table
   // enforces a single fixed dim, so a table-level check covers every row.
-  if (expectedDim !== undefined) {
+  if (true) {
     try {
       const existing = d
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] EqualityOperator
src/vectorStore.ts:364:7
   // once here lets rerank short-circuit to fresh embeds (and record the model
   // change) instead of reading incomparable rows. The vec_memories table
   // enforces a single fixed dim, so a table-level check covers every row.
-  if (expectedDim !== undefined) {
+  if (expectedDim === undefined) {
     try {
       const existing = d
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/vectorStore.ts:365:9
   // change) instead of reading incomparable rows. The vec_memories table
   // enforces a single fixed dim, so a table-level check covers every row.
   if (expectedDim !== undefined) {
-    try {
-      const existing = d
-        .prepare("SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'")
-        .get() as { sql: string } | undefined;
-      if (existing) {
-        const existingDim = parseExistingDimension(existing.sql);
-        if (existingDim !== null && existingDim !== expectedDim) {
-          recordError(
-            `getVectors skipped: stored vec_memories dim ${existingDim} != expected ${expectedDim} ` +
-            `(embedding model changed? returning no stored vectors so rerank re-embeds fresh; run rebuild_index to re-embed with the new model)`
-          );
-          return result;
-        }
-      }
-    } catch {
+    try {} catch {
       // best-effort dim check; fall through to the read
     }
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) returns an empty map and records the dim mismatch when stored dim != expectedDim
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "k/a",

[Killed] BlockStatement
src/vectorStore.ts:369:21
       const existing = d
         .prepare("SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'")
         .get() as { sql: string } | undefined;
-      if (existing) {
-        const existingDim = parseExistingDimension(existing.sql);
-        if (existingDim !== null && existingDim !== expectedDim) {
-          recordError(
-            `getVectors skipped: stored vec_memories dim ${existingDim} != expected ${expectedDim} ` +
-            `(embedding model changed? returning no stored vectors so rerank re-embeds fresh; run rebuild_index to re-embed with the new model)`
-          );
-          return result;
-        }
-      }
+      if (existing) {}
     } catch {
       // best-effort dim check; fall through to the read
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) returns an empty map and records the dim mismatch when stored dim != expectedDim
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "k/a",

[Killed] ConditionalExpression
src/vectorStore.ts:369:11
       const existing = d
         .prepare("SELECT sql FROM sqlite_master WHERE type='table' AND name='vec_memories'")
         .get() as { sql: string } | undefined;
-      if (existing) {
+      if (false) {
         const existingDim = parseExistingDimension(existing.sql);
         if (existingDim !== null && existingDim !== expectedDim) {
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) returns an empty map and records the dim mismatch when stored dim != expectedDim
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "k/a",

[Killed] BlockStatement
src/vectorStore.ts:371:66
         .get() as { sql: string } | undefined;
       if (existing) {
         const existingDim = parseExistingDimension(existing.sql);
-        if (existingDim !== null && existingDim !== expectedDim) {
-          recordError(
-            `getVectors skipped: stored vec_memories dim ${existingDim} != expected ${expectedDim} ` +
-            `(embedding model changed? returning no stored vectors so rerank re-embeds fresh; run rebuild_index to re-embed with the new model)`
-          );
-          return result;
-        }
+        if (existingDim !== null && existingDim !== expectedDim) {}
       }
     } catch {
killedBy: vectorStore — getVectors batch read (real sqlite-vec) 11.3a (3.2): returns an empty Map when expectedDim mismatches the stored dim (rerank re-embeds fresh)
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] EqualityOperator
src/vectorStore.ts:371:13
         .get() as { sql: string } | undefined;
       if (existing) {
         const existingDim = parseExistingDimension(existing.sql);
-        if (existingDim !== null && existingDim !== expectedDim) {
+        if (existingDim === null && existingDim !== expectedDim) {
           recordError(
             `getVectors skipped: stored vec_memories dim ${existingDim} != expected ${expectedDim} ` +
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) returns an empty map and records the dim mismatch when stored dim != expectedDim
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "k/a",

[Killed] StringLiteral
src/vectorStore.ts:373:13
         const existingDim = parseExistingDimension(existing.sql);
         if (existingDim !== null && existingDim !== expectedDim) {
           recordError(
-            `getVectors skipped: stored vec_memories dim ${existingDim} != expected ${expectedDim} ` +
+            `` +
             `(embedding model changed? returning no stored vectors so rerank re-embeds fresh; run rebuild_index to re-embed with the new model)`
           );
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) returns an empty map and records the dim mismatch when stored dim != expectedDim
statusReason: expected '(embedding model changed? returning n…' to match /stored vec_memories dim 128 != expect…/

[Killed] BlockStatement
src/vectorStore.ts:383:7
       // best-effort dim check; fall through to the read
     }
   }
-  try {
-    const placeholders = keys.map(() => '?').join(',');
-    const rows = d
-      .prepare(`SELECT key, vec_to_json(embedding) AS embedding FROM vec_memories WHERE key IN (${placeholders})`)
-      .all(...keys) as Array<{ key: string; embedding: string }>;
-    for (const r of rows) {
-      const vec = JSON.parse(r.embedding);
-      // 3.2 per-row guard: a row whose stored length disagrees with the expected
-      // dim (shouldn't happen — the table enforces one dim — but defend against
-      // a corrupt/half-migrated row) is skipped; the caller falls back to a fresh
-      // embed for that key rather than scoring an incomparable vector.
-      if (expectedDim !== undefined && Array.isArray(vec) && vec.length !== expectedDim) {
-        recordError(
-          `getVectors: stored vector dim ${vec.length} != expected ${expectedDim} for key ${r.key} ` +
-          `(skipped; rerank will re-embed this key)`
-        );
-        continue;
-      }
-      result.set(r.key, vec);
-    }
-  } catch (e: any) {
+  try {} catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
     if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return result;
killedBy: vectorStore — getVectors table-level dim mismatch (expectedDim set) reads rows when stored dim matches expectedDim
statusReason: expected undefined to deeply equal [ 0.1, 0.2, 0.3 ]

[Killed] ArrowFunction
src/vectorStore.ts:384:35
     }
   }
   try {
-    const placeholders = keys.map(() => '?').join(',');
+    const placeholders = keys.map(() => undefined).join(',');
     const rows = d
       .prepare(`SELECT key, vec_to_json(embedding) AS embedding FROM vec_memories WHERE key IN (${placeholders})`)
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/vectorStore.ts:384:51
     }
   }
   try {
-    const placeholders = keys.map(() => '?').join(',');
+    const placeholders = keys.map(() => '?').join("");
     const rows = d
       .prepare(`SELECT key, vec_to_json(embedding) AS embedding FROM vec_memories WHERE key IN (${placeholders})`)
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/vectorStore.ts:388:27
     const rows = d
       .prepare(`SELECT key, vec_to_json(embedding) AS embedding FROM vec_memories WHERE key IN (${placeholders})`)
       .all(...keys) as Array<{ key: string; embedding: string }>;
-    for (const r of rows) {
-      const vec = JSON.parse(r.embedding);
-      // 3.2 per-row guard: a row whose stored length disagrees with the expected
-      // dim (shouldn't happen — the table enforces one dim — but defend against
-      // a corrupt/half-migrated row) is skipped; the caller falls back to a fresh
-      // embed for that key rather than scoring an incomparable vector.
-      if (expectedDim !== undefined && Array.isArray(vec) && vec.length !== expectedDim) {
-        recordError(
-          `getVectors: stored vector dim ${vec.length} != expected ${expectedDim} for key ${r.key} ` +
-          `(skipped; rerank will re-embed this key)`
-        );
-        continue;
-      }
-      result.set(r.key, vec);
-    }
+    for (const r of rows) {}
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] LogicalOperator
src/vectorStore.ts:394:11
       // dim (shouldn't happen — the table enforces one dim — but defend against
       // a corrupt/half-migrated row) is skipped; the caller falls back to a fresh
       // embed for that key rather than scoring an incomparable vector.
-      if (expectedDim !== undefined && Array.isArray(vec) && vec.length !== expectedDim) {
+      if (expectedDim !== undefined && Array.isArray(vec) || vec.length !== expectedDim) {
         recordError(
           `getVectors: stored vector dim ${vec.length} != expected ${expectedDim} for key ${r.key} ` +
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] LogicalOperator
src/vectorStore.ts:394:11
       // dim (shouldn't happen — the table enforces one dim — but defend against
       // a corrupt/half-migrated row) is skipped; the caller falls back to a fresh
       // embed for that key rather than scoring an incomparable vector.
-      if (expectedDim !== undefined && Array.isArray(vec) && vec.length !== expectedDim) {
+      if (expectedDim !== undefined || Array.isArray(vec) && vec.length !== expectedDim) {
         recordError(
           `getVectors: stored vector dim ${vec.length} != expected ${expectedDim} for key ${r.key} ` +
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] StringLiteral
src/vectorStore.ts:396:11
       // embed for that key rather than scoring an incomparable vector.
       if (expectedDim !== undefined && Array.isArray(vec) && vec.length !== expectedDim) {
         recordError(
-          `getVectors: stored vector dim ${vec.length} != expected ${expectedDim} for key ${r.key} ` +
+          `` +
           `(skipped; rerank will re-embed this key)`
         );
killedBy: vectorStore — getVectors per-row dim mismatch skips a row whose stored embedding length != expectedDim and records it
statusReason: expected '(skipped; rerank will re-embed this k…' to match /stored vector dim .* != expected 384 …/

[Killed] BlockStatement
src/vectorStore.ts:403:20
       }
       result.set(r.key, vec);
     }
-  } catch (e: any) {
-    // A freshly-created db with no vectors yet has no vec_memories table.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return result;
-    throw e;
-  }
+  } catch (e: any) {}
   return result;
 }
killedBy: vectorStore — non-string e.message rethrows (typeof guard) getVectors rethrows a non-no-such-table error with a string message
statusReason: promise resolved "Map{}" instead of rejecting

[Killed] EqualityOperator
src/vectorStore.ts:405:14
     }
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return result;
+    if (e && typeof e.message !== 'string' && /no such table/i.test(e.message)) return result;
     throw e;
   }
killedBy: vectorStore — dynamic dimension migration getVectors tolerates a missing vec_memories table
statusReason: no such table: vec_memories

[Killed] ConditionalExpression
src/vectorStore.ts:405:9
     }
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return result;
+    if (true) return result;
     throw e;
   }
killedBy: vectorStore — non-string e.message rethrows (typeof guard) getVectors rethrows a non-no-such-table error with a string message
statusReason: promise resolved "Map{}" instead of rejecting

[Killed] BlockStatement
src/vectorStore.ts:411:80
   return result;
 }
 
-export async function deleteVector(dbPath: string, key: string): Promise<void> {
-  const d = await getDb(dbPath);
-  if (!d) return;
-  try {
-    d.prepare(`DELETE FROM vec_memories WHERE key = ?`).run(key);
-  } catch (e: any) {
-    // A freshly-created db with no vectors yet has no vec_memories table.
-    // Treat a missing table as a no-op delete, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return;
-    throw e;
-  }
-}
+export async function deleteVector(dbPath: string, key: string): Promise<void> {}
 
 // Drop the vec_memories (and vec_meta fingerprint) tables, used by the opt-in
killedBy: vectorStore — non-string e.message rethrows (typeof guard) deleteVector rethrows when the thrown error has a non-string message
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/vectorStore.ts:413:7
 
 export async function deleteVector(dbPath: string, key: string): Promise<void> {
   const d = await getDb(dbPath);
-  if (!d) return;
+  if (d) return;
   try {
     d.prepare(`DELETE FROM vec_memories WHERE key = ?`).run(key);
killedBy: vectorStore — graceful degradation deleteVector resolves without throwing
statusReason: promise rejected "TypeError: Cannot read properties of null…" instead of resolving

[Killed] BlockStatement
src/vectorStore.ts:414:7
 export async function deleteVector(dbPath: string, key: string): Promise<void> {
   const d = await getDb(dbPath);
   if (!d) return;
-  try {
-    d.prepare(`DELETE FROM vec_memories WHERE key = ?`).run(key);
-  } catch (e: any) {
+  try {} catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
     // Treat a missing table as a no-op delete, not a fatal error.
killedBy: vectorStore — non-string e.message rethrows (typeof guard) deleteVector rethrows when the thrown error has a non-string message
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/vectorStore.ts:415:15
   const d = await getDb(dbPath);
   if (!d) return;
   try {
-    d.prepare(`DELETE FROM vec_memories WHERE key = ?`).run(key);
+    d.prepare(``).run(key);
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.

[Killed] BlockStatement
src/vectorStore.ts:416:20
   if (!d) return;
   try {
     d.prepare(`DELETE FROM vec_memories WHERE key = ?`).run(key);
-  } catch (e: any) {
-    // A freshly-created db with no vectors yet has no vec_memories table.
-    // Treat a missing table as a no-op delete, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return;
-    throw e;
-  }
+  } catch (e: any) {}
 }
 
killedBy: vectorStore — non-string e.message rethrows (typeof guard) deleteVector rethrows when the thrown error has a non-string message
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/vectorStore.ts:419:9
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
     // Treat a missing table as a no-op delete, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return;
+    if (false) return;
     throw e;
   }
killedBy: vectorStore — dynamic dimension migration deleteVector and listVectorKeys tolerate a missing vec_memories table
statusReason: promise rejected "Error: no such table: vec_memories" instead of resolving

[Killed] EqualityOperator
src/vectorStore.ts:419:14
   } catch (e: any) {
     // A freshly-created db with no vectors yet has no vec_memories table.
     // Treat a missing table as a no-op delete, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return;
+    if (e && typeof e.message !== 'string' && /no such table/i.test(e.message)) return;
     throw e;
   }
killedBy: vectorStore — dynamic dimension migration deleteVector and listVectorKeys tolerate a missing vec_memories table
statusReason: promise rejected "Error: no such table: vec_memories" instead of resolving

[NoCoverage] BlockStatement
src/vectorStore.ts:434:70
 // vec_meta (writeVecMeta). No-op when the optional sqlite-vec deps are absent
 // (getDb resolves to null) — there's nothing to drop. Best-effort: a DROP failure
 // is recorded, not thrown, so a re-embed run isn't aborted by a sqlite I/O error.
-export async function dropVectorTable(dbPath: string): Promise<void> {
-  const d = await getDb(dbPath);
-  if (!d) return;
-  try {
-    d.exec('DROP TABLE IF EXISTS vec_memories');
-    d.exec('DROP TABLE IF EXISTS vec_meta');
-  } catch (e) {
-    recordError(`dropVectorTable: ${e instanceof Error ? e.message : String(e)}`);
-  }
-}
+export async function dropVectorTable(dbPath: string): Promise<void> {}
 
 // All keys currently present in the vector store. Returns null when the optional

[NoCoverage] BlockStatement
src/vectorStore.ts:437:7
 export async function dropVectorTable(dbPath: string): Promise<void> {
   const d = await getDb(dbPath);
   if (!d) return;
-  try {
-    d.exec('DROP TABLE IF EXISTS vec_memories');
-    d.exec('DROP TABLE IF EXISTS vec_meta');
-  } catch (e) {
+  try {} catch (e) {
     recordError(`dropVectorTable: ${e instanceof Error ? e.message : String(e)}`);
   }

[NoCoverage] StringLiteral
src/vectorStore.ts:439:12
   if (!d) return;
   try {
     d.exec('DROP TABLE IF EXISTS vec_memories');
-    d.exec('DROP TABLE IF EXISTS vec_meta');
+    d.exec("");
   } catch (e) {
     recordError(`dropVectorTable: ${e instanceof Error ? e.message : String(e)}`);

[NoCoverage] BlockStatement
src/vectorStore.ts:440:15
   try {
     d.exec('DROP TABLE IF EXISTS vec_memories');
     d.exec('DROP TABLE IF EXISTS vec_meta');
-  } catch (e) {
-    recordError(`dropVectorTable: ${e instanceof Error ? e.message : String(e)}`);
-  }
+  } catch (e) {}
 }
 

[Killed] BlockStatement
src/vectorStore.ts:451:80
 // reconcileIndex's boot backfill (vault-scan.ts) to find memIndex keys that
 // have a .md file but no vec_memories row — left by a prior SIGTERM that killed
 // a fire-and-forget embedAndUpsert before it landed (#3).
-export async function listVectorKeys(dbPath: string): Promise<string[] | null> {
-  const d = await getDb(dbPath);
-  if (!d) return null;
-  try {
-    const rows = d.prepare(`SELECT key FROM vec_memories`).all() as Array<{ key: string }>;
-    return rows.map(r => r.key);
-  } catch (e: any) {
-    // A freshly-created db may not have the vec table yet if no upsert/search
-    // has run. Treat a missing table as an empty store, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return [];
-    throw e;
-  }
-}
+export async function listVectorKeys(dbPath: string): Promise<string[] | null> {}
 
killedBy: vectorStore — graceful degradation all operations remain no-ops after first failed load
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/vectorStore.ts:453:7
 // a fire-and-forget embedAndUpsert before it landed (#3).
 export async function listVectorKeys(dbPath: string): Promise<string[] | null> {
   const d = await getDb(dbPath);
-  if (!d) return null;
+  if (true) return null;
   try {
     const rows = d.prepare(`SELECT key FROM vec_memories`).all() as Array<{ key: string }>;
killedBy: vectorStore — success path with real sqlite listVectorKeys returns keys when db available
statusReason: expected null to deeply equal [ 'k/a' ]

[Killed] BlockStatement
src/vectorStore.ts:454:7
 export async function listVectorKeys(dbPath: string): Promise<string[] | null> {
   const d = await getDb(dbPath);
   if (!d) return null;
-  try {
-    const rows = d.prepare(`SELECT key FROM vec_memories`).all() as Array<{ key: string }>;
-    return rows.map(r => r.key);
-  } catch (e: any) {
+  try {} catch (e: any) {
     // A freshly-created db may not have the vec table yet if no upsert/search
     // has run. Treat a missing table as an empty store, not a fatal error.
killedBy: vectorStore — success path with real sqlite listVectorKeys returns keys when db available
statusReason: expected undefined to deeply equal [ 'k/a' ]

[Killed] ArrowFunction
src/vectorStore.ts:456:21
   if (!d) return null;
   try {
     const rows = d.prepare(`SELECT key FROM vec_memories`).all() as Array<{ key: string }>;
-    return rows.map(r => r.key);
+    return rows.map(() => undefined);
   } catch (e: any) {
     // A freshly-created db may not have the vec table yet if no upsert/search
killedBy: vectorStore — success path with real sqlite listVectorKeys returns keys when db available
statusReason: expected [ undefined ] to deeply equal [ 'k/a' ]

[Killed] BlockStatement
src/vectorStore.ts:457:20
   try {
     const rows = d.prepare(`SELECT key FROM vec_memories`).all() as Array<{ key: string }>;
     return rows.map(r => r.key);
-  } catch (e: any) {
-    // A freshly-created db may not have the vec table yet if no upsert/search
-    // has run. Treat a missing table as an empty store, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return [];
-    throw e;
-  }
+  } catch (e: any) {}
 }
 
killedBy: vectorStore — dynamic dimension migration deleteVector and listVectorKeys tolerate a missing vec_memories table
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/vectorStore.ts:460:9
   } catch (e: any) {
     // A freshly-created db may not have the vec table yet if no upsert/search
     // has run. Treat a missing table as an empty store, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return [];
+    if (false) return [];
     throw e;
   }
killedBy: vectorStore — dynamic dimension migration deleteVector and listVectorKeys tolerate a missing vec_memories table
statusReason: promise rejected "Error: no such table: vec_memories" instead of resolving

[Killed] ConditionalExpression
src/vectorStore.ts:460:9
   } catch (e: any) {
     // A freshly-created db may not have the vec table yet if no upsert/search
     // has run. Treat a missing table as an empty store, not a fatal error.
-    if (e && typeof e.message === 'string' && /no such table/i.test(e.message)) return [];
+    if (true) return [];
     throw e;
   }
killedBy: vectorStore — non-string e.message rethrows (typeof guard) listVectorKeys rethrows when the thrown error has a non-string message
statusReason: promise resolved "[]" instead of rejecting
