[Killed] BooleanLiteral
src/persistence.ts:33:19
 // index + rewrote invertedIndex.json on disk — O(N) work + disk I/O per read
 // for a mutation that changes zero tokens. Reset to false once the recalc has
 // reflected it (timer fires, or flushPending on exit).
-let dirtyTokens = false;
+let dirtyTokens = true;
 
 // ─── Index persistence ───────────────────────────────────────────────────────
killedBy: vectorStore — getVectors batch read (real sqlite-vec) round-trips stored embeddings via vec_to_json, keyed by requested keys
statusReason: UNIQUE constraint failed on vec_memories primary key

[Killed] BlockStatement
src/persistence.ts:46:35
 // never silently misreads a newer index. REVIEW 9.2.
 const INDEX_VERSION = 1;
 
-function serializeIndex(): string {
-  return JSON.stringify({ v: INDEX_VERSION, entries: memIndex }, null, 2);
-}
+function serializeIndex(): string {}
 
 // 2.2: concurrent-session clobber protection. Each Claude Code window spawns
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 'stale-from-disk' to be 'fresh-from-mem' // Object.is equality

[Killed] BlockStatement
src/persistence.ts:67:39
 // only its index entry can lag one boot). This is the minimal, no-lock fix the
 // review scopes; a real CAS/flock would be needed to also preserve a concurrent
 // store's index entry within the same session.
-function mergeRuntimeFieldsFromDisk() {
-  let parsed: unknown;
-  try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
-  catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
-  const entries = unwrapIndexEntries(parsed);
-  if (!entries) return;
-  for (const [k, v] of Object.entries(entries)) {
-    const mem = (memIndex as Record<string, any>)[k];
-    if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
-    const disk = v as Record<string, unknown>;
-    if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
-      mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
-    }
-    if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
-      if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
-    }
-  }
-}
+function mergeRuntimeFieldsFromDisk() {}
 
 // Unwrap the on-disk object into the entries map, accepting both the current
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BlockStatement
src/persistence.ts:69:7
 // store's index entry within the same session.
 function mergeRuntimeFieldsFromDisk() {
   let parsed: unknown;
-  try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
+  try {}
   catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
   const entries = unwrapIndexEntries(parsed);
killedBy: saveNow merges runtime fields from disk (2.2) is a no-op merge when no index.json is on disk (cold start)
statusReason: ENOENT: no such file or directory, open '/home/adrianb/.total-recall/index.json'

[Survived] BlockStatement
src/persistence.ts:70:9
 function mergeRuntimeFieldsFromDisk() {
   let parsed: unknown;
   try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
-  catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
+  catch {} // ENOENT (cold start) or corrupt — nothing to merge
   const entries = unwrapIndexEntries(parsed);
   if (!entries) return;

[Killed] ConditionalExpression
src/persistence.ts:72:7
   try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
   catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
   const entries = unwrapIndexEntries(parsed);
-  if (!entries) return;
+  if (false) return;
   for (const [k, v] of Object.entries(entries)) {
     const mem = (memIndex as Record<string, any>)[k];
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BooleanLiteral
src/persistence.ts:72:7
   try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
   catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
   const entries = unwrapIndexEntries(parsed);
-  if (!entries) return;
+  if (entries) return;
   for (const [k, v] of Object.entries(entries)) {
     const mem = (memIndex as Record<string, any>)[k];
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BlockStatement
src/persistence.ts:73:49
   catch { return; } // ENOENT (cold start) or corrupt — nothing to merge
   const entries = unwrapIndexEntries(parsed);
   if (!entries) return;
-  for (const [k, v] of Object.entries(entries)) {
-    const mem = (memIndex as Record<string, any>)[k];
-    if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
-    const disk = v as Record<string, unknown>;
-    if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
-      mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
-    }
-    if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
-      if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
-    }
-  }
+  for (const [k, v] of Object.entries(entries)) {}
 }
 
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:75:9
   if (!entries) return;
   for (const [k, v] of Object.entries(entries)) {
     const mem = (memIndex as Record<string, any>)[k];
-    if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
+    if (false) continue;
     const disk = v as Record<string, unknown>;
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: ENOENT: no such file or directory, open '/home/adrianb/.total-recall/index.json'

[Killed] ConditionalExpression
src/persistence.ts:75:9
   if (!entries) return;
   for (const [k, v] of Object.entries(entries)) {
     const mem = (memIndex as Record<string, any>)[k];
-    if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
+    if (false || Array.isArray(v)) continue;
     const disk = v as Record<string, unknown>;
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: Cannot read properties of undefined (reading 'knowledge/merge-probe')

[Killed] EqualityOperator
src/persistence.ts:77:9
     const mem = (memIndex as Record<string, any>)[k];
     if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
     const disk = v as Record<string, unknown>;
-    if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
+    if (typeof disk.accessCount !== 'number' && Number.isFinite(disk.accessCount)) {
       mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BlockStatement
src/persistence.ts:77:84
     const mem = (memIndex as Record<string, any>)[k];
     if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
     const disk = v as Record<string, unknown>;
-    if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
-      mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
-    }
+    if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {}
     if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
       if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] MethodExpression
src/persistence.ts:78:25
     if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
     const disk = v as Record<string, unknown>;
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
-      mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
+      mem.accessCount = Math.min(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
     if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Survived] ConditionalExpression
src/persistence.ts:78:34
     if (!mem || typeof v !== 'object' || v === null || Array.isArray(v)) continue;
     const disk = v as Record<string, unknown>;
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
-      mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
+      mem.accessCount = Math.max(false ? mem.accessCount : 0, disk.accessCount);
     }
     if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {

[Killed] BlockStatement
src/persistence.ts:80:69
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
       mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
-    if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
-      if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
-    }
+    if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {}
   }
 }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-07-20T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:80:9
     if (typeof disk.accessCount === 'number' && Number.isFinite(disk.accessCount)) {
       mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
-    if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
+    if (false) {
       if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
     }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-07-20T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:81:11
       mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
     if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
-      if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
+      if (false) mem.lastAccessed = disk.lastAccessed;
     }
   }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-07-20T00:00:00.000Z' // Object.is equality

[Killed] LogicalOperator
src/persistence.ts:81:11
       mem.accessCount = Math.max(typeof mem.accessCount === 'number' ? mem.accessCount : 0, disk.accessCount);
     }
     if (typeof disk.lastAccessed === 'string' && disk.lastAccessed) {
-      if (!mem.lastAccessed || disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
+      if (!mem.lastAccessed && disk.lastAccessed > mem.lastAccessed) mem.lastAccessed = disk.lastAccessed;
     }
   }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-07-20T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
src/persistence.ts:89:78
 // Unwrap the on-disk object into the entries map, accepting both the current
 // wrapped shape and the legacy flat shape. Returns null for a forward-
 // incompatible version (caller bails to the reconcileIndex rebuild).
-function unwrapIndexEntries(parsed: unknown): Record<string, unknown> | null {
-  if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return null;
-  const obj = parsed as Record<string, unknown>;
-  // Wrapped shape: { v: number, entries: {...} }. A flat legacy index never
-  // has a numeric `v` at top level (keys are slugs like `knowledge/x`), so the
-  // `typeof obj.v === 'number'` guard cleanly distinguishes the two shapes.
-  if (typeof obj.v === 'number') {
-    if (obj.v > INDEX_VERSION) return null;
-    const entries = obj.entries;
-    if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
-      return entries as Record<string, unknown>;
-    }
-    return null;
-  }
-  // Legacy flat shape: the whole object is the entries map.
-  return obj;
-}
+function unwrapIndexEntries(parsed: unknown): Record<string, unknown> | null {}
 
 // Write-then-rename so a SIGKILL / power loss mid-write can't leave index.json,
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] EqualityOperator
src/persistence.ts:90:18
 // wrapped shape and the legacy flat shape. Returns null for a forward-
 // incompatible version (caller bails to the reconcileIndex rebuild).
 function unwrapIndexEntries(parsed: unknown): Record<string, unknown> | null {
-  if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return null;
+  if (!parsed || typeof parsed === 'object' || Array.isArray(parsed)) return null;
   const obj = parsed as Record<string, unknown>;
   // Wrapped shape: { v: number, entries: {...} }. A flat legacy index never
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:90:7
 // wrapped shape and the legacy flat shape. Returns null for a forward-
 // incompatible version (caller bails to the reconcileIndex rebuild).
 function unwrapIndexEntries(parsed: unknown): Record<string, unknown> | null {
-  if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return null;
+  if (true) return null;
   const obj = parsed as Record<string, unknown>;
   // Wrapped shape: { v: number, entries: {...} }. A flat legacy index never
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:95:7
   // Wrapped shape: { v: number, entries: {...} }. A flat legacy index never
   // has a numeric `v` at top level (keys are slugs like `knowledge/x`), so the
   // `typeof obj.v === 'number'` guard cleanly distinguishes the two shapes.
-  if (typeof obj.v === 'number') {
+  if (false) {
     if (obj.v > INDEX_VERSION) return null;
     const entries = obj.entries;
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BlockStatement
src/persistence.ts:95:34
   // Wrapped shape: { v: number, entries: {...} }. A flat legacy index never
   // has a numeric `v` at top level (keys are slugs like `knowledge/x`), so the
   // `typeof obj.v === 'number'` guard cleanly distinguishes the two shapes.
-  if (typeof obj.v === 'number') {
-    if (obj.v > INDEX_VERSION) return null;
-    const entries = obj.entries;
-    if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
-      return entries as Record<string, unknown>;
-    }
-    return null;
-  }
+  if (typeof obj.v === 'number') {}
   // Legacy flat shape: the whole object is the entries map.
   return obj;
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:96:9
   // has a numeric `v` at top level (keys are slugs like `knowledge/x`), so the
   // `typeof obj.v === 'number'` guard cleanly distinguishes the two shapes.
   if (typeof obj.v === 'number') {
-    if (obj.v > INDEX_VERSION) return null;
+    if (true) return null;
     const entries = obj.entries;
     if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/persistence.ts:96:9
   // has a numeric `v` at top level (keys are slugs like `knowledge/x`), so the
   // `typeof obj.v === 'number'` guard cleanly distinguishes the two shapes.
   if (typeof obj.v === 'number') {
-    if (obj.v > INDEX_VERSION) return null;
+    if (obj.v <= INDEX_VERSION) return null;
     const entries = obj.entries;
     if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/persistence.ts:98:9
   if (typeof obj.v === 'number') {
     if (obj.v > INDEX_VERSION) return null;
     const entries = obj.entries;
-    if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
+    if (false) {
       return entries as Record<string, unknown>;
     }
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/persistence.ts:98:76
   if (typeof obj.v === 'number') {
     if (obj.v > INDEX_VERSION) return null;
     const entries = obj.entries;
-    if (entries && typeof entries === 'object' && !Array.isArray(entries)) {
-      return entries as Record<string, unknown>;
-    }
+    if (entries && typeof entries === 'object' && !Array.isArray(entries)) {}
     return null;
   }
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 2 to be 10 // Object.is equality

[Survived] BlockStatement
src/persistence.ts:119:32
 // actually survives a crash. Both fsyncs are best-effort (network FS / Windows
 // may not support them); the rename atomicity holds regardless — fsync only
 // adds crash durability on top.
-function fsyncDir(dir: string) {
-  try {
-    const fd = fs.openSync(dir, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
-  } catch { /* Windows / network FS don't support dir fsync; best-effort */ }
-}
+function fsyncDir(dir: string) {}
 
 function atomicWrite(p: string, data: string) {

[Survived] BlockStatement
src/persistence.ts:120:7
 // may not support them); the rename atomicity holds regardless — fsync only
 // adds crash durability on top.
 function fsyncDir(dir: string) {
-  try {
-    const fd = fs.openSync(dir, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
-  } catch { /* Windows / network FS don't support dir fsync; best-effort */ }
+  try {} catch { /* Windows / network FS don't support dir fsync; best-effort */ }
 }
 

[Survived] StringLiteral
src/persistence.ts:121:33
 // adds crash durability on top.
 function fsyncDir(dir: string) {
   try {
-    const fd = fs.openSync(dir, 'r');
+    const fd = fs.openSync(dir, "");
     try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
   } catch { /* Windows / network FS don't support dir fsync; best-effort */ }

[Survived] BlockStatement
src/persistence.ts:122:9
 function fsyncDir(dir: string) {
   try {
     const fd = fs.openSync(dir, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
+    try {} finally { fs.closeSync(fd); }
   } catch { /* Windows / network FS don't support dir fsync; best-effort */ }
 }

[Survived] BlockStatement
src/persistence.ts:122:39
 function fsyncDir(dir: string) {
   try {
     const fd = fs.openSync(dir, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
+    try { fs.fsyncSync(fd); } finally {}
   } catch { /* Windows / network FS don't support dir fsync; best-effort */ }
 }

[Killed] StringLiteral
src/persistence.ts:133:15
   // pointing at an outside file, and writeFileSync(tmp) would follow it and
   // clobber the target. randomBytes makes the tmp path unguessable, closing the
   // symlink-race escalation (write-to-vault → clobber-any-user-writable-file).
-  const tmp = `${p}.tmp.${crypto.randomBytes(6).toString('hex')}`;
+  const tmp = ``;
   try {
     fs.writeFileSync(tmp, data);
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 'stale-from-disk' to be 'fresh-from-mem' // Object.is equality

[Killed] BlockStatement
src/persistence.ts:134:7
   // clobber the target. randomBytes makes the tmp path unguessable, closing the
   // symlink-race escalation (write-to-vault → clobber-any-user-writable-file).
   const tmp = `${p}.tmp.${crypto.randomBytes(6).toString('hex')}`;
-  try {
-    fs.writeFileSync(tmp, data);
-  } catch (e) {
+  try {} catch (e) {
     // 4.1 (REVIEW 1.6): tmp write failed (ENOSPC / EACCES / EROFS / EISDIR).
     // Leave the LAST-GOOD target untouched. A direct overwrite here would
killedBy: atomicWrite 4.1: last-good preserved on tmp-write failure leaves the staged index.json untouched and records tmp-write failed
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/persistence.ts:136:15
   const tmp = `${p}.tmp.${crypto.randomBytes(6).toString('hex')}`;
   try {
     fs.writeFileSync(tmp, data);
-  } catch (e) {
-    // 4.1 (REVIEW 1.6): tmp write failed (ENOSPC / EACCES / EROFS / EISDIR).
-    // Leave the LAST-GOOD target untouched. A direct overwrite here would
-    // DEFEAT atomicWrite's whole purpose — a crash mid-fallback would corrupt
-    // the file atomic-write was meant to protect, trading a transient I/O error
-    // (which reconcileIndex rebuilds from on next boot) for permanent data
-    // corruption. The tmp lives in the same dir/fs as the target, so whatever
-    // blocked the tmp write (no space, no permission, read-only fs) blocks a
-    // direct write too — the overwrite only ever added corruption risk, never
-    // benefit. recordError (not throw): atomicWrite runs from debounced
-    // setTimeouts AND the SIGTERM/SIGINT/beforeExit path, where an uncaught
-    // throw escapes the timer → uncaughtException → the stdio server dies
-    // mid-session (index.ts registers no uncaughtException handler). The
-    // .md files stay durable; the last-good index survives for next boot.
-    recordError(`atomicWrite(${p}) tmp-write failed (last-good left intact): ${(e as Error).message}`);
-    return;
-  }
+  } catch (e) {}
   // fsync the tmp file's data so the page cache is flushed to disk before the
   // rename — without this, a crash after writeFileSync can leave the tmp empty
killedBy: atomicWrite 4.1: last-good preserved on tmp-write failure leaves the staged index.json untouched and records tmp-write failed
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/persistence.ts:157:7
   // rename — without this, a crash after writeFileSync can leave the tmp empty
   // even though rename "succeeded", producing a zero-byte index. Best-effort:
   // some FS don't support fsync; the rename atomicity below still holds.
-  try {
-    const fd = fs.openSync(tmp, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
-  } catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
+  try {} catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
   try {
     fs.renameSync(tmp, p);

[Survived] BlockStatement
src/persistence.ts:159:9
   // some FS don't support fsync; the rename atomicity below still holds.
   try {
     const fd = fs.openSync(tmp, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
+    try {} finally { fs.closeSync(fd); }
   } catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
   try {

[Survived] BlockStatement
src/persistence.ts:159:39
   // some FS don't support fsync; the rename atomicity below still holds.
   try {
     const fd = fs.openSync(tmp, 'r');
-    try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
+    try { fs.fsyncSync(fd); } finally {}
   } catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
   try {

[Killed] BlockStatement
src/persistence.ts:161:7
     const fd = fs.openSync(tmp, 'r');
     try { fs.fsyncSync(fd); } finally { fs.closeSync(fd); }
   } catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
-  try {
-    fs.renameSync(tmp, p);
-  } catch (renErr) {
+  try {} catch (renErr) {
     // 4.1 (REVIEW 1.6): rename can fail on Windows (open handles / cross-volume).
     // Fall back to a direct overwrite — loses POSIX atomicity but lands the data.
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 'stale-from-disk' to be 'fresh-from-mem' // Object.is equality

[NoCoverage] BlockStatement
src/persistence.ts:163:20
   } catch { /* best-effort: fsync unsupported on this FS — rename still atomic */ }
   try {
     fs.renameSync(tmp, p);
-  } catch (renErr) {
-    // 4.1 (REVIEW 1.6): rename can fail on Windows (open handles / cross-volume).
-    // Fall back to a direct overwrite — loses POSIX atomicity but lands the data.
-    // The overwrite is GUARDED (try/recordError, not a bare throw) so a boot-time
-    // atomicWrite can't take the process down via an uncaught throw here; the
-    // orphaned tmp is cleaned up either way so it doesn't accumulate on disk.
-    try {
-      fs.writeFileSync(p, data);
-    } catch (e) {
-      recordError(`atomicWrite(${p}) rename-fallback: rename=${(renErr as Error).message}; write=${(e as Error).message}`);
-    }
-    try { fs.unlinkSync(tmp); } catch { /* best-effort cleanup of the orphaned tmp */ }
-    return;
-  }
+  } catch (renErr) {}
   // fsync the parent dir so the rename dirent is durable too — otherwise a
   // crash after rename can leave the dir entry pointing at the old inode.

[NoCoverage] BlockStatement
src/persistence.ts:169:9
     // The overwrite is GUARDED (try/recordError, not a bare throw) so a boot-time
     // atomicWrite can't take the process down via an uncaught throw here; the
     // orphaned tmp is cleaned up either way so it doesn't accumulate on disk.
-    try {
-      fs.writeFileSync(p, data);
-    } catch (e) {
+    try {} catch (e) {
       recordError(`atomicWrite(${p}) rename-fallback: rename=${(renErr as Error).message}; write=${(e as Error).message}`);
     }

[NoCoverage] BlockStatement
src/persistence.ts:171:17
     // orphaned tmp is cleaned up either way so it doesn't accumulate on disk.
     try {
       fs.writeFileSync(p, data);
-    } catch (e) {
-      recordError(`atomicWrite(${p}) rename-fallback: rename=${(renErr as Error).message}; write=${(e as Error).message}`);
-    }
+    } catch (e) {}
     try { fs.unlinkSync(tmp); } catch { /* best-effort cleanup of the orphaned tmp */ }
     return;

[NoCoverage] StringLiteral
src/persistence.ts:172:19
     try {
       fs.writeFileSync(p, data);
     } catch (e) {
-      recordError(`atomicWrite(${p}) rename-fallback: rename=${(renErr as Error).message}; write=${(e as Error).message}`);
+      recordError(``);
     }
     try { fs.unlinkSync(tmp); } catch { /* best-effort cleanup of the orphaned tmp */ }

[NoCoverage] BlockStatement
src/persistence.ts:174:9
     } catch (e) {
       recordError(`atomicWrite(${p}) rename-fallback: rename=${(renErr as Error).message}; write=${(e as Error).message}`);
     }
-    try { fs.unlinkSync(tmp); } catch { /* best-effort cleanup of the orphaned tmp */ }
+    try {} catch { /* best-effort cleanup of the orphaned tmp */ }
     return;
   }
