[Killed] BlockStatement
src/persistence.ts:206:68
 // keys that could escape when joined (`..`/`.` segments, leading `/`, `\`,
 // null bytes, empty segments); return null on any failure so the caller drops
 // the entry rather than indexing a path that points outside the vault.
-export function deriveFilePathFromKey(key: unknown): string | null {
-  if (typeof key !== 'string' || !key) return null;
-  // Prototype-pollution guard: keys like `__proto__`, `constructor`, or
-  // `prototype` (or any segment containing them) must never become property
-  // names on memIndex or the serialized index.json.
-  if (isReservedKey(key)) return null;
-  if (key.includes('\0') || key.includes('\\')) return null;
-  const isOrg = key.startsWith('org/');
-  const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
-  const segments = rel.split('/');
-  if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
-  const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
-  const filePath = path.join(base, rel + '.md');
-  const vaultRoot = path.resolve(base);
-  const resolved = path.resolve(filePath);
-  if (resolved !== vaultRoot && !resolved.startsWith(vaultRoot + path.sep)) return null;
-  return filePath;
-}
+export function deriveFilePathFromKey(key: unknown): string | null {}
 
 // `key` is the memIndex key (the JSON object key in index.json) — the trusted
killedBy: deriveFilePathFromKey — every guard branch returns null for non-string keys
statusReason: expected undefined to be null

[Killed] BooleanLiteral
src/persistence.ts:207:34
 // null bytes, empty segments); return null on any failure so the caller drops
 // the entry rather than indexing a path that points outside the vault.
 export function deriveFilePathFromKey(key: unknown): string | null {
-  if (typeof key !== 'string' || !key) return null;
+  if (typeof key !== 'string' || key) return null;
   // Prototype-pollution guard: keys like `__proto__`, `constructor`, or
   // `prototype` (or any segment containing them) must never become property
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:207:7
 // null bytes, empty segments); return null on any failure so the caller drops
 // the entry rather than indexing a path that points outside the vault.
 export function deriveFilePathFromKey(key: unknown): string | null {
-  if (typeof key !== 'string' || !key) return null;
+  if (true) return null;
   // Prototype-pollution guard: keys like `__proto__`, `constructor`, or
   // `prototype` (or any segment containing them) must never become property
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:211:7
   // Prototype-pollution guard: keys like `__proto__`, `constructor`, or
   // `prototype` (or any segment containing them) must never become property
   // names on memIndex or the serialized index.json.
-  if (isReservedKey(key)) return null;
+  if (true) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:211:7
   // Prototype-pollution guard: keys like `__proto__`, `constructor`, or
   // `prototype` (or any segment containing them) must never become property
   // names on memIndex or the serialized index.json.
-  if (isReservedKey(key)) return null;
+  if (false) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
killedBy: deriveFilePathFromKey — every guard branch returns null for prototype-pollution reserved segments
statusReason: expected '/home/adrianb/.total-recall/personal-…' to be null

[Killed] ConditionalExpression
src/persistence.ts:212:7
   // `prototype` (or any segment containing them) must never become property
   // names on memIndex or the serialized index.json.
   if (isReservedKey(key)) return null;
-  if (key.includes('\0') || key.includes('\\')) return null;
+  if (true) return null;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] LogicalOperator
src/persistence.ts:212:7
   // `prototype` (or any segment containing them) must never become property
   // names on memIndex or the serialized index.json.
   if (isReservedKey(key)) return null;
-  if (key.includes('\0') || key.includes('\\')) return null;
+  if (key.includes('\0') && key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
killedBy: deriveFilePathFromKey — every guard branch returns null for null bytes and backslashes
statusReason: expected '/home/adrianb/.total-recall/personal-…' to be null

[Killed] MethodExpression
src/persistence.ts:213:17
   // names on memIndex or the serialized index.json.
   if (isReservedKey(key)) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
-  const isOrg = key.startsWith('org/');
+  const isOrg = key.endsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
killedBy: deriveFilePathFromKey — every guard branch derives an org-vault path for an org/ key
statusReason: expected '/home/adrianb/.total-recall/personal-…' to be '/home/adrianb/.total-recall/org/org-v…' // Object.is equality

[Killed] StringLiteral
src/persistence.ts:213:32
   // names on memIndex or the serialized index.json.
   if (isReservedKey(key)) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
-  const isOrg = key.startsWith('org/');
+  const isOrg = key.startsWith("");
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected '/home/adrianb/.total-recall/org/org-v…' to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] MethodExpression
src/persistence.ts:214:23
   if (isReservedKey(key)) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
-  const rel = isOrg ? key.slice('org/'.length) : key;
+  const rel = isOrg ? key : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
   const segments = rel.split('/');
killedBy: deriveFilePathFromKey — every guard branch derives an org-vault path for an org/ key
statusReason: expected '/home/adrianb/.total-recall/org/org-v…' to be '/home/adrianb/.total-recall/org/org-v…' // Object.is equality

[Killed] StringLiteral
src/persistence.ts:214:33
   if (isReservedKey(key)) return null;
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
-  const rel = isOrg ? key.slice('org/'.length) : key;
+  const rel = isOrg ? key.slice("".length) : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
   const segments = rel.split('/');
killedBy: deriveFilePathFromKey — every guard branch derives an org-vault path for an org/ key
statusReason: expected '/home/adrianb/.total-recall/org/org-v…' to be '/home/adrianb/.total-recall/org/org-v…' // Object.is equality

[Killed] BooleanLiteral
src/persistence.ts:215:7
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
+  if (rel || rel.startsWith('/') || rel.includes('//')) return null;
   const segments = rel.split('/');
   if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
killedBy: loadMemIndex index.json schema version (REVIEW 9.2) loads the wrapped { v, entries } shape
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/persistence.ts:215:7
   if (key.includes('\0') || key.includes('\\')) return null;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
+  if (false || rel.includes('//')) return null;
   const segments = rel.split('/');
   if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
killedBy: loadMemIndex index.json schema version (REVIEW 9.2) loads the wrapped { v, entries } shape
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/persistence.ts:217:7
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
   const segments = rel.split('/');
-  if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
+  if (segments.every(s => s === '..' || s === '.' || s === '')) return null;
   const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
   const filePath = path.join(base, rel + '.md');
killedBy: deriveFilePathFromKey — every guard branch returns null for absolute paths, // segments, and . / .. traversal
statusReason: expected '/home/adrianb/.total-recall/personal-…' to be null

[Killed] EqualityOperator
src/persistence.ts:217:53
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel || rel.startsWith('/') || rel.includes('//')) return null;
   const segments = rel.split('/');
-  if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
+  if (segments.some(s => s === '..' || s === '.' || s !== '')) return null;
   const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
   const filePath = path.join(base, rel + '.md');
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] StringLiteral
src/persistence.ts:219:42
   const segments = rel.split('/');
   if (segments.some(s => s === '..' || s === '.' || s === '')) return null;
   const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
-  const filePath = path.join(base, rel + '.md');
+  const filePath = path.join(base, rel + "");
   const vaultRoot = path.resolve(base);
   const resolved = path.resolve(filePath);
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected '/home/adrianb/.total-recall/personal-…' to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] BooleanLiteral
src/persistence.ts:222:33
   const filePath = path.join(base, rel + '.md');
   const vaultRoot = path.resolve(base);
   const resolved = path.resolve(filePath);
-  if (resolved !== vaultRoot && !resolved.startsWith(vaultRoot + path.sep)) return null;
+  if (resolved !== vaultRoot && resolved.startsWith(vaultRoot + path.sep)) return null;
   return filePath;
 }
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] LogicalOperator
src/persistence.ts:222:7
   const filePath = path.join(base, rel + '.md');
   const vaultRoot = path.resolve(base);
   const resolved = path.resolve(filePath);
-  if (resolved !== vaultRoot && !resolved.startsWith(vaultRoot + path.sep)) return null;
+  if (resolved !== vaultRoot || !resolved.startsWith(vaultRoot + path.sep)) return null;
   return filePath;
 }
killedBy: deriveFilePathFromKey — every guard branch derives a personal-vault path for a valid personal key
statusReason: expected null to be '/home/adrianb/.total-recall/personal-…' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:231:7
 // fields inside the entry. filePath is re-derived from it (see
 // deriveFilePathFromKey); the inner `key` field is normalized to match.
 function coerceMemEntry(raw: unknown, key: string): Record<string, unknown> | null {
-  if (!raw || typeof raw !== 'object' || Array.isArray(raw)) return null;
+  if (true) return null;
   const e = raw as Record<string, unknown>;
   const filePath = deriveFilePathFromKey(key);
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/persistence.ts:231:15
 // fields inside the entry. filePath is re-derived from it (see
 // deriveFilePathFromKey); the inner `key` field is normalized to match.
 function coerceMemEntry(raw: unknown, key: string): Record<string, unknown> | null {
-  if (!raw || typeof raw !== 'object' || Array.isArray(raw)) return null;
+  if (!raw || typeof raw === 'object' || Array.isArray(raw)) return null;
   const e = raw as Record<string, unknown>;
   const filePath = deriveFilePathFromKey(key);
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/persistence.ts:234:7
   if (!raw || typeof raw !== 'object' || Array.isArray(raw)) return null;
   const e = raw as Record<string, unknown>;
   const filePath = deriveFilePathFromKey(key);
-  if (!filePath) return null;
+  if (true) return null;
   return {
     ...e,
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/persistence.ts:234:7
   if (!raw || typeof raw !== 'object' || Array.isArray(raw)) return null;
   const e = raw as Record<string, unknown>;
   const filePath = deriveFilePathFromKey(key);
-  if (!filePath) return null;
+  if (filePath) return null;
   return {
     ...e,
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/persistence.ts:239:19
     ...e,
     key,        // normalize to the trusted memIndex key (discard any inner key)
     filePath,   // re-derived + containment-checked; discards any persisted filePath
-    title: String(e.title ?? ''),
+    title: String(e.title && ''),
     tags: Array.isArray(e.tags)
       ? e.tags
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a Number title to a string (pre-v1.0.6 legacy)
statusReason: expected '' to be '2026' // Object.is equality

[Survived] StringLiteral
src/persistence.ts:239:30
     ...e,
     key,        // normalize to the trusted memIndex key (discard any inner key)
     filePath,   // re-derived + containment-checked; discards any persisted filePath
-    title: String(e.title ?? ''),
+    title: String(e.title ?? "Stryker was here!"),
     tags: Array.isArray(e.tags)
       ? e.tags

[Killed] MethodExpression
src/persistence.ts:241:9
     filePath,   // re-derived + containment-checked; discards any persisted filePath
     title: String(e.title ?? ''),
     tags: Array.isArray(e.tags)
-      ? e.tags
-          .map((t: unknown) => (t === null || t === undefined ? '' : typeof t === 'string' ? t : String(t)))
-          .filter(Boolean)
+      ? e.tags.map((t: unknown) => t === null || t === undefined ? '' : typeof t === 'string' ? t : String(t))
       : [],
     sessions: Array.isArray(e.sessions) ? e.sessions : [],
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized filters null/undefined/non-string tag items, coercing numbers to strings
statusReason: expected [ '', '123', 'keep', '', 'also-keep' ] to deeply equal [ '123', 'keep', 'also-keep' ]

[Killed] ArrowFunction
src/persistence.ts:242:16
     title: String(e.title ?? ''),
     tags: Array.isArray(e.tags)
       ? e.tags
-          .map((t: unknown) => (t === null || t === undefined ? '' : typeof t === 'string' ? t : String(t)))
+          .map(() => undefined)
           .filter(Boolean)
       : [],
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized filters null/undefined/non-string tag items, coercing numbers to strings
statusReason: expected [] to deeply equal [ '123', 'keep', 'also-keep' ]

[Killed] LogicalOperator
src/persistence.ts:242:33
     title: String(e.title ?? ''),
     tags: Array.isArray(e.tags)
       ? e.tags
-          .map((t: unknown) => (t === null || t === undefined ? '' : typeof t === 'string' ? t : String(t)))
+          .map((t: unknown) => (t === null && t === undefined ? '' : typeof t === 'string' ? t : String(t)))
           .filter(Boolean)
       : [],
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized filters null/undefined/non-string tag items, coercing numbers to strings
statusReason: expected [ 'null', '123', 'keep', 'null', …(1) ] to deeply equal [ '123', 'keep', 'also-keep' ]

[Killed] ArrayDeclaration
src/persistence.ts:245:56
           .map((t: unknown) => (t === null || t === undefined ? '' : typeof t === 'string' ? t : String(t)))
           .filter(Boolean)
       : [],
-    sessions: Array.isArray(e.sessions) ? e.sessions : [],
+    sessions: Array.isArray(e.sessions) ? e.sessions : ["Stryker was here"],
     // Graphiti supersede provenance (Tech Radar vol.34 #45): coerce the chain
     // to a string array so a corrupt/hand-edited index.json (scalar, non-string
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[NoCoverage] EqualityOperator
src/persistence.ts:252:60
     // the raw value through; this overrides it with a sanitized copy. Absent on
     // pre-upgrade index.json → undefined (no supersession history yet).
     supersededAt: Array.isArray(e.supersededAt)
-      ? e.supersededAt.filter((t: unknown): t is string => typeof t === 'string')
+      ? e.supersededAt.filter((t: unknown): t is string => typeof t !== 'string')
       : undefined,
     // Clamp + coerce importanceScore to a finite [0, 1] number — see

[NoCoverage] MethodExpression
src/persistence.ts:252:9
     // the raw value through; this overrides it with a sanitized copy. Absent on
     // pre-upgrade index.json → undefined (no supersession history yet).
     supersededAt: Array.isArray(e.supersededAt)
-      ? e.supersededAt.filter((t: unknown): t is string => typeof t === 'string')
+      ? e.supersededAt
       : undefined,
     // Clamp + coerce importanceScore to a finite [0, 1] number — see

[Killed] ConditionalExpression
src/persistence.ts:259:18
     importanceScore: clampImportanceScore(e.importanceScore),
     // Provide safe defaults for fields added after earlier index.json formats so
     // a pre-upgrade entry never carries undefined through to search/pruning.
-    accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
+    accessCount: true ? Math.max(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a non-numeric accessCount to 0 (NaN-string hole)
statusReason: expected NaN to be +0 // Object.is equality

[NoCoverage] MethodExpression
src/persistence.ts:259:88
     importanceScore: clampImportanceScore(e.importanceScore),
     // Provide safe defaults for fields added after earlier index.json formats so
     // a pre-upgrade entry never carries undefined through to search/pruning.
-    accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
+    accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.min(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),

[Killed] EqualityOperator
src/persistence.ts:260:19
     // Provide safe defaults for fields added after earlier index.json formats so
     // a pre-upgrade entry never carries undefined through to search/pruning.
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
-    lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
+    lastAccessed: typeof e.lastAccessed !== 'string' ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
     category: typeof e.category === 'string' ? e.category : 'knowledge',
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:260:19
     // Provide safe defaults for fields added after earlier index.json formats so
     // a pre-upgrade entry never carries undefined through to search/pruning.
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
-    lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
+    lastAccessed: true ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
     category: typeof e.category === 'string' ? e.category : 'knowledge',
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:261:12
     // a pre-upgrade entry never carries undefined through to search/pruning.
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
-    isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
+    isOrg: true ? e.isOrg : key.startsWith('org/'),
     category: typeof e.category === 'string' ? e.category : 'knowledge',
     // #19: preserve persisted mtimeMs/size so reconcileIndex can skip
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/persistence.ts:261:12
     // a pre-upgrade entry never carries undefined through to search/pruning.
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
-    isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
+    isOrg: typeof e.isOrg !== 'boolean' ? e.isOrg : key.startsWith('org/'),
     category: typeof e.category === 'string' ? e.category : 'knowledge',
     // #19: preserve persisted mtimeMs/size so reconcileIndex can skip
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:262:15
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
-    category: typeof e.category === 'string' ? e.category : 'knowledge',
+    category: true ? e.category : 'knowledge',
     // #19: preserve persisted mtimeMs/size so reconcileIndex can skip
     // unchanged files across boots. A pre-#19 index.json (or a corrupted
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be 'knowledge' // Object.is equality

[Killed] EqualityOperator
src/persistence.ts:262:15
     accessCount: typeof e.accessCount === 'number' && Number.isFinite(e.accessCount) ? Math.max(0, e.accessCount) : 0,
     lastAccessed: typeof e.lastAccessed === 'string' ? e.lastAccessed : '',
     isOrg: typeof e.isOrg === 'boolean' ? e.isOrg : key.startsWith('org/'),
-    category: typeof e.category === 'string' ? e.category : 'knowledge',
+    category: typeof e.category !== 'string' ? e.category : 'knowledge',
     // #19: preserve persisted mtimeMs/size so reconcileIndex can skip
     // unchanged files across boots. A pre-#19 index.json (or a corrupted
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized defaults missing fields to safe values
statusReason: expected undefined to be 'knowledge' // Object.is equality

[Survived] EqualityOperator
src/persistence.ts:268:14
     // non-numeric value) yields 0 — the "no stat" sentinel that forces a
     // full re-read on the next reconcile, so the skip path never fires on
     // stale/corrupt data.
-    mtimeMs: typeof e.mtimeMs === 'number' && Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
+    mtimeMs: typeof e.mtimeMs !== 'number' && Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
     size: typeof e.size === 'number' && Number.isFinite(e.size) ? e.size : 0,
   };

[Survived] LogicalOperator
src/persistence.ts:268:14
     // non-numeric value) yields 0 — the "no stat" sentinel that forces a
     // full re-read on the next reconcile, so the skip path never fires on
     // stale/corrupt data.
-    mtimeMs: typeof e.mtimeMs === 'number' && Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
+    mtimeMs: typeof e.mtimeMs === 'number' || Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
     size: typeof e.size === 'number' && Number.isFinite(e.size) ? e.size : 0,
   };

[Survived] ConditionalExpression
src/persistence.ts:269:11
     // full re-read on the next reconcile, so the skip path never fires on
     // stale/corrupt data.
     mtimeMs: typeof e.mtimeMs === 'number' && Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
-    size: typeof e.size === 'number' && Number.isFinite(e.size) ? e.size : 0,
+    size: false ? e.size : 0,
   };
 }

[Survived] LogicalOperator
src/persistence.ts:269:11
     // full re-read on the next reconcile, so the skip path never fires on
     // stale/corrupt data.
     mtimeMs: typeof e.mtimeMs === 'number' && Number.isFinite(e.mtimeMs) ? e.mtimeMs : 0,
-    size: typeof e.size === 'number' && Number.isFinite(e.size) ? e.size : 0,
+    size: typeof e.size === 'number' || Number.isFinite(e.size) ? e.size : 0,
   };
 }

[Killed] BlockStatement
src/persistence.ts:277:13
   for (const k of Object.keys(memIndex)) delete (memIndex as any)[k];
   let parsed: unknown;
   try { parsed = JSON.parse(fs.readFileSync(INDEX_PATH, 'utf8')); }
-  catch (e) {
-    // ENOENT is the expected cold start (no index.json yet — the first store
-    // creates it); stay silent so a fresh install doesn't log a spurious error.
-    // Any OTHER failure (corrupt JSON from an interrupted atomicWrite, a bad
-    // manual edit, an EACCES on the file) is worth surfacing: the personal
-    // index is self-healing (reconcileIndex rebuilds from the .md files next),
-    // but the user would otherwise have NO signal that their index.json is
-    // corrupt and that the rebuild just discarded the runtime-only
-    // accessCount/lastAccessed fields. Distinct from the org-index guard (#2),
-    // which throws on a corrupt committed index that propagates via git; this
-    // is local-only and benign, but the silent discard hides a real condition.
-    if ((e as NodeJS.ErrnoException).code !== 'ENOENT') {
-      recordError(`loadMemIndex parse failed (rebuilding from .md files): ${(e as Error).message}`);
-    }
-    return;
-  }
+  catch (e) {}
   if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return;
   const entries = unwrapIndexEntries(parsed);
killedBy: loadMemIndex records a corrupt index.json parse failure (#13) records a non-ENOENT parse error and does not throw
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/persistence.ts:288:9
     // accessCount/lastAccessed fields. Distinct from the org-index guard (#2),
     // which throws on a corrupt committed index that propagates via git; this
     // is local-only and benign, but the silent discard hides a real condition.
-    if ((e as NodeJS.ErrnoException).code !== 'ENOENT') {
+    if (true) {
       recordError(`loadMemIndex parse failed (rebuilding from .md files): ${(e as Error).message}`);
     }
killedBy: loadMemIndex records a corrupt index.json parse failure (#13) stays silent on ENOENT (cold start — no index.json yet)
statusReason: expected 1 to be +0 // Object.is equality
