[Killed] ConditionalExpression
src/persistence.ts:288:9
     // accessCount/lastAccessed fields. Distinct from the org-index guard (#2),
     // which throws on a corrupt committed index that propagates via git; this
     // is local-only and benign, but the silent discard hides a real condition.
-    if ((e as NodeJS.ErrnoException).code !== 'ENOENT') {
+    if (false) {
       recordError(`loadMemIndex parse failed (rebuilding from .md files): ${(e as Error).message}`);
     }
killedBy: loadMemIndex records a corrupt index.json parse failure (#13) records a non-ENOENT parse error and does not throw
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/persistence.ts:289:19
     // which throws on a corrupt committed index that propagates via git; this
     // is local-only and benign, but the silent discard hides a real condition.
     if ((e as NodeJS.ErrnoException).code !== 'ENOENT') {
-      recordError(`loadMemIndex parse failed (rebuilding from .md files): ${(e as Error).message}`);
+      recordError(``);
     }
     return;
killedBy: loadMemIndex records a corrupt index.json parse failure (#13) records a non-ENOENT parse error and does not throw
statusReason: expected '' to match /loadMemIndex parse failed/

[Killed] ConditionalExpression
src/persistence.ts:293:7
     }
     return;
   }
-  if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return;
+  if (true) return;
   const entries = unwrapIndexEntries(parsed);
   if (entries === null) {
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/persistence.ts:293:18
     }
     return;
   }
-  if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return;
+  if (!parsed || typeof parsed === 'object' || Array.isArray(parsed)) return;
   const entries = unwrapIndexEntries(parsed);
   if (entries === null) {
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/persistence.ts:295:7
   }
   if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return;
   const entries = unwrapIndexEntries(parsed);
-  if (entries === null) {
+  if (entries !== null) {
     // Forward-incompatible index.json (a `v` higher than we know) or a
     // malformed wrapper. Bail to the reconcileIndex rebuild from the .md files
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/persistence.ts:295:7
   }
   if (!parsed || typeof parsed !== 'object' || Array.isArray(parsed)) return;
   const entries = unwrapIndexEntries(parsed);
-  if (entries === null) {
+  if (false) {
     // Forward-incompatible index.json (a `v` higher than we know) or a
     // malformed wrapper. Bail to the reconcileIndex rebuild from the .md files
killedBy: unwrapIndexEntries forward-incompatible version refuses a future schema version (v > INDEX_VERSION) and records an error
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/persistence.ts:303:49
     recordError('loadMemIndex: index.json schema version newer than known or malformed wrapper; rebuilding from .md files');
     return;
   }
-  for (const [k, v] of Object.entries(entries)) {
-    const coerced = coerceMemEntry(v, k);
-    if (coerced) (memIndex as any)[k] = coerced;
-  }
+  for (const [k, v] of Object.entries(entries)) {}
 }
 
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/persistence.ts:305:9
   }
   for (const [k, v] of Object.entries(entries)) {
     const coerced = coerceMemEntry(v, k);
-    if (coerced) (memIndex as any)[k] = coerced;
+    if (true) (memIndex as any)[k] = coerced;
   }
 }
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized drops an entry whose key fails deriveFilePathFromKey (reserved segment)
statusReason: expected null to be undefined

[Killed] ConditionalExpression
src/persistence.ts:305:9
   }
   for (const [k, v] of Object.entries(entries)) {
     const coerced = coerceMemEntry(v, k);
-    if (coerced) (memIndex as any)[k] = coerced;
+    if (false) (memIndex as any)[k] = coerced;
   }
 }
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/persistence.ts:309:31
   }
 }
 
-export function loadIndexes() {
-  loadMemIndex();
-  // #18: do NOT load invertedIndex.json here. main() rebuilds the inverted index
-  // synchronously from memIndex right after reconcileIndex (recalcIdfNow), so
-  // the on-disk copy is dead I/O at every boot — JSON.parse + populate, then
-  // immediately clear-then-rebuild. main() is synchronous until server.connect,
-  // so no query can arrive between a hypothetical load and the rebuild; the load
-  // can never serve a read. Reconcile + recalcIdfNow repopulate from the source
-  // of truth (the .md files via memIndex), so dropping the load changes nothing
-  // observable except boot time.
-}
+export function loadIndexes() {}
 
 // Write path (store/update/delete/reconcile): tokens changed, so the inverted
killedBy: coerceMemEntry via loadIndexes — malformed index.json is sanitized coerces a scalar-string tags value to an empty array
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/persistence.ts:325:32
 // index + cache are stale — flag dirty so the save timer schedules an idf
 // recalc when it flushes. The recalc is still debounced (+2s after the 1s
 // index write) so a burst of writes does one rebuild, not N.
-export function scheduleSave() {
-  dirtyTokens = true;
-  scheduleIndexSave();
-}
+export function scheduleSave() {}
 
 // Read path (bumpAccess in state.ts): only accessCount/lastAccessed moved on
killedBy: flushPending does not throw when index writes fail (records error, best-effort)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/persistence.ts:326:17
 // recalc when it flushes. The recalc is still debounced (+2s after the 1s
 // index write) so a burst of writes does one rebuild, not N.
 export function scheduleSave() {
-  dirtyTokens = true;
+  dirtyTokens = false;
   scheduleIndexSave();
 }
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/persistence.ts:334:38
 // disk — tokens unchanged, the inverted index + cache stay valid. Persist the
 // access bump WITHOUT rebuilding the inverted index. See the dirtyTokens flag
 // comment above for the full rationale.
-export function scheduleAccessSave() {
-  scheduleIndexSave();
-}
+export function scheduleAccessSave() {}
 
 // Shared 1s-debounced index.json write, shared by the write and read paths.

[Survived] BlockStatement
src/persistence.ts:341:30
 // Shared 1s-debounced index.json write, shared by the write and read paths.
 // The dirtyTokens gate decides whether the (expensive) inverted-index rebuild
 // follows: writes set it, reads don't, so a read never triggers the rebuild.
-function scheduleIndexSave() {
-  if (indexSaveTimer) clearTimeout(indexSaveTimer);
-  indexSaveTimer = setTimeout(() => {
-    // A throw inside a setTimeout callback fires uncaughtException (index.ts
-    // registers no handler) and kills the stdio server mid-session. atomicWrite
-    // now falls back rather than throwing on transient I/O, but JSON.stringify
-    // of an odd memIndex shape or a scheduleIdfRecalc failure could still throw
-    // — record to the shared `errors` singleton (bounded in state.ts via
-    // recordError) and never rethrow from an async timer.
-    try {
-      mergeRuntimeFieldsFromDisk();
-      atomicWrite(INDEX_PATH, serializeIndex());
-      if (dirtyTokens) {
-        dirtyTokens = false;
-        scheduleIdfRecalc();
-      }
-    } catch (e) {
-      recordError(`scheduleSave: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
-  }, 1000);
-}
+function scheduleIndexSave() {}
 
 export function scheduleIdfRecalc() {

[Survived] ConditionalExpression
src/persistence.ts:342:7
 // The dirtyTokens gate decides whether the (expensive) inverted-index rebuild
 // follows: writes set it, reads don't, so a read never triggers the rebuild.
 function scheduleIndexSave() {
-  if (indexSaveTimer) clearTimeout(indexSaveTimer);
+  if (true) clearTimeout(indexSaveTimer);
   indexSaveTimer = setTimeout(() => {
     // A throw inside a setTimeout callback fires uncaughtException (index.ts

[Survived] ConditionalExpression
src/persistence.ts:342:7
 // The dirtyTokens gate decides whether the (expensive) inverted-index rebuild
 // follows: writes set it, reads don't, so a read never triggers the rebuild.
 function scheduleIndexSave() {
-  if (indexSaveTimer) clearTimeout(indexSaveTimer);
+  if (false) clearTimeout(indexSaveTimer);
   indexSaveTimer = setTimeout(() => {
     // A throw inside a setTimeout callback fires uncaughtException (index.ts

[NoCoverage] BlockStatement
src/persistence.ts:343:37
 // follows: writes set it, reads don't, so a read never triggers the rebuild.
 function scheduleIndexSave() {
   if (indexSaveTimer) clearTimeout(indexSaveTimer);
-  indexSaveTimer = setTimeout(() => {
-    // A throw inside a setTimeout callback fires uncaughtException (index.ts
-    // registers no handler) and kills the stdio server mid-session. atomicWrite
-    // now falls back rather than throwing on transient I/O, but JSON.stringify
-    // of an odd memIndex shape or a scheduleIdfRecalc failure could still throw
-    // — record to the shared `errors` singleton (bounded in state.ts via
-    // recordError) and never rethrow from an async timer.
-    try {
-      mergeRuntimeFieldsFromDisk();
-      atomicWrite(INDEX_PATH, serializeIndex());
-      if (dirtyTokens) {
-        dirtyTokens = false;
-        scheduleIdfRecalc();
-      }
-    } catch (e) {
-      recordError(`scheduleSave: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
-  }, 1000);
+  indexSaveTimer = setTimeout(() => {}, 1000);
 }
 

[NoCoverage] BlockStatement
src/persistence.ts:350:9
     // of an odd memIndex shape or a scheduleIdfRecalc failure could still throw
     // — record to the shared `errors` singleton (bounded in state.ts via
     // recordError) and never rethrow from an async timer.
-    try {
-      mergeRuntimeFieldsFromDisk();
-      atomicWrite(INDEX_PATH, serializeIndex());
-      if (dirtyTokens) {
-        dirtyTokens = false;
-        scheduleIdfRecalc();
-      }
-    } catch (e) {
+    try {} catch (e) {
       recordError(`scheduleSave: ${(e as Error).message}`);
       try { console.error(e); } catch { /* stderr closed — ignore */ }

[NoCoverage] ConditionalExpression
src/persistence.ts:353:11
     try {
       mergeRuntimeFieldsFromDisk();
       atomicWrite(INDEX_PATH, serializeIndex());
-      if (dirtyTokens) {
+      if (false) {
         dirtyTokens = false;
         scheduleIdfRecalc();

[NoCoverage] ConditionalExpression
src/persistence.ts:353:11
     try {
       mergeRuntimeFieldsFromDisk();
       atomicWrite(INDEX_PATH, serializeIndex());
-      if (dirtyTokens) {
+      if (true) {
         dirtyTokens = false;
         scheduleIdfRecalc();

[NoCoverage] BooleanLiteral
src/persistence.ts:354:23
       mergeRuntimeFieldsFromDisk();
       atomicWrite(INDEX_PATH, serializeIndex());
       if (dirtyTokens) {
-        dirtyTokens = false;
+        dirtyTokens = true;
         scheduleIdfRecalc();
       }

[NoCoverage] BlockStatement
src/persistence.ts:357:17
         dirtyTokens = false;
         scheduleIdfRecalc();
       }
-    } catch (e) {
-      recordError(`scheduleSave: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
+    } catch (e) {}
   }, 1000);
 }

[NoCoverage] BlockStatement
src/persistence.ts:359:11
       }
     } catch (e) {
       recordError(`scheduleSave: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
+      try {} catch { /* stderr closed — ignore */ }
     }
   }, 1000);

[Killed] BlockStatement
src/persistence.ts:364:37
   }, 1000);
 }
 
-export function scheduleIdfRecalc() {
-  if (idfTimer) clearTimeout(idfTimer);
-  idfTimer = setTimeout(() => {
-    try {
-      // Inverted index is already updated incrementally in-memory during mutations
-      atomicWrite(INVERTED_INDEX_PATH, JSON.stringify(invertedIndex, null, 2));
-      buildIndexCache();
-    } catch (e) {
-      recordError(`scheduleIdfRecalc: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
-  }, 2000);
-}
+export function scheduleIdfRecalc() {}
 
 // ─── Flush on exit ────────────────────────────────────────────────────────────
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when only idfTimer was queued (dirtyTokens=false)
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/persistence.ts:365:7
 }
 
 export function scheduleIdfRecalc() {
-  if (idfTimer) clearTimeout(idfTimer);
+  if (true) clearTimeout(idfTimer);
   idfTimer = setTimeout(() => {
     try {

[Survived] ConditionalExpression
src/persistence.ts:365:7
 }
 
 export function scheduleIdfRecalc() {
-  if (idfTimer) clearTimeout(idfTimer);
+  if (false) clearTimeout(idfTimer);
   idfTimer = setTimeout(() => {
     try {

[NoCoverage] BlockStatement
src/persistence.ts:366:31
 
 export function scheduleIdfRecalc() {
   if (idfTimer) clearTimeout(idfTimer);
-  idfTimer = setTimeout(() => {
-    try {
-      // Inverted index is already updated incrementally in-memory during mutations
-      atomicWrite(INVERTED_INDEX_PATH, JSON.stringify(invertedIndex, null, 2));
-      buildIndexCache();
-    } catch (e) {
-      recordError(`scheduleIdfRecalc: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
-  }, 2000);
+  idfTimer = setTimeout(() => {}, 2000);
 }
 

[NoCoverage] BlockStatement
src/persistence.ts:367:9
 export function scheduleIdfRecalc() {
   if (idfTimer) clearTimeout(idfTimer);
   idfTimer = setTimeout(() => {
-    try {
-      // Inverted index is already updated incrementally in-memory during mutations
-      atomicWrite(INVERTED_INDEX_PATH, JSON.stringify(invertedIndex, null, 2));
-      buildIndexCache();
-    } catch (e) {
+    try {} catch (e) {
       recordError(`scheduleIdfRecalc: ${(e as Error).message}`);
       try { console.error(e); } catch { /* stderr closed — ignore */ }

[NoCoverage] BlockStatement
src/persistence.ts:371:17
       // Inverted index is already updated incrementally in-memory during mutations
       atomicWrite(INVERTED_INDEX_PATH, JSON.stringify(invertedIndex, null, 2));
       buildIndexCache();
-    } catch (e) {
-      recordError(`scheduleIdfRecalc: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
-    }
+    } catch (e) {}
   }, 2000);
 }

[NoCoverage] BlockStatement
src/persistence.ts:373:11
       buildIndexCache();
     } catch (e) {
       recordError(`scheduleIdfRecalc: ${(e as Error).message}`);
-      try { console.error(e); } catch { /* stderr closed — ignore */ }
+      try {} catch { /* stderr closed — ignore */ }
     }
   }, 2000);

[Killed] BlockStatement
src/persistence.ts:384:27
 // SIGTERM/SIGINT/beforeExit so the index never lags behind the .md files (which
 // are written synchronously and are always durable).
 
-export function saveNow() {
-  mergeRuntimeFieldsFromDisk();
-  atomicWrite(INDEX_PATH, serializeIndex());
-}
+export function saveNow() {}
 
 export function recalcIdfNow() {
killedBy: saveNow merges runtime fields from disk (2.2) takes max(disk, mem) for accessCount and lastAccessed
statusReason: expected 'stale-from-disk' to be 'fresh-from-mem' // Object.is equality

[Killed] BlockStatement
src/persistence.ts:389:32
   atomicWrite(INDEX_PATH, serializeIndex());
 }
 
-export function recalcIdfNow() {
-  rebuildInvertedIndex();
-  atomicWrite(INVERTED_INDEX_PATH, JSON.stringify(invertedIndex, null, 2));
-  buildIndexCache();
-}
+export function recalcIdfNow() {}
 
 // #18: Clear the dirtyTokens flag after the boot sync-rebuild. main() calls
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Survived] BlockStatement
src/persistence.ts:404:34
 // side-effect) is skipped. Tokens did not change between the sync rebuild and
 // the timer fire (no tool call can arrive: main() is synchronous until
 // server.connect), so clearing the flag loses nothing.
-export function markIndexFresh() {
-  dirtyTokens = false;
-}
+export function markIndexFresh() {}
 
 export function flushPending() {

[Survived] BooleanLiteral
src/persistence.ts:405:17
 // the timer fire (no tool call can arrive: main() is synchronous until
 // server.connect), so clearing the flag loses nothing.
 export function markIndexFresh() {
-  dirtyTokens = false;
+  dirtyTokens = true;
 }
 

[Killed] ConditionalExpression
src/persistence.ts:409:7
 }
 
 export function flushPending() {
-  if (!indexSaveTimer && !idfTimer && !dirtyTokens) return;
+  if (false) return;
   if (indexSaveTimer) clearTimeout(indexSaveTimer);
   // Capture whether a recalc was queued BEFORE clearing idfTimer. After clearing,
killedBy: flushPending is a no-op when no debounce timer is armed (records nothing)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/persistence.ts:409:7
 }
 
 export function flushPending() {
-  if (!indexSaveTimer && !idfTimer && !dirtyTokens) return;
+  if (true) return;
   if (indexSaveTimer) clearTimeout(indexSaveTimer);
   // Capture whether a recalc was queued BEFORE clearing idfTimer. After clearing,
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/persistence.ts:410:7
 
 export function flushPending() {
   if (!indexSaveTimer && !idfTimer && !dirtyTokens) return;
-  if (indexSaveTimer) clearTimeout(indexSaveTimer);
+  if (true) clearTimeout(indexSaveTimer);
   // Capture whether a recalc was queued BEFORE clearing idfTimer. After clearing,
   // `idfTimer` is null, so `idfTimer !== null` is always false — reading it after

[Survived] ConditionalExpression
src/persistence.ts:410:7
 
 export function flushPending() {
   if (!indexSaveTimer && !idfTimer && !dirtyTokens) return;
-  if (indexSaveTimer) clearTimeout(indexSaveTimer);
+  if (false) clearTimeout(indexSaveTimer);
   // Capture whether a recalc was queued BEFORE clearing idfTimer. After clearing,
   // `idfTimer` is null, so `idfTimer !== null` is always false — reading it after

[Killed] ConditionalExpression
src/persistence.ts:419:24
   // dirtyTokens is false (the index timer cleared it) but the tokens DID change
   // earlier (that's what triggered scheduleSave → scheduleIdfRecalc). Capture
   // before clearing, not after.
-  const idfWasQueued = idfTimer !== null;
+  const idfWasQueued = true;
   if (idfTimer) clearTimeout(idfTimer);
   indexSaveTimer = null;
killedBy: flushPending read-only recalc gate (#4) skips rebuildInvertedIndex on a scheduleAccessSave-only exit
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] EqualityOperator
src/persistence.ts:419:24
   // dirtyTokens is false (the index timer cleared it) but the tokens DID change
   // earlier (that's what triggered scheduleSave → scheduleIdfRecalc). Capture
   // before clearing, not after.
-  const idfWasQueued = idfTimer !== null;
+  const idfWasQueued = idfTimer === null;
   if (idfTimer) clearTimeout(idfTimer);
   indexSaveTimer = null;
killedBy: flushPending read-only recalc gate (#4) skips rebuildInvertedIndex on a scheduleAccessSave-only exit
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Survived] ConditionalExpression
src/persistence.ts:420:7
   // earlier (that's what triggered scheduleSave → scheduleIdfRecalc). Capture
   // before clearing, not after.
   const idfWasQueued = idfTimer !== null;
-  if (idfTimer) clearTimeout(idfTimer);
+  if (true) clearTimeout(idfTimer);
   indexSaveTimer = null;
   idfTimer = null;

[Survived] ConditionalExpression
src/persistence.ts:420:7
   // earlier (that's what triggered scheduleSave → scheduleIdfRecalc). Capture
   // before clearing, not after.
   const idfWasQueued = idfTimer !== null;
-  if (idfTimer) clearTimeout(idfTimer);
+  if (false) clearTimeout(idfTimer);
   indexSaveTimer = null;
   idfTimer = null;

[Killed] LogicalOperator
src/persistence.ts:434:22
   // reflects the current memIndex tokens, so when it does run the dirty flag is
   // satisfied — clear it either way so a subsequent (theoretical) same-process
   // save doesn't carry a stale "tokens changed" into an unneeded rebuild.
-  const needRecalc = dirtyTokens || idfWasQueued;
+  const needRecalc = dirtyTokens && idfWasQueued;
   dirtyTokens = false;
   // Isolate the two writes: if saveNow throws (transient I/O), recalcIdfNow
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/persistence.ts:434:22
   // reflects the current memIndex tokens, so when it does run the dirty flag is
   // satisfied — clear it either way so a subsequent (theoretical) same-process
   // save doesn't carry a stale "tokens changed" into an unneeded rebuild.
-  const needRecalc = dirtyTokens || idfWasQueued;
+  const needRecalc = false;
   dirtyTokens = false;
   // Isolate the two writes: if saveNow throws (transient I/O), recalcIdfNow
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/persistence.ts:435:17
   // satisfied — clear it either way so a subsequent (theoretical) same-process
   // save doesn't carry a stale "tokens changed" into an unneeded rebuild.
   const needRecalc = dirtyTokens || idfWasQueued;
-  dirtyTokens = false;
+  dirtyTokens = true;
   // Isolate the two writes: if saveNow throws (transient I/O), recalcIdfNow
   // must still run, and the throw must not propagate out of the SIGTERM/SIGINT

[NoCoverage] BlockStatement
src/persistence.ts:443:100
   // and-braces catch guards anything atomicWrite doesn't (e.g. a throw inside
   // rebuildInvertedIndex/buildIndexCache). Log to stderr + record; both writes
   // are best-effort and reconcileIndex rebuilds on next boot.
-  try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
+  try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try {} catch { /* stderr closed */ } }
   if (needRecalc) {
     try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }

[Survived] BlockStatement
src/persistence.ts:443:7
   // and-braces catch guards anything atomicWrite doesn't (e.g. a throw inside
   // rebuildInvertedIndex/buildIndexCache). Log to stderr + record; both writes
   // are best-effort and reconcileIndex rebuilds on next boot.
-  try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
+  try {} catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
   if (needRecalc) {
     try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }

[Killed] BlockStatement
src/persistence.ts:444:19
   // rebuildInvertedIndex/buildIndexCache). Log to stderr + record; both writes
   // are best-effort and reconcileIndex rebuilds on next boot.
   try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
-  if (needRecalc) {
-    try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }
-  }
+  if (needRecalc) {}
 }
 
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/persistence.ts:444:7
   // rebuildInvertedIndex/buildIndexCache). Log to stderr + record; both writes
   // are best-effort and reconcileIndex rebuilds on next boot.
   try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
-  if (needRecalc) {
+  if (true) {
     try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }
   }
killedBy: flushPending read-only recalc gate (#4) skips rebuildInvertedIndex on a scheduleAccessSave-only exit
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Killed] BlockStatement
src/persistence.ts:445:9
   // are best-effort and reconcileIndex rebuilds on next boot.
   try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
   if (needRecalc) {
-    try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }
+    try {} catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }
   }
 }
killedBy: flushPending read-only recalc gate (#4) still runs rebuildInvertedIndex when tokens changed (scheduleSave)
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/persistence.ts:445:112
   // are best-effort and reconcileIndex rebuilds on next boot.
   try { saveNow(); } catch (e) { recordError(`flushPending saveNow: ${(e as Error).message}`); try { console.error('flushPending saveNow:', e); } catch { /* stderr closed */ } }
   if (needRecalc) {
-    try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try { console.error('flushPending recalcIdfNow:', e); } catch { /* stderr closed */ } }
+    try { recalcIdfNow(); } catch (e) { recordError(`flushPending recalcIdfNow: ${(e as Error).message}`); try {} catch { /* stderr closed */ } }
   }
 }

[Killed] BlockStatement
src/persistence.ts:451:35
 
 // ─── Index cache (shell-readable) ────────────────────────────────────────────
 
-export function buildIndexCache() {
-  const entries = Object.values(memIndex);
-  const lines = [`${entries.length}`];
-  for (const m of entries) {
-    const shortTitle = m.title.slice(0, 40);
-    const tags = m.tags.slice(0, 3).join(', ') + (m.tags.length > 3 ? ', ...' : '');
-    lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);
-  }
-  ensureDir(path.dirname(INDEX_CACHE_PATH));
-  atomicWrite(INDEX_CACHE_PATH, lines.join('\n'));
-}
+export function buildIndexCache() {}
killedBy: buildIndexCache — shell-readable index cache does not throw when atomicWrite fails (records error, best-effort)
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/persistence.ts:453:17
 
 export function buildIndexCache() {
   const entries = Object.values(memIndex);
-  const lines = [`${entries.length}`];
+  const lines = [];
   for (const m of entries) {
     const shortTitle = m.title.slice(0, 40);

[Survived] BlockStatement
src/persistence.ts:454:28
 export function buildIndexCache() {
   const entries = Object.values(memIndex);
   const lines = [`${entries.length}`];
-  for (const m of entries) {
-    const shortTitle = m.title.slice(0, 40);
-    const tags = m.tags.slice(0, 3).join(', ') + (m.tags.length > 3 ? ', ...' : '');
-    lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);
-  }
+  for (const m of entries) {}
   ensureDir(path.dirname(INDEX_CACHE_PATH));
   atomicWrite(INDEX_CACHE_PATH, lines.join('\n'));
