[Survived] MethodExpression
src/persistence.ts:455:24
   const entries = Object.values(memIndex);
   const lines = [`${entries.length}`];
   for (const m of entries) {
-    const shortTitle = m.title.slice(0, 40);
+    const shortTitle = m.title;
     const tags = m.tags.slice(0, 3).join(', ') + (m.tags.length > 3 ? ', ...' : '');
     lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);

[Survived] ArithmeticOperator
src/persistence.ts:456:18
   const lines = [`${entries.length}`];
   for (const m of entries) {
     const shortTitle = m.title.slice(0, 40);
-    const tags = m.tags.slice(0, 3).join(', ') + (m.tags.length > 3 ? ', ...' : '');
+    const tags = m.tags.slice(0, 3).join(', ') - (m.tags.length > 3 ? ', ...' : '');
     lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);
   }

[Survived] ConditionalExpression
src/persistence.ts:456:51
   const lines = [`${entries.length}`];
   for (const m of entries) {
     const shortTitle = m.title.slice(0, 40);
-    const tags = m.tags.slice(0, 3).join(', ') + (m.tags.length > 3 ? ', ...' : '');
+    const tags = m.tags.slice(0, 3).join(', ') + (false ? ', ...' : '');
     lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);
   }

[Survived] StringLiteral
src/persistence.ts:460:44
     lines.push(`- ${m.key}: ${shortTitle} [${tags}] (${m.category})`);
   }
   ensureDir(path.dirname(INDEX_CACHE_PATH));
-  atomicWrite(INDEX_CACHE_PATH, lines.join('\n'));
+  atomicWrite(INDEX_CACHE_PATH, lines.join(""));
 }
