[Killed] BlockStatement
src/tfidf.ts:59:50
 };
 // Stryker restore all
 
-export function tokenize(text: string): string[] {
-  // Preserve Romanian diacritics by normalizing to NFKD and stripping combining
-  // marks, rather than replacing every non-ASCII character with a space. This
-  // turns "întâlnire" into "intalnire" so it matches the bilingual dictionary
-  // entries and keeps the base letters, instead of mangling it to "ntlnire".
-  return text
-    .toLowerCase()
-    .normalize('NFKD')
-    .replace(/[̀-ͯ]/g, '')
-    .replace(/[^a-z0-9 ]/g, ' ')
-    .split(/\s+/)
-    .filter(Boolean);
-}
+export function tokenize(text: string): string[] {}
 
 export function deregisterDocument(key: string) {
killedBy: loadIndexes drops invertedIndex.json load (#18) loadIndexes does not populate invertedIndex from disk
statusReason: expected [Function] to not throw an error but 'TypeError: tokens is not iterable' was thrown

[Killed] MethodExpression
src/tfidf.ts:64:10
   // marks, rather than replacing every non-ASCII character with a space. This
   // turns "întâlnire" into "intalnire" so it matches the bilingual dictionary
   // entries and keeps the base letters, instead of mangling it to "ntlnire".
-  return text
-    .toLowerCase()
+  return text.toUpperCase()
     .normalize('NFKD')
     .replace(/[̀-ͯ]/g, '')
killedBy: loadIndexes drops invertedIndex.json load (#18) loadIndexes does not populate invertedIndex from disk
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/tfidf.ts:64:10
   // marks, rather than replacing every non-ASCII character with a space. This
   // turns "întâlnire" into "intalnire" so it matches the bilingual dictionary
   // entries and keeps the base letters, instead of mangling it to "ntlnire".
-  return text
-    .toLowerCase()
-    .normalize('NFKD')
-    .replace(/[̀-ͯ]/g, '')
-    .replace(/[^a-z0-9 ]/g, ' ')
-    .split(/\s+/)
-    .filter(Boolean);
+  return text.toLowerCase().normalize('NFKD').replace(/[̀-ͯ]/g, '').replace(/[^a-z0-9 ]/g, ' ').split(/\s+/);
 }
 
killedBy: tokenize whitespace + diacritic edge cases collapses runs of whitespace into single token boundaries
statusReason: expected [ '', '' ] to deeply equal []

[Killed] StringLiteral
src/tfidf.ts:66:16
   // entries and keeps the base letters, instead of mangling it to "ntlnire".
   return text
     .toLowerCase()
-    .normalize('NFKD')
+    .normalize("")
     .replace(/[̀-ͯ]/g, '')
     .replace(/[^a-z0-9 ]/g, ' ')
killedBy: loadIndexes drops invertedIndex.json load (#18) loadIndexes does not populate invertedIndex from disk
statusReason: expected [Function] to not throw an error but 'RangeError: The normalization form sh…' was thrown

[Killed] StringLiteral
src/tfidf.ts:67:24
   return text
     .toLowerCase()
     .normalize('NFKD')
-    .replace(/[̀-ͯ]/g, '')
+    .replace(/[̀-ͯ]/g, "Stryker was here!")
     .replace(/[^a-z0-9 ]/g, ' ')
     .split(/\s+/)
killedBy: tokenize diacritic normalization (Pass 1 hardening) strips combining marks but keeps the base Romanian letters
statusReason: expected [ 'i', 'tryker', 'was', 'here', …(5) ] to include 'intalnire'

[Killed] Regex
src/tfidf.ts:67:14
   return text
     .toLowerCase()
     .normalize('NFKD')
-    .replace(/[̀-ͯ]/g, '')
+    .replace(/[^̀-ͯ]/g, '')
     .replace(/[^a-z0-9 ]/g, ' ')
     .split(/\s+/)
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: expected false to be true // Object.is equality

[Killed] Regex
src/tfidf.ts:69:12
     .normalize('NFKD')
     .replace(/[̀-ͯ]/g, '')
     .replace(/[^a-z0-9 ]/g, ' ')
-    .split(/\s+/)
+    .split(/\S+/)
     .filter(Boolean);
 }
killedBy: tfidfSearch per-token toLowerCase memoization (#5) produces the same boosted score regardless of memoization (algebraically identical)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/tfidf.ts:73:49
     .filter(Boolean);
 }
 
-export function deregisterDocument(key: string) {
-  for (const t of Object.keys(invertedIndex)) {
-    const entry = invertedIndex[t];
-    if (entry) {
-      entry.docs = entry.docs.filter(d => d.key !== key);
-      if (entry.docs.length === 0) {
-        delete invertedIndex[t];
-      }
-    }
-  }
-  // 5.2: drop the length norm when the doc leaves the index so a re-register
-  // (different text) replaces it rather than reading a stale norm.
-  docLengths.delete(key);
-}
+export function deregisterDocument(key: string) {}
 
 export function registerDocument(key: string, title: string, tags: string[], contentPreview: string) {
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [ { …(2) } ], …(1) } to be undefined

[Killed] BlockStatement
src/tfidf.ts:74:47
 }
 
 export function deregisterDocument(key: string) {
-  for (const t of Object.keys(invertedIndex)) {
-    const entry = invertedIndex[t];
-    if (entry) {
-      entry.docs = entry.docs.filter(d => d.key !== key);
-      if (entry.docs.length === 0) {
-        delete invertedIndex[t];
-      }
-    }
-  }
+  for (const t of Object.keys(invertedIndex)) {}
   // 5.2: drop the length norm when the doc leaves the index so a re-register
   // (different text) replaces it rather than reading a stale norm.
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [ { …(2) } ], …(1) } to be undefined

[Killed] ConditionalExpression
src/tfidf.ts:76:9
 export function deregisterDocument(key: string) {
   for (const t of Object.keys(invertedIndex)) {
     const entry = invertedIndex[t];
-    if (entry) {
+    if (false) {
       entry.docs = entry.docs.filter(d => d.key !== key);
       if (entry.docs.length === 0) {
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [ { …(2) } ], …(1) } to be undefined

[Killed] BlockStatement
src/tfidf.ts:76:16
 export function deregisterDocument(key: string) {
   for (const t of Object.keys(invertedIndex)) {
     const entry = invertedIndex[t];
-    if (entry) {
-      entry.docs = entry.docs.filter(d => d.key !== key);
-      if (entry.docs.length === 0) {
-        delete invertedIndex[t];
-      }
-    }
+    if (entry) {}
   }
   // 5.2: drop the length norm when the doc leaves the index so a re-register
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [ { …(2) } ], …(1) } to be undefined

[Killed] MethodExpression
src/tfidf.ts:77:20
   for (const t of Object.keys(invertedIndex)) {
     const entry = invertedIndex[t];
     if (entry) {
-      entry.docs = entry.docs.filter(d => d.key !== key);
+      entry.docs = entry.docs;
       if (entry.docs.length === 0) {
         delete invertedIndex[t];
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [ { …(2) } ], …(1) } to be undefined

[Killed] ConditionalExpression
src/tfidf.ts:77:43
   for (const t of Object.keys(invertedIndex)) {
     const entry = invertedIndex[t];
     if (entry) {
-      entry.docs = entry.docs.filter(d => d.key !== key);
+      entry.docs = entry.docs.filter(d => false);
       if (entry.docs.length === 0) {
         delete invertedIndex[t];
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument keeps other docs sharing a token
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/tfidf.ts:78:11
     const entry = invertedIndex[t];
     if (entry) {
       entry.docs = entry.docs.filter(d => d.key !== key);
-      if (entry.docs.length === 0) {
+      if (false) {
         delete invertedIndex[t];
       }
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument removes all of the doc postings
statusReason: expected { docs: [], idf: 1.4054651081081644 } to be undefined

[Killed] ConditionalExpression
src/tfidf.ts:78:11
     const entry = invertedIndex[t];
     if (entry) {
       entry.docs = entry.docs.filter(d => d.key !== key);
-      if (entry.docs.length === 0) {
+      if (true) {
         delete invertedIndex[t];
       }
killedBy: registerDocument / deregisterDocument (incremental index update) deregisterDocument keeps other docs sharing a token
statusReason: expected 1 to be 2 // Object.is equality

[Killed] StringLiteral
src/tfidf.ts:91:27
 export function registerDocument(key: string, title: string, tags: string[], contentPreview: string) {
   deregisterDocument(key);
 
-  const tokens = tokenize(`${title} ${tags.join(' ')} ${contentPreview}`);
+  const tokens = tokenize(``);
   const tf: Record<string, number> = {};
   for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
killedBy: registerDocument / deregisterDocument (incremental index update) registerDocument populates the inverted index and docLengths (ranked by tfidfSearch)
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/tfidf.ts:91:49
 export function registerDocument(key: string, title: string, tags: string[], contentPreview: string) {
   deregisterDocument(key);
 
-  const tokens = tokenize(`${title} ${tags.join(' ')} ${contentPreview}`);
+  const tokens = tokenize(`${title} ${tags.join("")} ${contentPreview}`);
   const tf: Record<string, number> = {};
   for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;

[Survived] LogicalOperator
src/tfidf.ts:93:36
 
   const tokens = tokenize(`${title} ${tags.join(' ')} ${contentPreview}`);
   const tf: Record<string, number> = {};
-  for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
+  for (const t of tokens) tf[t] = (tf[t] && 0) + 1;
 
   for (const [t, count] of Object.entries(tf)) {

[Survived] ArithmeticOperator
src/tfidf.ts:93:35
 
   const tokens = tokenize(`${title} ${tags.join(' ')} ${contentPreview}`);
   const tf: Record<string, number> = {};
-  for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
+  for (const t of tokens) tf[t] = (tf[t] ?? 0) - 1;
 
   for (const [t, count] of Object.entries(tf)) {

[Killed] BlockStatement
src/tfidf.ts:95:48
   const tf: Record<string, number> = {};
   for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
 
-  for (const [t, count] of Object.entries(tf)) {
-    if (!invertedIndex[t]) {
-      invertedIndex[t] = { docs: [], idf: 0 };
-    }
-    invertedIndex[t]!.docs.push({ key, tf: count });
-  }
+  for (const [t, count] of Object.entries(tf)) {}
 
   // 5.2: cache sqrt(totalTokens) for this doc — the length norm used at score
killedBy: registerDocument / deregisterDocument (incremental index update) registerDocument populates the inverted index and docLengths (ranked by tfidfSearch)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/tfidf.ts:96:28
   for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
 
   for (const [t, count] of Object.entries(tf)) {
-    if (!invertedIndex[t]) {
-      invertedIndex[t] = { docs: [], idf: 0 };
-    }
+    if (!invertedIndex[t]) {}
     invertedIndex[t]!.docs.push({ key, tf: count });
   }
killedBy: registerDocument / deregisterDocument (incremental index update) registerDocument populates the inverted index and docLengths (ranked by tfidfSearch)
statusReason: Cannot read properties of undefined (reading 'docs')

[Killed] BooleanLiteral
src/tfidf.ts:96:9
   for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
 
   for (const [t, count] of Object.entries(tf)) {
-    if (!invertedIndex[t]) {
+    if (invertedIndex[t]) {
       invertedIndex[t] = { docs: [], idf: 0 };
     }
killedBy: registerDocument / deregisterDocument (incremental index update) registerDocument populates the inverted index and docLengths (ranked by tfidfSearch)
statusReason: Cannot read properties of undefined (reading 'docs')

[Survived] AssignmentOperator
src/tfidf.ts:106:38
   // time. totalTokens is the sum of the per-term tf counts (total token
   // occurrences in the indexed text), not the unique-term count.
   let totalTokens = 0;
-  for (const c of Object.values(tf)) totalTokens += c;
+  for (const c of Object.values(tf)) totalTokens -= c;
   docLengths.set(key, Math.sqrt(totalTokens));
 

[Survived] BlockStatement
src/tfidf.ts:111:47
 
   // Recalculate IDFs for all active terms
   const N = Object.keys(memIndex).length;
-  for (const t of Object.keys(invertedIndex)) {
-    invertedIndex[t]!.idf = Math.log((N + 1) / (invertedIndex[t]!.docs.length + 1)) + 1;
-  }
+  for (const t of Object.keys(invertedIndex)) {}
 }
 

[Survived] ArithmeticOperator
src/tfidf.ts:112:39
   // Recalculate IDFs for all active terms
   const N = Object.keys(memIndex).length;
   for (const t of Object.keys(invertedIndex)) {
-    invertedIndex[t]!.idf = Math.log((N + 1) / (invertedIndex[t]!.docs.length + 1)) + 1;
+    invertedIndex[t]!.idf = Math.log((N - 1) / (invertedIndex[t]!.docs.length + 1)) + 1;
   }
 }

[Survived] ArithmeticOperator
src/tfidf.ts:112:49
   // Recalculate IDFs for all active terms
   const N = Object.keys(memIndex).length;
   for (const t of Object.keys(invertedIndex)) {
-    invertedIndex[t]!.idf = Math.log((N + 1) / (invertedIndex[t]!.docs.length + 1)) + 1;
+    invertedIndex[t]!.idf = Math.log((N + 1) / (invertedIndex[t]!.docs.length - 1)) + 1;
   }
 }

[Killed] BlockStatement
src/tfidf.ts:121:55
   const tfByDoc: Record<string, Record<string, number>> = {};
   const N = Object.keys(memIndex).length;
 
-  for (const [key, meta] of Object.entries(memIndex)) {
-    const tokens = tokenize(`${meta.title} ${meta.tags.join(' ')} ${meta.contentPreview}`);
-    const tf: Record<string, number> = {};
-    for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
-    tfByDoc[key] = tf;
-    for (const t of Object.keys(tf)) {
-      docFreq[t] = (docFreq[t] ?? 0) + 1;
-    }
-  }
+  for (const [key, meta] of Object.entries(memIndex)) {}
 
   // Clear-then-populate the shared singleton (formerly `invertedIndex = {}`).
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/tfidf.ts:126:38
     const tf: Record<string, number> = {};
     for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
     tfByDoc[key] = tf;
-    for (const t of Object.keys(tf)) {
-      docFreq[t] = (docFreq[t] ?? 0) + 1;
-    }
+    for (const t of Object.keys(tf)) {}
   }
 
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected NaN to be close to NaN, received difference is NaN, but expected 5e-7

[Killed] LogicalOperator
src/tfidf.ts:127:21
     for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
     tfByDoc[key] = tf;
     for (const t of Object.keys(tf)) {
-      docFreq[t] = (docFreq[t] ?? 0) + 1;
+      docFreq[t] = (docFreq[t] && 0) + 1;
     }
   }
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected NaN to be close to NaN, received difference is NaN, but expected 5e-7

[Killed] ArithmeticOperator
src/tfidf.ts:127:20
     for (const t of tokens) tf[t] = (tf[t] ?? 0) + 1;
     tfByDoc[key] = tf;
     for (const t of Object.keys(tf)) {
-      docFreq[t] = (docFreq[t] ?? 0) + 1;
+      docFreq[t] = (docFreq[t] ?? 0) - 1;
     }
   }
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected NaN to be close to NaN, received difference is NaN, but expected 5e-7

[Killed] BlockStatement
src/tfidf.ts:135:52
   for (const t of Object.keys(invertedIndex)) delete invertedIndex[t];
   // 5.2: rebuild the per-doc length-norm cache alongside the inverted index.
   docLengths.clear();
-  for (const [key, tf] of Object.entries(tfByDoc)) {
-    let totalTokens = 0;
-    for (const [t, count] of Object.entries(tf)) {
-      // Store the precomputed tf per (term, doc) so tfidfSearch never has to
-      // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
-      if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
-      invertedIndex[t].docs.push({ key, tf: count });
-      totalTokens += count;
-    }
-    docLengths.set(key, Math.sqrt(totalTokens));
-  }
+  for (const [key, tf] of Object.entries(tfByDoc)) {}
   for (const t of Object.keys(invertedIndex)) {
     // invertedIndex[t] was just iterated from the same object above, so it
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/tfidf.ts:137:50
   docLengths.clear();
   for (const [key, tf] of Object.entries(tfByDoc)) {
     let totalTokens = 0;
-    for (const [t, count] of Object.entries(tf)) {
-      // Store the precomputed tf per (term, doc) so tfidfSearch never has to
-      // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
-      if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
-      invertedIndex[t].docs.push({ key, tf: count });
-      totalTokens += count;
-    }
+    for (const [t, count] of Object.entries(tf)) {}
     docLengths.set(key, Math.sqrt(totalTokens));
   }
killedBy: 5.1: title boost is exact-token, not substring does NOT boost "Category theory" for query "cat" (substring was a false match)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/tfidf.ts:140:11
     for (const [t, count] of Object.entries(tf)) {
       // Store the precomputed tf per (term, doc) so tfidfSearch never has to
       // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
-      if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
+      if (false) invertedIndex[t] = { docs: [], idf: 0 };
       invertedIndex[t].docs.push({ key, tf: count });
       totalTokens += count;
killedBy: recall_memory boundary hardening coerces a non-string query to string instead of throwing
statusReason: Cannot read properties of undefined (reading 'docs')

[Killed] BooleanLiteral
src/tfidf.ts:140:11
     for (const [t, count] of Object.entries(tf)) {
       // Store the precomputed tf per (term, doc) so tfidfSearch never has to
       // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
-      if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
+      if (invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
       invertedIndex[t].docs.push({ key, tf: count });
       totalTokens += count;
killedBy: recall_memory boundary hardening coerces a non-string query to string instead of throwing
statusReason: Cannot read properties of undefined (reading 'docs')

[Killed] ObjectLiteral
src/tfidf.ts:141:34
       // Store the precomputed tf per (term, doc) so tfidfSearch never has to
       // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
       if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
-      invertedIndex[t].docs.push({ key, tf: count });
+      invertedIndex[t].docs.push({});
       totalTokens += count;
     }
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Killed] AssignmentOperator
src/tfidf.ts:142:7
       // re-tokenize the document body to score it (the prior O(Q·D·L) hot path).
       if (!invertedIndex[t]) invertedIndex[t] = { docs: [], idf: 0 };
       invertedIndex[t].docs.push({ key, tf: count });
-      totalTokens += count;
+      totalTokens -= count;
     }
     docLengths.set(key, Math.sqrt(totalTokens));
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected 0.12648998280638507 to be greater than 0.2467262955198539

[Killed] BlockStatement
src/tfidf.ts:146:47
     }
     docLengths.set(key, Math.sqrt(totalTokens));
   }
-  for (const t of Object.keys(invertedIndex)) {
-    // invertedIndex[t] was just iterated from the same object above, so it
-    // is guaranteed present here.
-    invertedIndex[t]!.idf = Math.log((N + 1) / (docFreq[t]! + 1)) + 1;
-  }
+  for (const t of Object.keys(invertedIndex)) {}
 }
 
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/tfidf.ts:149:39
   for (const t of Object.keys(invertedIndex)) {
     // invertedIndex[t] was just iterated from the same object above, so it
     // is guaranteed present here.
-    invertedIndex[t]!.idf = Math.log((N + 1) / (docFreq[t]! + 1)) + 1;
+    invertedIndex[t]!.idf = Math.log((N - 1) / (docFreq[t]! + 1)) + 1;
   }
 }
killedBy: recall_memory hybrid — RRF empty-vector guard (3.6) keeps the TF-IDF score scale when the vector path returns empty (no RRF rescaling)
statusReason: expected NaN to be greater than 0.3

[Killed] ArithmeticOperator
src/tfidf.ts:149:29
   for (const t of Object.keys(invertedIndex)) {
     // invertedIndex[t] was just iterated from the same object above, so it
     // is guaranteed present here.
-    invertedIndex[t]!.idf = Math.log((N + 1) / (docFreq[t]! + 1)) + 1;
+    invertedIndex[t]!.idf = Math.log((N + 1) / (docFreq[t]! + 1)) - 1;
   }
 }
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected -0.04947731979512183 to be greater than -0.04315990380468991

[NoCoverage] BooleanLiteral
src/tfidf.ts:153:61
   }
 }
 
-export function tfidfSearch(query: string, excludeJournal = true): Array<{ key: string; score: number }> {
+export function tfidfSearch(query: string, excludeJournal = false): Array<{ key: string; score: number }> {
   const config = loadConfig();
   let tokens = tokenize(query);

[Killed] ConditionalExpression
src/tfidf.ts:191:9
 
   for (const token of tokens) {
     const entry = invertedIndex[token];
-    if (!entry) continue;
+    if (true) continue;
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/tfidf.ts:191:9
 
   for (const token of tokens) {
     const entry = invertedIndex[token];
-    if (!entry) continue;
+    if (entry) continue;
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
killedBy: recall_memory boundary hardening coerces a non-string query to string instead of throwing
statusReason: Cannot read properties of undefined (reading 'docs')

[Killed] BlockStatement
src/tfidf.ts:192:35
   for (const token of tokens) {
     const entry = invertedIndex[token];
     if (!entry) continue;
-    for (const doc of entry.docs) {
-      const meta = memIndex[doc.key];
-      if (!meta) continue;
-      if (excludeJournal && meta.category === 'journal') continue;
-      // tf is precomputed in rebuildInvertedIndex over title + tags + contentPreview,
-      // so a tag-only match retains its tf here (no re-tokenization, no silent drop).
-      // 5.2: sublinear TF (1 + log tf) biases against verbose memories — a doc that
-      // repeats a term 10× contributes 1+log(10)≈3.3, not 10. tf≥1 for every indexed
-      // (term, doc) so log is ≥0; the +1 keeps a single-occurrence term at weight 1.
-      let score = (1 + Math.log(doc.tf)) * entry.idf;
-      let cached = tokenCache.get(doc.key);
-      if (!cached) {
-        cached = {
-          titleTokens: new Set(tokenize(meta.title)),
-          tagTokens: new Set(meta.tags.flatMap(t => tokenize(t))),
-        };
-        tokenCache.set(doc.key, cached);
-      }
-      // 5.1: exact token-match boost (was substring .includes). 'cat' no longer
-      // boosts a doc titled 'Category theory' — only an exact token counts.
-      if (cached.titleTokens.has(token)) score *= 2;
-      if (cached.tagTokens.has(token)) score *= 1.5;
-      rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
-    }
+    for (const doc of entry.docs) {}
   }
 
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/tfidf.ts:194:11
     if (!entry) continue;
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
-      if (!meta) continue;
+      if (meta) continue;
       if (excludeJournal && meta.category === 'journal') continue;
       // tf is precomputed in rebuildInvertedIndex over title + tags + contentPreview,
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/tfidf.ts:194:11
     if (!entry) continue;
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
-      if (!meta) continue;
+      if (false) continue;
       if (excludeJournal && meta.category === 'journal') continue;
       // tf is precomputed in rebuildInvertedIndex over title + tags + contentPreview,
killedBy: searchIndex tags filter — missing entry guard does not crash when a result key has no memIndex entry
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/tfidf.ts:195:29
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
       if (!meta) continue;
-      if (excludeJournal && meta.category === 'journal') continue;
+      if (excludeJournal && true) continue;
       // tf is precomputed in rebuildInvertedIndex over title + tags + contentPreview,
       // so a tag-only match retains its tf here (no re-tokenization, no silent drop).
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/tfidf.ts:195:11
     for (const doc of entry.docs) {
       const meta = memIndex[doc.key];
       if (!meta) continue;
-      if (excludeJournal && meta.category === 'journal') continue;
+      if (excludeJournal || meta.category === 'journal') continue;
       // tf is precomputed in rebuildInvertedIndex over title + tags + contentPreview,
       // so a tag-only match retains its tf here (no re-tokenization, no silent drop).
killedBy: recall_memory boundary hardening clamps a malformed minScore to 0 (no filtering)
statusReason: expected 0 to be greater than 0

[Survived] ArithmeticOperator
src/tfidf.ts:201:19
       // 5.2: sublinear TF (1 + log tf) biases against verbose memories — a doc that
       // repeats a term 10× contributes 1+log(10)≈3.3, not 10. tf≥1 for every indexed
       // (term, doc) so log is ≥0; the +1 keeps a single-occurrence term at weight 1.
-      let score = (1 + Math.log(doc.tf)) * entry.idf;
+      let score = (1 + Math.log(doc.tf)) / entry.idf;
       let cached = tokenCache.get(doc.key);
       if (!cached) {

[Survived] ArithmeticOperator
src/tfidf.ts:201:20
       // 5.2: sublinear TF (1 + log tf) biases against verbose memories — a doc that
       // repeats a term 10× contributes 1+log(10)≈3.3, not 10. tf≥1 for every indexed
       // (term, doc) so log is ≥0; the +1 keeps a single-occurrence term at weight 1.
-      let score = (1 + Math.log(doc.tf)) * entry.idf;
+      let score = (1 - Math.log(doc.tf)) * entry.idf;
       let cached = tokenCache.get(doc.key);
       if (!cached) {

[Killed] BooleanLiteral
src/tfidf.ts:203:11
       // (term, doc) so log is ≥0; the +1 keeps a single-occurrence term at weight 1.
       let score = (1 + Math.log(doc.tf)) * entry.idf;
       let cached = tokenCache.get(doc.key);
-      if (!cached) {
+      if (cached) {
         cached = {
           titleTokens: new Set(tokenize(meta.title)),
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: Cannot read properties of undefined (reading 'titleTokens')

[Killed] ConditionalExpression
src/tfidf.ts:203:11
       // (term, doc) so log is ≥0; the +1 keeps a single-occurrence term at weight 1.
       let score = (1 + Math.log(doc.tf)) * entry.idf;
       let cached = tokenCache.get(doc.key);
-      if (!cached) {
+      if (false) {
         cached = {
           titleTokens: new Set(tokenize(meta.title)),
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: Cannot read properties of undefined (reading 'titleTokens')

[Killed] ArrowFunction
src/tfidf.ts:206:48
       if (!cached) {
         cached = {
           titleTokens: new Set(tokenize(meta.title)),
-          tagTokens: new Set(meta.tags.flatMap(t => tokenize(t))),
+          tagTokens: new Set(meta.tags.flatMap(() => undefined)),
         };
         tokenCache.set(doc.key, cached);
killedBy: exact title/tag boost scores (×2 / ×1.5) a title-token doc outscores a tag-token doc outscores a content-only doc
statusReason: expected 0.020487859276382792 to be greater than 0.020487859276382792
