[Killed] AssignmentOperator
src/tfidf.ts:212:42
       }
       // 5.1: exact token-match boost (was substring .includes). 'cat' no longer
       // boosts a doc titled 'Category theory' — only an exact token counts.
-      if (cached.titleTokens.has(token)) score *= 2;
+      if (cached.titleTokens.has(token)) score /= 2;
       if (cached.tagTokens.has(token)) score *= 1.5;
       rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
killedBy: exact title/tag boost scores (×2 / ×1.5) a title-token doc outscores a tag-token doc outscores a content-only doc
statusReason: expected 0.010243923765006751 to be greater than 0.03073177129502025

[Killed] ConditionalExpression
src/tfidf.ts:212:11
       }
       // 5.1: exact token-match boost (was substring .includes). 'cat' no longer
       // boosts a doc titled 'Category theory' — only an exact token counts.
-      if (cached.titleTokens.has(token)) score *= 2;
+      if (false) score *= 2;
       if (cached.tagTokens.has(token)) score *= 1.5;
       rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
killedBy: exact title/tag boost scores (×2 / ×1.5) a title-token doc outscores a tag-token doc outscores a content-only doc
statusReason: expected 0.02048784850887736 to be greater than 0.030731772763316036

[Killed] ConditionalExpression
src/tfidf.ts:213:11
       // 5.1: exact token-match boost (was substring .includes). 'cat' no longer
       // boosts a doc titled 'Category theory' — only an exact token counts.
       if (cached.titleTokens.has(token)) score *= 2;
-      if (cached.tagTokens.has(token)) score *= 1.5;
+      if (false) score *= 1.5;
       rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
     }
killedBy: exact title/tag boost scores (×2 / ×1.5) a title-token doc outscores a tag-token doc outscores a content-only doc
statusReason: expected 0.02048783730885657 to be greater than 0.02048783730885657

[Killed] AssignmentOperator
src/tfidf.ts:213:40
       // 5.1: exact token-match boost (was substring .includes). 'cat' no longer
       // boosts a doc titled 'Category theory' — only an exact token counts.
       if (cached.titleTokens.has(token)) score *= 2;
-      if (cached.tagTokens.has(token)) score *= 1.5;
+      if (cached.tagTokens.has(token)) score /= 1.5;
       rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
     }
killedBy: exact title/tag boost scores (×2 / ×1.5) a title-token doc outscores a tag-token doc outscores a content-only doc
statusReason: expected 0.013658552833539206 to be greater than 0.02048782925030881

[Killed] ArithmeticOperator
src/tfidf.ts:214:28
       // boosts a doc titled 'Category theory' — only an exact token counts.
       if (cached.titleTokens.has(token)) score *= 2;
       if (cached.tagTokens.has(token)) score *= 1.5;
-      rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
+      rawScores[doc.key] = (rawScores[doc.key] ?? 0) - score;
     }
   }
killedBy: tfidfSearch per-token toLowerCase memoization (#5) produces the same boosted score regardless of memoization (algebraically identical)
statusReason: expected -0.013761646234411872 to be greater than 0

[Killed] LogicalOperator
src/tfidf.ts:214:29
       // boosts a doc titled 'Category theory' — only an exact token counts.
       if (cached.titleTokens.has(token)) score *= 2;
       if (cached.tagTokens.has(token)) score *= 1.5;
-      rawScores[doc.key] = (rawScores[doc.key] ?? 0) + score;
+      rawScores[doc.key] = (rawScores[doc.key] && 0) + score;
     }
   }
killedBy: tfidfSearch per-token toLowerCase memoization (#5) produces the same boosted score regardless of memoization (algebraically identical)
statusReason: expected NaN to be greater than 0

[Killed] BlockStatement
src/tfidf.ts:227:45
   // promises exactly that. computeRetentionStrength's Number.isFinite guards
   // map undefined (legacy index entries) to 0.
   const scores: Array<{ key: string; score: number }> = [];
-  for (const key of Object.keys(rawScores)) {
-    const meta = memIndex[key]!;
-    const decay = computeRetentionStrength(
-      meta.importanceScore,
-      daysSince(meta.lastAccessed || meta.updated),
-      meta.accessCount,
-      meta.confirmations,
-      meta.flags,
-    );
-    // 5.2: divide by the per-doc length norm sqrt(totalTokens) so a verbose
-    // memory's higher raw score (more term occurrences) doesn't dominate a
-    // concise one matching the same terms. norm ≥ sqrt(1) > 0 always; the
-    // `|| 1` guards a doc present in the index but missing from docLengths
-    // (shouldn't happen, but a divide-by-zero would nuke the whole result).
-    const norm = docLengths.get(key) || 1;
-    scores.push({ key, score: (rawScores[key]! / norm) * decay });
-  }
+  for (const key of Object.keys(rawScores)) {}
 
   // #23: full sort, not partial top-K selection. Two reasons this is intentional:
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/tfidf.ts:231:17
     const meta = memIndex[key]!;
     const decay = computeRetentionStrength(
       meta.importanceScore,
-      daysSince(meta.lastAccessed || meta.updated),
+      daysSince(meta.lastAccessed && meta.updated),
       meta.accessCount,
       meta.confirmations,
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: Cannot read properties of null (reading 'getTime')

[Killed] ConditionalExpression
src/tfidf.ts:231:17
     const meta = memIndex[key]!;
     const decay = computeRetentionStrength(
       meta.importanceScore,
-      daysSince(meta.lastAccessed || meta.updated),
+      daysSince(true),
       meta.accessCount,
       meta.confirmations,
killedBy: tfidfSearch per-token toLowerCase memoization (#5) lowercases each doc title + tags once, not once per matching token
statusReason: d.getTime is not a function

[Killed] LogicalOperator
src/tfidf.ts:241:18
     // concise one matching the same terms. norm ≥ sqrt(1) > 0 always; the
     // `|| 1` guards a doc present in the index but missing from docLengths
     // (shouldn't happen, but a divide-by-zero would nuke the whole result).
-    const norm = docLengths.get(key) || 1;
+    const norm = docLengths.get(key) && 1;
     scores.push({ key, score: (rawScores[key]! / norm) * decay });
   }
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected 0.1265060754639698 to be greater than 0.24675768521335262

[Killed] ConditionalExpression
src/tfidf.ts:241:18
     // concise one matching the same terms. norm ≥ sqrt(1) > 0 always; the
     // `|| 1` guards a doc present in the index but missing from docLengths
     // (shouldn't happen, but a divide-by-zero would nuke the whole result).
-    const norm = docLengths.get(key) || 1;
+    const norm = true;
     scores.push({ key, score: (rawScores[key]! / norm) * decay });
   }
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected 0.12650613773308675 to be greater than 0.24675780667299874

[Killed] ArithmeticOperator
src/tfidf.ts:242:31
     // `|| 1` guards a doc present in the index but missing from docLengths
     // (shouldn't happen, but a divide-by-zero would nuke the whole result).
     const norm = docLengths.get(key) || 1;
-    scores.push({ key, score: (rawScores[key]! / norm) * decay });
+    scores.push({ key, score: rawScores[key]! / norm / decay });
   }
 
killedBy: 5.3: confirmations/flags affect search ranking, not just pruning ranks a confirmed memory above a flagged one with equal other inputs
statusReason: expected 70.85153784029207 to be greater than 151.824723943483

[Killed] ArithmeticOperator
src/tfidf.ts:242:32
     // `|| 1` guards a doc present in the index but missing from docLengths
     // (shouldn't happen, but a divide-by-zero would nuke the whole result).
     const norm = docLengths.get(key) || 1;
-    scores.push({ key, score: (rawScores[key]! / norm) * decay });
+    scores.push({ key, score: (rawScores[key]! * norm) * decay });
   }
 
killedBy: 5.2: sublinear TF + length norm — verbose does not dominate ranks a concise cat-titled doc above a verbose one repeating "cat" 9×
statusReason: expected 0.17890645358533902 to be greater than 0.7803156426192692

[Survived] ArrowFunction
src/tfidf.ts:259:22
   //      thousand memories and adds non-trivial ranking-correctness risk for a
   //      sub-ms win. Verified not actionable at personal scale; revisit only if
   //      vault size grows into the thousands.
-  return scores.sort((a, b) => b.score - a.score);
+  return scores.sort(() => undefined);
 }

[Survived] MethodExpression
src/tfidf.ts:259:10
   //      thousand memories and adds non-trivial ranking-correctness risk for a
   //      sub-ms win. Verified not actionable at personal scale; revisit only if
   //      vault size grows into the thousands.
-  return scores.sort((a, b) => b.score - a.score);
+  return scores;
 }
