[Killed] BlockStatement
src/vault-scan.ts:29:51
 // for the process — vault roots don't move — but is rebuilt if a root is seen
 // null then later exists (e.g. ensureDir created it between scans).
 const realBaseCache = new Map<string, string>();
-function realBaseFor(base: string): string | null {
-  // Cache ONLY a successful resolution. The prior form cached null permanently
-  // (realBaseCache.set(base, null) on a realpath throw), so a vault root whose
-  // FIRST realpathSync threw — a transient EACCES on a parent dir, the root
-  // vanishing mid-scan, or an FS that can't resolve it — was cached null for
-  // the entire process lifetime, and indexFile's `if (realBase === null) return`
-  // bailed on EVERY file in that vault forever. The header comment already
-  // promised "rebuilt if a root is seen null then later exists (e.g. ensureDir
-  // created it between scans)" — but the old code never rebuilt it (the `has`
-  // check returned the cached null without re-resolving). Re-resolve on every
-  // call while the value is null so a transient failure self-heals on the next
-  // scan; the common non-null success case still hits the cache (one realpath
-  // per root per process — `base` is one of two constants).
-  const cached = realBaseCache.get(base);
-  if (cached !== undefined) return cached;
-  let resolved: string | null;
-  try {
-    resolved = fs.realpathSync(base);
-  } catch {
-    resolved = null;
-  }
-  if (resolved !== null) realBaseCache.set(base, resolved);
-  return resolved;
-}
+function realBaseFor(base: string): string | null {}
 
 // Test seam: the realpath cache is module-level and persists across tests in a
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/vault-scan.ts:43:7
   // scan; the common non-null success case still hits the cache (one realpath
   // per root per process — `base` is one of two constants).
   const cached = realBaseCache.get(base);
-  if (cached !== undefined) return cached;
+  if (cached === undefined) return cached;
   let resolved: string | null;
   try {
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:43:7
   // scan; the common non-null success case still hits the cache (one realpath
   // per root per process — `base` is one of two constants).
   const cached = realBaseCache.get(base);
-  if (cached !== undefined) return cached;
+  if (true) return cached;
   let resolved: string | null;
   try {
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/vault-scan.ts:45:7
   const cached = realBaseCache.get(base);
   if (cached !== undefined) return cached;
   let resolved: string | null;
-  try {
-    resolved = fs.realpathSync(base);
-  } catch {
+  try {} catch {
     resolved = null;
   }
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[NoCoverage] BlockStatement
src/vault-scan.ts:47:11
   let resolved: string | null;
   try {
     resolved = fs.realpathSync(base);
-  } catch {
-    resolved = null;
-  }
+  } catch {}
   if (resolved !== null) realBaseCache.set(base, resolved);
   return resolved;

[Survived] ConditionalExpression
src/vault-scan.ts:50:7
   } catch {
     resolved = null;
   }
-  if (resolved !== null) realBaseCache.set(base, resolved);
+  if (false) realBaseCache.set(base, resolved);
   return resolved;
 }

[Survived] EqualityOperator
src/vault-scan.ts:50:7
   } catch {
     resolved = null;
   }
-  if (resolved !== null) realBaseCache.set(base, resolved);
+  if (resolved === null) realBaseCache.set(base, resolved);
   return resolved;
 }

[NoCoverage] BlockStatement
src/vault-scan.ts:61:44
 // resolve and never trigger the spy. Reset the cache between tests; production
 // never calls this. Mirrors the __testSetEmbedder / __testsResetShutdownLatch
 // seam pattern in embeddings.ts / index.ts.
-export function __testClearRealBaseCache() {
-  realBaseCache.clear();
-}
+export function __testClearRealBaseCache() {}
 
 export function slugify(title: string): string {

[Killed] BlockStatement
src/vault-scan.ts:65:48
   realBaseCache.clear();
 }
 
-export function slugify(title: string): string {
-  const slug = title
-    .toLowerCase()
-    .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-|-$/g, '')
-    .slice(0, 80);
-  // An empty/whitespace title would otherwise produce a `.md` filename and a
-  // key like `knowledge/.md`; fall back to a stable slug instead.
-  return slug || 'untitled';
-}
+export function slugify(title: string): string {}
 
 export function keyFromPath(filePath: string, isOrg: boolean): string {
killedBy: slugify empty-title fallback (T1) falls back to "untitled" for an empty title
statusReason: expected undefined to be 'untitled' // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:66:16
 }
 
 export function slugify(title: string): string {
-  const slug = title
-    .toLowerCase()
+  const slug = title.toUpperCase()
     .replace(/[^a-z0-9]+/g, '-')
     .replace(/^-|-$/g, '')
killedBy: slugify empty-title fallback (T1) produces a real slug for a title with at least one alnum char
statusReason: expected 'untitled' to be 'hello-world' // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:66:16
 }
 
 export function slugify(title: string): string {
-  const slug = title
-    .toLowerCase()
-    .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-|-$/g, '')
-    .slice(0, 80);
+  const slug = title.toLowerCase().replace(/[^a-z0-9]+/g, '-').replace(/^-|-$/g, '');
   // An empty/whitespace title would otherwise produce a `.md` filename and a
   // key like `knowledge/.md`; fall back to a stable slug instead.
killedBy: slugify empty-title fallback (T1) caps the slug at 80 chars (fallback only fires when the slug is EMPTY)
statusReason: expected 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' to be 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa…' // Object.is equality

[Killed] Regex
src/vault-scan.ts:68:14
 export function slugify(title: string): string {
   const slug = title
     .toLowerCase()
-    .replace(/[^a-z0-9]+/g, '-')
+    .replace(/[a-z0-9]+/g, '-')
     .replace(/^-|-$/g, '')
     .slice(0, 80);
killedBy: slugify empty-title fallback (T1) falls back to "untitled" for an empty title
statusReason: expected '   ' to be 'untitled' // Object.is equality

[Killed] Regex
src/vault-scan.ts:69:14
   const slug = title
     .toLowerCase()
     .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-|-$/g, '')
+    .replace(/^-|-/g, '')
     .slice(0, 80);
   // An empty/whitespace title would otherwise produce a `.md` filename and a
killedBy: slugify empty-title fallback (T1) produces a real slug for a title with at least one alnum char
statusReason: expected 'helloworld' to be 'hello-world' // Object.is equality

[Killed] StringLiteral
src/vault-scan.ts:69:24
   const slug = title
     .toLowerCase()
     .replace(/[^a-z0-9]+/g, '-')
-    .replace(/^-|-$/g, '')
+    .replace(/^-|-$/g, "Stryker was here!")
     .slice(0, 80);
   // An empty/whitespace title would otherwise produce a `.md` filename and a
killedBy: slugify empty-title fallback (T1) falls back to "untitled" for an empty title
statusReason: expected 'Stryker was here!' to be 'untitled' // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:73:10
     .slice(0, 80);
   // An empty/whitespace title would otherwise produce a `.md` filename and a
   // key like `knowledge/.md`; fall back to a stable slug instead.
-  return slug || 'untitled';
+  return true;
 }
 
killedBy: slugify empty-title fallback (T1) falls back to "untitled" for an empty title
statusReason: expected true to be 'untitled' // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:73:10
     .slice(0, 80);
   // An empty/whitespace title would otherwise produce a `.md` filename and a
   // key like `knowledge/.md`; fall back to a stable slug instead.
-  return slug || 'untitled';
+  return false;
 }
 
killedBy: slugify empty-title fallback (T1) falls back to "untitled" for an empty title
statusReason: expected false to be 'untitled' // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:76:71
   return slug || 'untitled';
 }
 
-export function keyFromPath(filePath: string, isOrg: boolean): string {
-  const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
-  // Keys always use `/` separators regardless of platform: on Windows
-  // path.relative returns `\`-separated segments, which would produce keys like
-  // `architecture\foo` that deriveFilePathFromKey rejects (it treats `\` as a
-  // path-escape attempt), making every memory invisible to the index.
-  const rel = path
-    .relative(base, filePath)
-    .split(path.sep)
-    .join('/')
-    .replace(/\.md$/, '');
-  return isOrg ? `org/${rel}` : rel;
-}
+export function keyFromPath(filePath: string, isOrg: boolean): string {}
 
 export function tokenEstimate(text: string): number {
killedBy: keyFromPath personal vault: relative path without extension, "/" separators
statusReason: expected undefined to be 'architecture/a' // Object.is equality

[Killed] StringLiteral
src/vault-scan.ts:86:23
     .relative(base, filePath)
     .split(path.sep)
     .join('/')
-    .replace(/\.md$/, '');
+    .replace(/\.md$/, "Stryker was here!");
   return isOrg ? `org/${rel}` : rel;
 }
killedBy: keyFromPath personal vault: relative path without extension, "/" separators
statusReason: expected 'architecture/aStryker was here!' to be 'architecture/a' // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:90:53
   return isOrg ? `org/${rel}` : rel;
 }
 
-export function tokenEstimate(text: string): number {
-  return Math.ceil(text.length / 4);
-}
+export function tokenEstimate(text: string): number {}
 
 // Prototype-pollution guard: memory keys are used as plain-object property
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArithmeticOperator
src/vault-scan.ts:91:20
 }
 
 export function tokenEstimate(text: string): number {
-  return Math.ceil(text.length / 4);
+  return Math.ceil(text.length * 4);
 }
 
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/vault-scan.ts:103:53
 // sync-org-memory.mjs).
 export const RESERVED_KEY_SEGMENTS = new Set(['__proto__', 'constructor', 'prototype']);
 
-export function isReservedKey(key: string): boolean {
-  if (typeof key !== 'string' || !key) return true;
-  const isOrg = key.startsWith('org/');
-  const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel) return true;
-  return rel.split('/').some((s) => RESERVED_KEY_SEGMENTS.has(s));
-}
+export function isReservedKey(key: string): boolean {}
 
 // Assert the on-disk entry at `filePath` is a regular file, not a symlink or
killedBy: isReservedKey rejects the prototype-pollution segment names
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:104:7
 export const RESERVED_KEY_SEGMENTS = new Set(['__proto__', 'constructor', 'prototype']);
 
 export function isReservedKey(key: string): boolean {
-  if (typeof key !== 'string' || !key) return true;
+  if (true) return true;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
killedBy: isReservedKey accepts normal keys (personal and org)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/vault-scan.ts:104:7
 export const RESERVED_KEY_SEGMENTS = new Set(['__proto__', 'constructor', 'prototype']);
 
 export function isReservedKey(key: string): boolean {
-  if (typeof key !== 'string' || !key) return true;
+  if (typeof key !== 'string' && !key) return true;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
killedBy: isReservedKey rejects non-string and empty
statusReason: key.startsWith is not a function

[Survived] MethodExpression
src/vault-scan.ts:105:17
 
 export function isReservedKey(key: string): boolean {
   if (typeof key !== 'string' || !key) return true;
-  const isOrg = key.startsWith('org/');
+  const isOrg = key.endsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel) return true;

[Killed] ConditionalExpression
src/vault-scan.ts:107:7
   if (typeof key !== 'string' || !key) return true;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel) return true;
+  if (false) return true;
   return rel.split('/').some((s) => RESERVED_KEY_SEGMENTS.has(s));
 }
killedBy: isReservedKey rejects a bare org/ prefix with nothing under it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:107:7
   if (typeof key !== 'string' || !key) return true;
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
-  if (!rel) return true;
+  if (true) return true;
   return rel.split('/').some((s) => RESERVED_KEY_SEGMENTS.has(s));
 }
killedBy: isReservedKey accepts normal keys (personal and org)
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:108:10
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel) return true;
-  return rel.split('/').some((s) => RESERVED_KEY_SEGMENTS.has(s));
+  return rel.split('/').every(s => RESERVED_KEY_SEGMENTS.has(s));
 }
 
killedBy: isReservedKey rejects a reserved segment anywhere in the path
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/vault-scan.ts:108:30
   const isOrg = key.startsWith('org/');
   const rel = isOrg ? key.slice('org/'.length) : key;
   if (!rel) return true;
-  return rel.split('/').some((s) => RESERVED_KEY_SEGMENTS.has(s));
+  return rel.split('/').some(() => undefined);
 }
 
killedBy: isReservedKey rejects the prototype-pollution segment names
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:128:72
 // which throws a clear error the caller already handles. Mirrors the inline guards
 // in store.ts:122-136 and mutate.ts:32-38 (the write path Pass 1 / Pass 5 closed);
 // factored out so the read paths share one implementation.
-export function assertRegularFile(filePath: string, key: string): void {
-  try {
-    if (!fs.lstatSync(filePath).isFile()) {
-      throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
-    }
-  } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = file removed since load, fine
-  }
-}
+export function assertRegularFile(filePath: string, key: string): void {}
 
 // Generalised form of assertRegularFile: stat the entry itself (lstat, not stat,
killedBy: assertRegularFile throws for a directory
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/vault-scan.ts:129:7
 // in store.ts:122-136 and mutate.ts:32-38 (the write path Pass 1 / Pass 5 closed);
 // factored out so the read paths share one implementation.
 export function assertRegularFile(filePath: string, key: string): void {
-  try {
-    if (!fs.lstatSync(filePath).isFile()) {
-      throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
-    }
-  } catch (e: any) {
+  try {} catch (e: any) {
     if (!e || e.code !== 'ENOENT') throw e; // ENOENT = file removed since load, fine
   }
killedBy: assertRegularFile throws for a directory
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vault-scan.ts:130:9
 // factored out so the read paths share one implementation.
 export function assertRegularFile(filePath: string, key: string): void {
   try {
-    if (!fs.lstatSync(filePath).isFile()) {
+    if (true) {
       throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
     }
killedBy: assertRegularFile passes silently for a regular file
statusReason: expected [Function] to not throw an error but 'Error: Memory "test/reg" is not a reg…' was thrown

[Killed] BooleanLiteral
src/vault-scan.ts:130:9
 // factored out so the read paths share one implementation.
 export function assertRegularFile(filePath: string, key: string): void {
   try {
-    if (!fs.lstatSync(filePath).isFile()) {
+    if (fs.lstatSync(filePath).isFile()) {
       throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
     }
killedBy: assertRegularFile passes silently for a regular file
statusReason: expected [Function] to not throw an error but 'Error: Memory "test/reg" is not a reg…' was thrown

[Survived] StringLiteral
src/vault-scan.ts:131:23
 export function assertRegularFile(filePath: string, key: string): void {
   try {
     if (!fs.lstatSync(filePath).isFile()) {
-      throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
+      throw new Error(``);
     }
   } catch (e: any) {

[Killed] BlockStatement
src/vault-scan.ts:133:20
     if (!fs.lstatSync(filePath).isFile()) {
       throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
     }
-  } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = file removed since load, fine
-  }
+  } catch (e: any) {}
 }
 
killedBy: assertRegularFile throws for a directory
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vault-scan.ts:134:15
       throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
     }
   } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = file removed since load, fine
+    if (!e || e.code === 'ENOENT') throw e; // ENOENT = file removed since load, fine
   }
 }
killedBy: assertRegularFile throws for a directory
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vault-scan.ts:134:15
       throw new Error(`Memory "${key}" is not a regular file (symlink or directory) — refusing to follow a possible planted link in the shared org vault.`);
     }
   } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = file removed since load, fine
+    if (!e || false) throw e; // ENOENT = file removed since load, fine
   }
 }
killedBy: assertRegularFile throws for a directory
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/vault-scan.ts:149:9
   filePath: string,
   predicate: (stats: fs.Stats) => boolean,
   errorIfFail: string
-): void {
-  try {
-    if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
-  } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
-  }
-}
+): void {}
 
 // Read a memory file's body (frontmatter stripped) with the symlink guard.
killedBy: assertLstat throws the caller-supplied message when the predicate fails
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/vault-scan.ts:150:7
   predicate: (stats: fs.Stats) => boolean,
   errorIfFail: string
 ): void {
-  try {
-    if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
-  } catch (e: any) {
+  try {} catch (e: any) {
     if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
   }
killedBy: assertLstat throws the caller-supplied message when the predicate fails
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vault-scan.ts:151:9
   errorIfFail: string
 ): void {
   try {
-    if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
+    if (true) throw new Error(errorIfFail);
   } catch (e: any) {
     if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
killedBy: assertLstat passes when the predicate holds
statusReason: expected [Function] to not throw an error but 'Error: not a file' was thrown

[Killed] BooleanLiteral
src/vault-scan.ts:151:9
   errorIfFail: string
 ): void {
   try {
-    if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
+    if (predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
   } catch (e: any) {
     if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
killedBy: assertLstat passes when the predicate holds
statusReason: expected [Function] to not throw an error but 'Error: not a file' was thrown

[Killed] BlockStatement
src/vault-scan.ts:152:20
 ): void {
   try {
     if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
-  } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
-  }
+  } catch (e: any) {}
 }
 
killedBy: assertLstat throws the caller-supplied message when the predicate fails
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vault-scan.ts:153:9
   try {
     if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
   } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
+    if (true) throw e; // ENOENT = entry doesn't exist yet, fine
   }
 }
killedBy: assertLstat lets ENOENT fall through (predicate never runs)
statusReason: expected [Function] to not throw an error but 'Error: ENOENT: no such file or direct…' was thrown

[Killed] ConditionalExpression
src/vault-scan.ts:153:9
   try {
     if (!predicate(fs.lstatSync(filePath))) throw new Error(errorIfFail);
   } catch (e: any) {
-    if (!e || e.code !== 'ENOENT') throw e; // ENOENT = entry doesn't exist yet, fine
+    if (false) throw e; // ENOENT = entry doesn't exist yet, fine
   }
 }
killedBy: assertLstat throws the caller-supplied message when the predicate fails
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/vault-scan.ts:171:81
 // vs strict `=== undefined`) and the access-bump policy (unconditional / iff-readOk
 // / none) differ per call site and are intentionally NOT unified here — callers
 // keep their own; this helper owns only the safe read.
-export function readMemoryContent(filePath: string, key: string): string | null {
-  try {
-    assertRegularFile(filePath, key);
-    const raw = fs.readFileSync(filePath, 'utf8');
-    return parseFrontmatter(raw).content;
-  } catch {
-    return null;
-  }
-}
+export function readMemoryContent(filePath: string, key: string): string | null {}
 
 // LRU-or-read: try the shared contentCache first, fall back to readMemoryContent
killedBy: readMemoryContent returns the body (frontmatter stripped) for a real .md file
statusReason: expected undefined to be '\nThe body text.\n' // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:172:7
 // / none) differ per call site and are intentionally NOT unified here — callers
 // keep their own; this helper owns only the safe read.
 export function readMemoryContent(filePath: string, key: string): string | null {
-  try {
-    assertRegularFile(filePath, key);
-    const raw = fs.readFileSync(filePath, 'utf8');
-    return parseFrontmatter(raw).content;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: readMemoryContent returns the body (frontmatter stripped) for a real .md file
statusReason: expected undefined to be '\nThe body text.\n' // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:176:11
     assertRegularFile(filePath, key);
     const raw = fs.readFileSync(filePath, 'utf8');
     return parseFrontmatter(raw).content;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: readMemoryContent returns null for a missing file (ENOENT)
statusReason: expected undefined to be null

[Killed] BlockStatement
src/vault-scan.ts:207:60
   key: string,
   filePath: string,
   onEmpty: 'hit' | 'reread' = 'hit'
-): { status: 'hit' | 'fresh' | 'failed'; content: string } {
-  const hit = contentCache.get(key);
-  if (hit !== undefined && !(onEmpty === 'reread' && hit === '')) {
-    return { status: 'hit', content: hit };
-  }
-  const body = readMemoryContent(filePath, key);
-  if (body !== null) {
-    contentCache.set(key, body);
-    return { status: 'fresh', content: body };
-  }
-  return { status: 'failed', content: '' };
-}
+): { status: 'hit' | 'fresh' | 'failed'; content: string } {}
 
 // ─── Full vault scan ─────────────────────────────────────────────────────────
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected undefined to deeply equal { status: 'fresh', …(1) }

[Killed] LogicalOperator
src/vault-scan.ts:209:7
   onEmpty: 'hit' | 'reread' = 'hit'
 ): { status: 'hit' | 'fresh' | 'failed'; content: string } {
   const hit = contentCache.get(key);
-  if (hit !== undefined && !(onEmpty === 'reread' && hit === '')) {
+  if (hit !== undefined || !(onEmpty === 'reread' && hit === '')) {
     return { status: 'hit', content: hit };
   }
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected { status: 'hit', content: undefined } to deeply equal { status: 'fresh', …(1) }

[Killed] EqualityOperator
src/vault-scan.ts:209:30
   onEmpty: 'hit' | 'reread' = 'hit'
 ): { status: 'hit' | 'fresh' | 'failed'; content: string } {
   const hit = contentCache.get(key);
-  if (hit !== undefined && !(onEmpty === 'reread' && hit === '')) {
+  if (hit !== undefined && !(onEmpty !== 'reread' && hit === '')) {
     return { status: 'hit', content: hit };
   }
killedBy: readCachedOrFresh onEmpty='reread' re-reads a cached ''
statusReason: expected 'hit' to be 'fresh' // Object.is equality

[Killed] StringLiteral
src/vault-scan.ts:210:22
 ): { status: 'hit' | 'fresh' | 'failed'; content: string } {
   const hit = contentCache.get(key);
   if (hit !== undefined && !(onEmpty === 'reread' && hit === '')) {
-    return { status: 'hit', content: hit };
+    return { status: "", content: hit };
   }
   const body = readMemoryContent(filePath, key);
killedBy: readCachedOrFresh returns 'hit' on a subsequent call without re-reading
statusReason: expected '' to be 'hit' // Object.is equality

[Killed] ObjectLiteral
src/vault-scan.ts:210:12
 ): { status: 'hit' | 'fresh' | 'failed'; content: string } {
   const hit = contentCache.get(key);
   if (hit !== undefined && !(onEmpty === 'reread' && hit === '')) {
-    return { status: 'hit', content: hit };
+    return {};
   }
   const body = readMemoryContent(filePath, key);
killedBy: readCachedOrFresh returns 'hit' on a subsequent call without re-reading
statusReason: expected undefined to be 'hit' // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:213:7
     return { status: 'hit', content: hit };
   }
   const body = readMemoryContent(filePath, key);
-  if (body !== null) {
+  if (body === null) {
     contentCache.set(key, body);
     return { status: 'fresh', content: body };
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected { status: 'failed', content: '' } to deeply equal { status: 'fresh', …(1) }

[Killed] BlockStatement
src/vault-scan.ts:213:22
     return { status: 'hit', content: hit };
   }
   const body = readMemoryContent(filePath, key);
-  if (body !== null) {
-    contentCache.set(key, body);
-    return { status: 'fresh', content: body };
-  }
+  if (body !== null) {}
   return { status: 'failed', content: '' };
 }
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected { status: 'failed', content: '' } to deeply equal { status: 'fresh', …(1) }

[Killed] ObjectLiteral
src/vault-scan.ts:215:12
   const body = readMemoryContent(filePath, key);
   if (body !== null) {
     contentCache.set(key, body);
-    return { status: 'fresh', content: body };
+    return {};
   }
   return { status: 'failed', content: '' };
killedBy: readCachedOrFresh returns 'fresh' and caches a real read
statusReason: expected {} to deeply equal { status: 'fresh', …(1) }

[Killed] BlockStatement
src/vault-scan.ts:231:9
   const seen = new Set<string>();
   const walk = (dir: string, isOrg: boolean) => {
     let entries: fs.Dirent[];
-    try {
-      entries = fs.readdirSync(dir, { withFileTypes: true });
-    } catch (e) {
+    try {} catch (e) {
       // ENOENT (dir gone since walk scheduled) is fine — skip silently. A NON-ENOENT
       // error (EACCES on a chmod'd subdir, EMFILE on fd exhaustion) silently pruned
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: entries is not iterable
