[Killed] BlockStatement
src/vault-scan.ts:233:17
     let entries: fs.Dirent[];
     try {
       entries = fs.readdirSync(dir, { withFileTypes: true });
-    } catch (e) {
-      // ENOENT (dir gone since walk scheduled) is fine — skip silently. A NON-ENOENT
-      // error (EACCES on a chmod'd subdir, EMFILE on fd exhaustion) silently pruned
-      // the whole subtree from the index with no signal, so memories "vanished" from
-      // search with no recordError. Surface those so the condition is observable in
-      // get_stats.recentErrors; the subtree is still skipped (return) either way.
-      if (e && (e as NodeJS.ErrnoException).code !== 'ENOENT') {
-        recordError(`reconcile readdirSync(${dir}): ${(e as Error).message}`);
-      }
-      return;
-    }
+    } catch (e) {}
     for (const e of entries) {
       // Skip symlinks entirely. `git pull` preserves symlinks, so a teammate
killedBy: reconcileIndex — boot walk records an error on a non-ENOENT readdirSync failure (EACCES on a chmod 000 subdir)
statusReason: entries is not iterable

[Killed] ConditionalExpression
src/vault-scan.ts:239:11
       // the whole subtree from the index with no signal, so memories "vanished" from
       // search with no recordError. Surface those so the condition is observable in
       // get_stats.recentErrors; the subtree is still skipped (return) either way.
-      if (e && (e as NodeJS.ErrnoException).code !== 'ENOENT') {
+      if (false) {
         recordError(`reconcile readdirSync(${dir}): ${(e as Error).message}`);
       }
killedBy: reconcileIndex — boot walk records an error on a non-ENOENT readdirSync failure (EACCES on a chmod 000 subdir)
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/vault-scan.ts:239:16
       // the whole subtree from the index with no signal, so memories "vanished" from
       // search with no recordError. Surface those so the condition is observable in
       // get_stats.recentErrors; the subtree is still skipped (return) either way.
-      if (e && (e as NodeJS.ErrnoException).code !== 'ENOENT') {
+      if (e && (e as NodeJS.ErrnoException).code === 'ENOENT') {
         recordError(`reconcile readdirSync(${dir}): ${(e as Error).message}`);
       }
killedBy: reconcileIndex — boot walk records an error on a non-ENOENT readdirSync failure (EACCES on a chmod 000 subdir)
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/vault-scan.ts:257:11
       // (not the target), so this fires before the isDirectory/endsWith branches
       // below. The privacy filter never runs on pulled content, so this
       // index-time skip is the only barrier against the read-side leak.
-      if (e.isSymbolicLink()) continue;
+      if (true) continue;
       // `e.name` is a filesystem-discovered entry from readdirSync (excludes
       // `.`/`..`; filenames can't contain `/`), and `dir` is vault-rooted by the
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/vault-scan.ts:257:11
       // (not the target), so this fires before the isDirectory/endsWith branches
       // below. The privacy filter never runs on pulled content, so this
       // index-time skip is the only barrier against the read-side leak.
-      if (e.isSymbolicLink()) continue;
+      if (false) continue;
       // `e.name` is a filesystem-discovered entry from readdirSync (excludes
       // `.`/`..`; filenames can't contain `/`), and `dir` is vault-rooted by the

[Killed] BlockStatement
src/vault-scan.ts:262:28
       // `.`/`..`; filenames can't contain `/`), and `dir` is vault-rooted by the
       // walk. Not caller-supplied. Reviewed path-traversal finding; suppressed inline.
       const fp = path.join(dir, e.name); // nosemgrep: path-join-resolve-traversal — filesystem-discovered name, vault-rooted walk.
-      if (e.isDirectory()) {
-        // Reserve the `org/` key prefix for the ORG vault. A personal-vault
-        // subdir literally named `org` would index files to keys like `org/x`,
-        // colliding with (and shadowing) org-vault keys (`org/<rel>`). Skip it
-        // on the personal walk so the org namespace stays unambiguous.
-        const reservedOrgPrefix = !isOrg && e.name === 'org';
-        if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
-      } else if (e.name.endsWith('.md')) {
+      if (e.isDirectory()) {} else if (e.name.endsWith('.md')) {
         indexFile(fp, isOrg);
         seen.add(keyFromPath(fp, isOrg));
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:262:11
       // `.`/`..`; filenames can't contain `/`), and `dir` is vault-rooted by the
       // walk. Not caller-supplied. Reviewed path-traversal finding; suppressed inline.
       const fp = path.join(dir, e.name); // nosemgrep: path-join-resolve-traversal — filesystem-discovered name, vault-rooted walk.
-      if (e.isDirectory()) {
+      if (false) {
         // Reserve the `org/` key prefix for the ORG vault. A personal-vault
         // subdir literally named `org` would index files to keys like `org/x`,
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:267:35
         // subdir literally named `org` would index files to keys like `org/x`,
         // colliding with (and shadowing) org-vault keys (`org/<rel>`). Skip it
         // on the personal walk so the org namespace stays unambiguous.
-        const reservedOrgPrefix = !isOrg && e.name === 'org';
+        const reservedOrgPrefix = false;
         if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
       } else if (e.name.endsWith('.md')) {
killedBy: reconcileIndex — boot walk skips a personal-vault subdir literally named "org" (reserved prefix)
statusReason: expected { key: 'org/collision', …(15) } to be undefined

[Killed] BooleanLiteral
src/vault-scan.ts:267:35
         // subdir literally named `org` would index files to keys like `org/x`,
         // colliding with (and shadowing) org-vault keys (`org/<rel>`). Skip it
         // on the personal walk so the org namespace stays unambiguous.
-        const reservedOrgPrefix = !isOrg && e.name === 'org';
+        const reservedOrgPrefix = isOrg && e.name === 'org';
         if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
       } else if (e.name.endsWith('.md')) {
killedBy: reconcileIndex — boot walk skips a personal-vault subdir literally named "org" (reserved prefix)
statusReason: expected { key: 'org/collision', …(15) } to be undefined

[Killed] LogicalOperator
src/vault-scan.ts:268:13
         // colliding with (and shadowing) org-vault keys (`org/<rel>`). Skip it
         // on the personal walk so the org namespace stays unambiguous.
         const reservedOrgPrefix = !isOrg && e.name === 'org';
-        if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
+        if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) || !reservedOrgPrefix) walk(fp, isOrg);
       } else if (e.name.endsWith('.md')) {
         indexFile(fp, isOrg);
killedBy: reconcileIndex — boot walk skips EXCLUDED_DIRS subtrees
statusReason: expected { key: 'projects/excl', …(15) } to be undefined

[Killed] ConditionalExpression
src/vault-scan.ts:268:13
         // colliding with (and shadowing) org-vault keys (`org/<rel>`). Skip it
         // on the personal walk so the org namespace stays unambiguous.
         const reservedOrgPrefix = !isOrg && e.name === 'org';
-        if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
+        if (false) walk(fp, isOrg);
       } else if (e.name.endsWith('.md')) {
         indexFile(fp, isOrg);
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/vault-scan.ts:269:42
         // on the personal walk so the org namespace stays unambiguous.
         const reservedOrgPrefix = !isOrg && e.name === 'org';
         if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
-      } else if (e.name.endsWith('.md')) {
-        indexFile(fp, isOrg);
-        seen.add(keyFromPath(fp, isOrg));
-      }
+      } else if (e.name.endsWith('.md')) {}
     }
   };
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/vault-scan.ts:269:18
         // on the personal walk so the org namespace stays unambiguous.
         const reservedOrgPrefix = !isOrg && e.name === 'org';
         if (!EXCLUDED_DIRS.has(e.name.toLowerCase()) && !reservedOrgPrefix) walk(fp, isOrg);
-      } else if (e.name.endsWith('.md')) {
+      } else if (e.name.startsWith('.md')) {
         indexFile(fp, isOrg);
         seen.add(keyFromPath(fp, isOrg));
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/vault-scan.ts:277:24
   };
   ensureDir(PERSONAL_VAULT);
   ensureDir(ORG_VAULT);
-  walk(PERSONAL_VAULT, false);
+  walk(PERSONAL_VAULT, true);
   walk(ORG_VAULT, true);
   // Drop index entries whose file vanished since the last scan, AND purge their
killedBy: reconcileIndex — boot walk indexes .md files found under the personal vault
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/vault-scan.ts:278:19
   ensureDir(PERSONAL_VAULT);
   ensureDir(ORG_VAULT);
   walk(PERSONAL_VAULT, false);
-  walk(ORG_VAULT, true);
+  walk(ORG_VAULT, false);
   // Drop index entries whose file vanished since the last scan, AND purge their
   // cached content + vector embedding so a deleted/orphaned memory can't resurface
killedBy: reconcileIndex — boot walk indexes org-vault files under the org/ key prefix
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/vault-scan.ts:284:29
   // through the vector search path (searchVector reads vec_memories directly and
   // does not consult memIndex). Fire-and-forget: deleteVector no-ops when the
   // optional sqlite-vec deps are absent.
-  for (const key of before) {
-    if (!seen.has(key)) {
-      delete memIndex[key];
-      contentCache.delete(key);
-      deleteVector(VECTORS_DB, key).catch(() => {});
-    }
-  }
+  for (const key of before) {}
   // Close pre-existing vector-index holes before any hybrid search can miss them,
   // and sweep stale rows the exit path may have left behind. Fire-and-forget: the
killedBy: reconcileIndex — boot walk drops a memIndex entry whose file no longer exists and purges its cache
statusReason: expected { key: 'knowledge/gone', …(15) } to be undefined

[Killed] BlockStatement
src/vault-scan.ts:285:25
   // does not consult memIndex). Fire-and-forget: deleteVector no-ops when the
   // optional sqlite-vec deps are absent.
   for (const key of before) {
-    if (!seen.has(key)) {
-      delete memIndex[key];
-      contentCache.delete(key);
-      deleteVector(VECTORS_DB, key).catch(() => {});
-    }
+    if (!seen.has(key)) {}
   }
   // Close pre-existing vector-index holes before any hybrid search can miss them,
killedBy: reconcileIndex — boot walk drops a memIndex entry whose file no longer exists and purges its cache
statusReason: expected { key: 'knowledge/gone', …(15) } to be undefined

[Killed] ConditionalExpression
src/vault-scan.ts:285:9
   // does not consult memIndex). Fire-and-forget: deleteVector no-ops when the
   // optional sqlite-vec deps are absent.
   for (const key of before) {
-    if (!seen.has(key)) {
+    if (false) {
       delete memIndex[key];
       contentCache.delete(key);
killedBy: reconcileIndex — boot walk drops a memIndex entry whose file no longer exists and purges its cache
statusReason: expected { key: 'knowledge/gone', …(15) } to be undefined

[Survived] BlockStatement
src/vault-scan.ts:326:50
 // same key self-heals (INSERT OR REPLACE), but a deleted key is never rewritten,
 // so the row bloats vec_memories forever and wastes search work. Sweep keys that
 // exist in vec_memories but not in memIndex and delete them.
-async function reconcileVectors(): Promise<void> {
-  const existing = await listVectorKeys(VECTORS_DB);
-  if (existing === null) return;
-  const have = new Set(existing);
-  const want = new Set(Object.keys(memIndex));
-  for (const key of existing) {
-    if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
-  }
-  for (const key of want) {
-    if (have.has(key)) continue;
-    const meta = memIndex[key];
-    if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);
-  }
-}
+async function reconcileVectors(): Promise<void> {}
 
 export function indexFile(filePath: string, isOrg: boolean) {

[Survived] ConditionalExpression
src/vault-scan.ts:328:7
 // exist in vec_memories but not in memIndex and delete them.
 async function reconcileVectors(): Promise<void> {
   const existing = await listVectorKeys(VECTORS_DB);
-  if (existing === null) return;
+  if (false) return;
   const have = new Set(existing);
   const want = new Set(Object.keys(memIndex));

[Survived] ConditionalExpression
src/vault-scan.ts:328:7
 // exist in vec_memories but not in memIndex and delete them.
 async function reconcileVectors(): Promise<void> {
   const existing = await listVectorKeys(VECTORS_DB);
-  if (existing === null) return;
+  if (true) return;
   const have = new Set(existing);
   const want = new Set(Object.keys(memIndex));

[NoCoverage] BlockStatement
src/vault-scan.ts:331:31
   if (existing === null) return;
   const have = new Set(existing);
   const want = new Set(Object.keys(memIndex));
-  for (const key of existing) {
-    if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
-  }
+  for (const key of existing) {}
   for (const key of want) {
     if (have.has(key)) continue;

[NoCoverage] BooleanLiteral
src/vault-scan.ts:332:9
   const have = new Set(existing);
   const want = new Set(Object.keys(memIndex));
   for (const key of existing) {
-    if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
+    if (want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
   }
   for (const key of want) {

[NoCoverage] ConditionalExpression
src/vault-scan.ts:332:9
   const have = new Set(existing);
   const want = new Set(Object.keys(memIndex));
   for (const key of existing) {
-    if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
+    if (false) deleteVector(VECTORS_DB, key).catch(() => {});
   }
   for (const key of want) {

[NoCoverage] BlockStatement
src/vault-scan.ts:334:27
   for (const key of existing) {
     if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
   }
-  for (const key of want) {
-    if (have.has(key)) continue;
-    const meta = memIndex[key];
-    if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);
-  }
+  for (const key of want) {}
 }
 

[NoCoverage] ConditionalExpression
src/vault-scan.ts:335:9
     if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
   }
   for (const key of want) {
-    if (have.has(key)) continue;
+    if (false) continue;
     const meta = memIndex[key];
     if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);

[NoCoverage] ConditionalExpression
src/vault-scan.ts:335:9
     if (!want.has(key)) deleteVector(VECTORS_DB, key).catch(() => {});
   }
   for (const key of want) {
-    if (have.has(key)) continue;
+    if (true) continue;
     const meta = memIndex[key];
     if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);

[NoCoverage] ConditionalExpression
src/vault-scan.ts:337:9
   for (const key of want) {
     if (have.has(key)) continue;
     const meta = memIndex[key];
-    if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);
+    if (true) embedAndUpsert(key, meta.contentPreview);
   }
 }

[NoCoverage] OptionalChaining
src/vault-scan.ts:337:9
   for (const key of want) {
     if (have.has(key)) continue;
     const meta = memIndex[key];
-    if (meta?.contentPreview) embedAndUpsert(key, meta.contentPreview);
+    if (meta.contentPreview) embedAndUpsert(key, meta.contentPreview);
   }
 }

[Killed] BlockStatement
src/vault-scan.ts:361:9
     // returns isSymbolicLink()=true and is rejected, so readFileSync can't
     // follow a link out of the vault and leak the target into contentPreview.
     let st: fs.Stats;
-    try {
-      st = fs.lstatSync(filePath);
-    } catch { return; }
+    try {} catch { return; }
     if (st.isSymbolicLink()) return;
 
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[NoCoverage] BlockStatement
src/vault-scan.ts:363:13
     let st: fs.Stats;
     try {
       st = fs.lstatSync(filePath);
-    } catch { return; }
+    } catch {}
     if (st.isSymbolicLink()) return;
 

[Killed] ConditionalExpression
src/vault-scan.ts:364:9
     try {
       st = fs.lstatSync(filePath);
     } catch { return; }
-    if (st.isSymbolicLink()) return;
+    if (false) return;
 
     const key = keyFromPath(filePath, isOrg);
killedBy: indexFile — rejection paths skips a symlink .md and does NOT index it
statusReason: expected { key: 'knowledge/sym', …(15) } to be undefined

[Killed] ConditionalExpression
src/vault-scan.ts:364:9
     try {
       st = fs.lstatSync(filePath);
     } catch { return; }
-    if (st.isSymbolicLink()) return;
+    if (true) return;
 
     const key = keyFromPath(filePath, isOrg);
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:371:9
     // under a `constructor/` directory would index to a reserved object-key name
     // and pollute every object's prototype. Skip silently — the file stays on
     // disk but never enters memIndex or the serialized index.json.
-    if (isReservedKey(key)) {
+    if (true) {
       recordError(`indexFile: reserved key skipped: ${key}`);
       return;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/vault-scan.ts:371:29
     // under a `constructor/` directory would index to a reserved object-key name
     // and pollute every object's prototype. Skip silently — the file stays on
     // disk but never enters memIndex or the serialized index.json.
-    if (isReservedKey(key)) {
-      recordError(`indexFile: reserved key skipped: ${key}`);
-      return;
-    }
+    if (isReservedKey(key)) {}
     // Re-index from disk but preserve runtime stats (accessCount, lastAccessed)
     // accumulated since the last scan. Applies to personal AND org memories — org
killedBy: indexFile — rejection paths skips a reserved __proto__.md key and records an error
statusReason: expected { key: 'knowledge/__proto__', …(15) } to be undefined

[Killed] EqualityOperator
src/vault-scan.ts:403:21
     // once and backfills real values; subsequent boots skip. The 0 sentinel never
     // matches a real file, so corrupt/missing stats always force a full read —
     // the skip never fires on stale data.
-    if (existing && existing.mtimeMs === st.mtimeMs && existing.size === st.size) {
+    if (existing && existing.mtimeMs !== st.mtimeMs && existing.size === st.size) {
       memIndex[key] = { ...existing, filePath };
       return;
killedBy: indexFile — mtime/size fast path vs slow path reuses the cached entry on a second indexFile without re-reading (fast path)
statusReason: expected 'first body' to be 'SENTINEL_PREVIEW' // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:403:56
     // once and backfills real values; subsequent boots skip. The 0 sentinel never
     // matches a real file, so corrupt/missing stats always force a full read —
     // the skip never fires on stale data.
-    if (existing && existing.mtimeMs === st.mtimeMs && existing.size === st.size) {
+    if (existing && existing.mtimeMs === st.mtimeMs && existing.size !== st.size) {
       memIndex[key] = { ...existing, filePath };
       return;
killedBy: indexFile — mtime/size fast path vs slow path reuses the cached entry on a second indexFile without re-reading (fast path)
statusReason: expected 'first body' to be 'SENTINEL_PREVIEW' // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:417:9
     // syscall now runs ONLY for files that actually changed — the unchanged-file
     // majority never reaches here.
     const realBase = realBaseFor(base);
-    if (realBase === null) return;
+    if (realBase !== null) return;
     const realFile = fs.realpathSync(filePath);
     if (realFile !== realBase && !realFile.startsWith(realBase + path.sep)) return;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:417:9
     // syscall now runs ONLY for files that actually changed — the unchanged-file
     // majority never reaches here.
     const realBase = realBaseFor(base);
-    if (realBase === null) return;
+    if (true) return;
     const realFile = fs.realpathSync(filePath);
     if (realFile !== realBase && !realFile.startsWith(realBase + path.sep)) return;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/vault-scan.ts:419:34
     const realBase = realBaseFor(base);
     if (realBase === null) return;
     const realFile = fs.realpathSync(filePath);
-    if (realFile !== realBase && !realFile.startsWith(realBase + path.sep)) return;
+    if (realFile !== realBase && realFile.startsWith(realBase + path.sep)) return;
 
     const raw = fs.readFileSync(filePath, 'utf8');
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/vault-scan.ts:419:9
     const realBase = realBaseFor(base);
     if (realBase === null) return;
     const realFile = fs.realpathSync(filePath);
-    if (realFile !== realBase && !realFile.startsWith(realBase + path.sep)) return;
+    if (false) return;
 
     const raw = fs.readFileSync(filePath, 'utf8');
killedBy: indexFile — rejection paths records an error (not a throw) when the file path is outside the vault
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/vault-scan.ts:446:21
       // always quotes numeric-looking titles, so this only affects externally
       // authored files — but the threat model is the same as the frontmatter-key
       // ReDoS hardening (teammate-pushed malformed frontmatter).
-      title: String(fm.title ?? path.basename(filePath, '.md')),
+      title: String(fm.title && path.basename(filePath, '.md')),
       // Coerce arrays defensively: a teammate-pushed (or hand-edited) frontmatter
       // with a scalar `tags: foo` or `sessions: bar` would otherwise crash
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected 'full' to be 'Full' // Object.is equality

[Killed] OptionalChaining
src/vault-scan.ts:453:37
       // the same externally-authored threat model as the numeric-title coercion.
       tags: Array.isArray(fm.tags) ? fm.tags : [],
       sessions: Array.isArray(fm.sessions) ? fm.sessions : [],
-      created: String(fm.created ?? existing?.created ?? now),
+      created: String(fm.created ?? existing.created ?? now),
       updated: String(fm.updated ?? existing?.updated ?? now),
       // Coerce + clamp importanceScore to a finite [0, 1] number — see
killedBy: indexFile — happy path builds full metadata falls back to the basename when title is absent
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] LogicalOperator
src/vault-scan.ts:453:23
       // the same externally-authored threat model as the numeric-title coercion.
       tags: Array.isArray(fm.tags) ? fm.tags : [],
       sessions: Array.isArray(fm.sessions) ? fm.sessions : [],
-      created: String(fm.created ?? existing?.created ?? now),
+      created: String(fm.created && existing?.created ?? now),
       updated: String(fm.updated ?? existing?.updated ?? now),
       // Coerce + clamp importanceScore to a finite [0, 1] number — see
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected '2026-07-29T15:44:03.337Z' to be '2026-01-01T00:00:00.000Z' // Object.is equality

[Killed] LogicalOperator
src/vault-scan.ts:454:23
       tags: Array.isArray(fm.tags) ? fm.tags : [],
       sessions: Array.isArray(fm.sessions) ? fm.sessions : [],
       created: String(fm.created ?? existing?.created ?? now),
-      updated: String(fm.updated ?? existing?.updated ?? now),
+      updated: String((fm.updated ?? existing?.updated) && now),
       // Coerce + clamp importanceScore to a finite [0, 1] number — see
       // clampImportanceScore in ebbinghaus.ts.
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected '2026-07-29T15:44:03.680Z' to be '2026-02-01T00:00:00.000Z' // Object.is equality

[Killed] LogicalOperator
src/vault-scan.ts:454:23
       tags: Array.isArray(fm.tags) ? fm.tags : [],
       sessions: Array.isArray(fm.sessions) ? fm.sessions : [],
       created: String(fm.created ?? existing?.created ?? now),
-      updated: String(fm.updated ?? existing?.updated ?? now),
+      updated: String(fm.updated && existing?.updated ?? now),
       // Coerce + clamp importanceScore to a finite [0, 1] number — see
       // clampImportanceScore in ebbinghaus.ts.
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected '2026-07-29T15:44:03.831Z' to be '2026-02-01T00:00:00.000Z' // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:459:23
       // clampImportanceScore in ebbinghaus.ts.
       importanceScore: clampImportanceScore(fm.importanceScore),
       category: deriveCategory(filePath, isOrg),
-      contentPreview: content.trim().slice(0, 500),
+      contentPreview: content.slice(0, 500),
       accessCount: existing?.accessCount ?? 0,
       lastAccessed: existing?.lastAccessed ?? now,
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected 'body text here\n' to be 'body text here' // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:459:23
       // clampImportanceScore in ebbinghaus.ts.
       importanceScore: clampImportanceScore(fm.importanceScore),
       category: deriveCategory(filePath, isOrg),
-      contentPreview: content.trim().slice(0, 500),
+      contentPreview: content.trim(),
       accessCount: existing?.accessCount ?? 0,
       lastAccessed: existing?.lastAccessed ?? now,
killedBy: indexFile — happy path builds full metadata trims + slices contentPreview to 500 chars
statusReason: expected 800 to be 500 // Object.is equality

[Killed] LogicalOperator
src/vault-scan.ts:460:20
       importanceScore: clampImportanceScore(fm.importanceScore),
       category: deriveCategory(filePath, isOrg),
       contentPreview: content.trim().slice(0, 500),
-      accessCount: existing?.accessCount ?? 0,
+      accessCount: existing?.accessCount && 0,
       lastAccessed: existing?.lastAccessed ?? now,
       tokenEstimate: tokenEstimate(raw),
killedBy: indexFile — mtime/size fast path vs slow path preserves runtime accessCount/lastAccessed across a re-index
statusReason: expected +0 to be 7 // Object.is equality

[Killed] OptionalChaining
src/vault-scan.ts:460:20
       importanceScore: clampImportanceScore(fm.importanceScore),
       category: deriveCategory(filePath, isOrg),
       contentPreview: content.trim().slice(0, 500),
-      accessCount: existing?.accessCount ?? 0,
+      accessCount: existing.accessCount ?? 0,
       lastAccessed: existing?.lastAccessed ?? now,
       tokenEstimate: tokenEstimate(raw),
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/vault-scan.ts:461:21
       category: deriveCategory(filePath, isOrg),
       contentPreview: content.trim().slice(0, 500),
       accessCount: existing?.accessCount ?? 0,
-      lastAccessed: existing?.lastAccessed ?? now,
+      lastAccessed: existing?.lastAccessed && now,
       tokenEstimate: tokenEstimate(raw),
       isOrg,
killedBy: indexFile — mtime/size fast path vs slow path preserves runtime accessCount/lastAccessed across a re-index
statusReason: expected '2026-07-29T15:44:04.902Z' to be '2025-01-01T00:00:00.000Z' // Object.is equality
