[Killed] OptionalChaining
src/vault-scan.ts:461:21
       category: deriveCategory(filePath, isOrg),
       contentPreview: content.trim().slice(0, 500),
       accessCount: existing?.accessCount ?? 0,
-      lastAccessed: existing?.lastAccessed ?? now,
+      lastAccessed: existing.lastAccessed ?? now,
       tokenEstimate: tokenEstimate(raw),
       isOrg,
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/vault-scan.ts:467:9
       mtimeMs: st.mtimeMs,
       size: st.size,
     };
-    if (fm.author !== undefined) meta.author = String(fm.author);
+    if (fm.author === undefined) meta.author = String(fm.author);
     if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
       meta.confirmations = Math.max(0, fm.confirmations);
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 'adi' // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:467:9
       mtimeMs: st.mtimeMs,
       size: st.size,
     };
-    if (fm.author !== undefined) meta.author = String(fm.author);
+    if (false) meta.author = String(fm.author);
     if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
       meta.confirmations = Math.max(0, fm.confirmations);
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 'adi' // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:468:9
       size: st.size,
     };
     if (fm.author !== undefined) meta.author = String(fm.author);
-    if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
+    if (false) {
       meta.confirmations = Math.max(0, fm.confirmations);
     }
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 5 // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:468:9
       size: st.size,
     };
     if (fm.author !== undefined) meta.author = String(fm.author);
-    if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
+    if (fm.confirmations === undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
       meta.confirmations = Math.max(0, fm.confirmations);
     }
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 5 // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:469:28
     };
     if (fm.author !== undefined) meta.author = String(fm.author);
     if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
-      meta.confirmations = Math.max(0, fm.confirmations);
+      meta.confirmations = Math.min(0, fm.confirmations);
     }
     if (fm.flags !== undefined && Number.isFinite(fm.flags) && fm.flags > 0) {
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected +0 to be 5 // Object.is equality

[Killed] BlockStatement
src/vault-scan.ts:471:78
     if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
       meta.confirmations = Math.max(0, fm.confirmations);
     }
-    if (fm.flags !== undefined && Number.isFinite(fm.flags) && fm.flags > 0) {
-      meta.flags = Math.max(0, fm.flags);
-    }
+    if (fm.flags !== undefined && Number.isFinite(fm.flags) && fm.flags > 0) {}
     // Graphiti supersede provenance (Tech Radar vol.34 #45): carry the
     // supersededAt chain into the in-memory meta so it survives a reconcile /
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:471:9
     if (fm.confirmations !== undefined && Number.isFinite(fm.confirmations) && fm.confirmations > 0) {
       meta.confirmations = Math.max(0, fm.confirmations);
     }
-    if (fm.flags !== undefined && Number.isFinite(fm.flags) && fm.flags > 0) {
+    if (fm.flags === undefined && Number.isFinite(fm.flags) && fm.flags > 0) {
       meta.flags = Math.max(0, fm.flags);
     }
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/vault-scan.ts:472:20
       meta.confirmations = Math.max(0, fm.confirmations);
     }
     if (fm.flags !== undefined && Number.isFinite(fm.flags) && fm.flags > 0) {
-      meta.flags = Math.max(0, fm.flags);
+      meta.flags = Math.min(0, fm.flags);
     }
     // Graphiti supersede provenance (Tech Radar vol.34 #45): carry the
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vault-scan.ts:482:9
     // provenance inspectable without a re-parse. Coerce to a string array: a
     // hand-edited/teammate-pushed frontmatter with a scalar or non-string value
     // would otherwise corrupt the chain.
-    if (Array.isArray(fm.supersededAt)) {
+    if (true) {
       meta.supersededAt = fm.supersededAt.filter((t): t is string => typeof t === 'string');
     }
killedBy: indexFile — happy path builds full metadata falls back to the basename when title is absent
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
src/vault-scan.ts:482:9
     // provenance inspectable without a re-parse. Coerce to a string array: a
     // hand-edited/teammate-pushed frontmatter with a scalar or non-string value
     // would otherwise corrupt the chain.
-    if (Array.isArray(fm.supersededAt)) {
+    if (false) {
       meta.supersededAt = fm.supersededAt.filter((t): t is string => typeof t === 'string');
     }
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected undefined to deeply equal [ '2026-03-01T00:00:00.000Z' ]

[Killed] ConditionalExpression
src/vault-scan.ts:483:70
     // hand-edited/teammate-pushed frontmatter with a scalar or non-string value
     // would otherwise corrupt the chain.
     if (Array.isArray(fm.supersededAt)) {
-      meta.supersededAt = fm.supersededAt.filter((t): t is string => typeof t === 'string');
+      meta.supersededAt = fm.supersededAt.filter((t): t is string => false);
     }
     memIndex[key] = meta;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected [] to deeply equal [ '2026-03-01T00:00:00.000Z' ]

[Killed] EqualityOperator
src/vault-scan.ts:483:70
     // hand-edited/teammate-pushed frontmatter with a scalar or non-string value
     // would otherwise corrupt the chain.
     if (Array.isArray(fm.supersededAt)) {
-      meta.supersededAt = fm.supersededAt.filter((t): t is string => typeof t === 'string');
+      meta.supersededAt = fm.supersededAt.filter((t): t is string => typeof t !== 'string');
     }
     memIndex[key] = meta;
killedBy: indexFile — happy path builds full metadata indexes a well-formed memory with all optional fields
statusReason: expected [] to deeply equal [ '2026-03-01T00:00:00.000Z' ]

[NoCoverage] BlockStatement
src/vault-scan.ts:493:20
     // drop the entry so they re-read fresh content instead of serving the old body
     // for up to the 30-min LRU TTL.
     contentCache.delete(key);
-  } catch (e: any) {
-    recordError(`indexFile ${filePath}: ${e.message}`);
-  }
+  } catch (e: any) {}
 }
 

[Killed] BlockStatement
src/vault-scan.ts:498:74
   }
 }
 
-export function deriveCategory(filePath: string, isOrg: boolean): string {
-  const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
-  const rel = path.relative(base, filePath);
-  const parts = rel.split(path.sep);
-  return parts.length > 1 ? (parts[0] ?? 'knowledge') : 'knowledge';
-}
+export function deriveCategory(filePath: string, isOrg: boolean): string {}
killedBy: deriveCategory uses the top dir under the personal vault
statusReason: expected undefined to be 'decisions' // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:502:10
   const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
   const rel = path.relative(base, filePath);
   const parts = rel.split(path.sep);
-  return parts.length > 1 ? (parts[0] ?? 'knowledge') : 'knowledge';
+  return parts.length >= 1 ? (parts[0] ?? 'knowledge') : 'knowledge';
 }
killedBy: deriveCategory falls back to "knowledge" for a file directly in the vault root
statusReason: expected 'loose.md' to be 'knowledge' // Object.is equality

[Killed] EqualityOperator
src/vault-scan.ts:502:10
   const base = isOrg ? ORG_VAULT : PERSONAL_VAULT;
   const rel = path.relative(base, filePath);
   const parts = rel.split(path.sep);
-  return parts.length > 1 ? (parts[0] ?? 'knowledge') : 'knowledge';
+  return parts.length <= 1 ? (parts[0] ?? 'knowledge') : 'knowledge';
 }
killedBy: deriveCategory uses the top dir under the personal vault
statusReason: expected 'knowledge' to be 'decisions' // Object.is equality
