[Killed] BlockStatement
src/auto-reconcile.ts:34:7
  * performed, false otherwise.
  */
 export function checkReconcileRequest(): boolean {
-  try {
-    fs.statSync(RECONCILE_REQUEST_FLAG);
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: checkReconcileRequest returns false and does nothing when the marker is absent
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/auto-reconcile.ts:36:11
 export function checkReconcileRequest(): boolean {
   try {
     fs.statSync(RECONCILE_REQUEST_FLAG);
-  } catch {
-    return false;
-  }
+  } catch {}
 
   try {
killedBy: checkReconcileRequest returns false and does nothing when the marker is absent
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/auto-reconcile.ts:40:7
     return false;
   }
 
-  try {
-    fs.unlinkSync(RECONCILE_REQUEST_FLAG);
-  } catch {
+  try {} catch {
     // Another poller may have removed it; still reconcile below.
   }
killedBy: checkReconcileRequest returns true, deletes the marker, and reconciles when the marker exists
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/auto-reconcile.ts:46:7
     // Another poller may have removed it; still reconcile below.
   }
 
-  try {
-    reconcileIndex();
-    recalcIdfNow();
-    scheduleSave();
-    // 8.3 (REVIEW C-11): mirror main()'s boot sequence. recalcIdfNow() already
-    // rebuilt the inverted index synchronously; scheduleSave() set dirtyTokens
-    // so the 1s timer would chain scheduleIdfRecalc (+2s) and rebuild it AGAIN
-    // — the same redundant second rebuild #18 eliminated from the boot path.
-    // markIndexFresh clears dirtyTokens so the timer writes index.json only.
-    markIndexFresh();
-  } catch (e) {
+  try {} catch (e) {
     recordError(`auto-reconcile: ${e instanceof Error ? e.message : String(e)}`);
   }
killedBy: checkReconcileRequest returns true, deletes the marker, and reconciles when the marker exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/auto-reconcile.ts:56:15
     // — the same redundant second rebuild #18 eliminated from the boot path.
     // markIndexFresh clears dirtyTokens so the timer writes index.json only.
     markIndexFresh();
-  } catch (e) {
-    recordError(`auto-reconcile: ${e instanceof Error ? e.message : String(e)}`);
-  }
+  } catch (e) {}
   return true;
 }
killedBy: checkReconcileRequest records an error and still deletes the marker when reconcileIndex throws
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/auto-reconcile.ts:68:94
  * interval is unref'd so it does not keep a test or shutdown process alive if the
  * rest of the program has finished.
  */
-export function startAutoReconcile(pollMs = DEFAULT_POLL_MS): ReturnType<typeof setInterval> {
-  const interval = setInterval(() => {
-    checkReconcileRequest();
-  }, pollMs);
-  if ('unref' in interval) {
-    (interval as ReturnType<typeof setInterval>).unref();
-  }
-  return interval;
-}
+export function startAutoReconcile(pollMs = DEFAULT_POLL_MS): ReturnType<typeof setInterval> {}
 
killedBy: startAutoReconcile polls the marker and triggers reconcile
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/auto-reconcile.ts:69:38
  * rest of the program has finished.
  */
 export function startAutoReconcile(pollMs = DEFAULT_POLL_MS): ReturnType<typeof setInterval> {
-  const interval = setInterval(() => {
-    checkReconcileRequest();
-  }, pollMs);
+  const interval = setInterval(() => {}, pollMs);
   if ('unref' in interval) {
     (interval as ReturnType<typeof setInterval>).unref();
killedBy: startAutoReconcile polls the marker and triggers reconcile
statusReason: expected "vi.fn()" to be called at least once

[Survived] ConditionalExpression
src/auto-reconcile.ts:72:7
   const interval = setInterval(() => {
     checkReconcileRequest();
   }, pollMs);
-  if ('unref' in interval) {
+  if (true) {
     (interval as ReturnType<typeof setInterval>).unref();
   }

[Survived] BlockStatement
src/auto-reconcile.ts:72:28
   const interval = setInterval(() => {
     checkReconcileRequest();
   }, pollMs);
-  if ('unref' in interval) {
-    (interval as ReturnType<typeof setInterval>).unref();
-  }
+  if ('unref' in interval) {}
   return interval;
 }
