[Killed] BlockStatement
src/ebbinghaus.ts:12:11
   accessCount: number,
   confirmations = 0,
   flags = 0
-): number {
-  // Coerce each input to a finite number in a sensible range. The store_memory
-  // schema clamps importanceScore to [0, 1] and update_memory clamps it on
-  // write, but a hand-edited (or teammate-pushed) frontmatter can carry
-  // importanceScore: -1 / 5 / NaN / "high" — without these guards the
-  // exponential term propagates NaN through the entire formula, and a
-  // negative importanceScore would yield negative retention (prune_memories
-  // asserts retentionStrength >= 0 in its tests).
-  const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
-  const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
-  const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
-  const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
-  const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
-  const lambda = 0.16 * (1 - i * 0.8);
-  // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
-  // confirmation); a flagged memory decays faster (−0.1 per flag). The total
-  // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
-  const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
-  const strength = i * Math.exp(-lambda * d) * boost;
-  return Math.max(0, Math.min(1, strength));
-}
+): number {}
 
 // Clamp a raw importanceScore value — from MCP args, parsed frontmatter, or a
killedBy: tfidfSearch per-token toLowerCase memoization (#5) produces the same boosted score regardless of memoization (algebraically identical)
statusReason: expected NaN to be greater than 0

[Killed] MethodExpression
src/ebbinghaus.ts:20:43
   // exponential term propagates NaN through the entire formula, and a
   // negative importanceScore would yield negative retention (prune_memories
   // asserts retentionStrength >= 0 in its tests).
-  const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
+  const i = Number.isFinite(importance) ? Math.min(0, Math.min(1, importance)) : 0.5;
   const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
killedBy: tfidfSearch per-token toLowerCase memoization (#5) produces the same boosted score regardless of memoization (algebraically identical)
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/ebbinghaus.ts:20:55
   // exponential term propagates NaN through the entire formula, and a
   // negative importanceScore would yield negative retention (prune_memories
   // asserts retentionStrength >= 0 in its tests).
-  const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
+  const i = Number.isFinite(importance) ? Math.max(0, Math.max(1, importance)) : 0.5;
   const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
killedBy: computeRetentionStrength returns importance value when daysSince=0 and accessCount=0
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 0.005

[Killed] MethodExpression
src/ebbinghaus.ts:21:42
   // negative importanceScore would yield negative retention (prune_memories
   // asserts retentionStrength >= 0 in its tests).
   const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
-  const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
+  const d = Number.isFinite(daysSince) ? Math.min(0, daysSince) : 0;
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
   const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
killedBy: computeRetentionStrength decays over time for a low-importance memory
statusReason: expected 0.3 to be less than 0.3

[Killed] MethodExpression
src/ebbinghaus.ts:22:44
   // asserts retentionStrength >= 0 in its tests).
   const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
   const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
-  const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
+  const a = Number.isFinite(accessCount) ? Math.min(0, accessCount) : 0;
   const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
   const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
killedBy: computeRetentionStrength access count boosts retention
statusReason: expected 0.25534309168309394 to be greater than 0.25534309168309394

[Killed] MethodExpression
src/ebbinghaus.ts:23:46
   const i = Number.isFinite(importance) ? Math.max(0, Math.min(1, importance)) : 0.5;
   const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
-  const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
+  const c = Number.isFinite(confirmations) ? Math.min(0, confirmations) : 0;
   const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
   const lambda = 0.16 * (1 - i * 0.8);
killedBy: computeRetentionStrength confirmations boost retention and flags reduce it
statusReason: expected 0.25534309168309394 to be greater than 0.25534309168309394

[Killed] MethodExpression
src/ebbinghaus.ts:24:38
   const d = Number.isFinite(daysSince) ? Math.max(0, daysSince) : 0;
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
   const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
-  const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
+  const f = Number.isFinite(flags) ? Math.min(0, flags) : 0;
   const lambda = 0.16 * (1 - i * 0.8);
   // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
killedBy: computeRetentionStrength confirmations boost retention and flags reduce it
statusReason: expected 0.25534309168309394 to be less than 0.25534309168309394

[Killed] ArithmeticOperator
src/ebbinghaus.ts:25:30
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
   const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
   const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
-  const lambda = 0.16 * (1 - i * 0.8);
+  const lambda = 0.16 * (1 - i / 0.8);
   // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
killedBy: computeRetentionStrength exact magnitude for a non-trivial (i,d,a,c,f) tuple — pins every constant
statusReason: expected 0.4664898906799225 to be close to 0.325459, received difference is 0.14103089067992253, but expected 0.00005

[Killed] ArithmeticOperator
src/ebbinghaus.ts:25:18
   const a = Number.isFinite(accessCount) ? Math.max(0, accessCount) : 0;
   const c = Number.isFinite(confirmations) ? Math.max(0, confirmations) : 0;
   const f = Number.isFinite(flags) ? Math.max(0, flags) : 0;
-  const lambda = 0.16 * (1 - i * 0.8);
+  const lambda = 0.16 / (1 - i * 0.8);
   // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
killedBy: computeRetentionStrength high importance decays slower than low importance over 10 days
statusReason: expected 0.002968655180345177 to be greater than 0.029771616160666627

[Killed] ArithmeticOperator
src/ebbinghaus.ts:29:31
   // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
-  const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
+  const boost = 1 + a * 0.2 + c / 0.1 - f * 0.1;
   const strength = i * Math.exp(-lambda * d) * boost;
   return Math.max(0, Math.min(1, strength));
killedBy: computeRetentionStrength exact magnitude for a non-trivial (i,d,a,c,f) tuple — pins every constant
statusReason: expected 1 to be close to 0.325459, received difference is 0.6745410000000001, but expected 0.00005

[Killed] ArithmeticOperator
src/ebbinghaus.ts:29:17
   // Confirmation / flag feedback: a confirmed memory is reinforced (+0.1 per
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
-  const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
+  const boost = 1 + a * 0.2 - c * 0.1 - f * 0.1;
   const strength = i * Math.exp(-lambda * d) * boost;
   return Math.max(0, Math.min(1, strength));
killedBy: computeRetentionStrength confirmations boost retention and flags reduce it
statusReason: expected 0.22980878251478454 to be greater than 0.25534309168309394

[Killed] ArithmeticOperator
src/ebbinghaus.ts:30:20
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
   const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
-  const strength = i * Math.exp(-lambda * d) * boost;
+  const strength = i * Math.exp(-lambda * d) / boost;
   return Math.max(0, Math.min(1, strength));
 }
killedBy: computeRetentionStrength caps at 1 even with high access count
statusReason: expected 0.004975124378109453 to be greater than 0.99

[Killed] UnaryOperator
src/ebbinghaus.ts:30:33
   // confirmation); a flagged memory decays faster (−0.1 per flag). The total
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
   const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
-  const strength = i * Math.exp(-lambda * d) * boost;
+  const strength = i * Math.exp(+lambda * d) * boost;
   return Math.max(0, Math.min(1, strength));
 }
killedBy: computeRetentionStrength decays over time for a low-importance memory
statusReason: expected 1 to be less than 0.3

[Killed] MethodExpression
src/ebbinghaus.ts:31:22
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
   const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
   const strength = i * Math.exp(-lambda * d) * boost;
-  return Math.max(0, Math.min(1, strength));
+  return Math.max(0, Math.max(1, strength));
 }
 
killedBy: computeRetentionStrength returns importance value when daysSince=0 and accessCount=0
statusReason: expected 1 to be close to 0.5, received difference is 0.5, but expected 0.005

[Killed] MethodExpression
src/ebbinghaus.ts:31:10
   // multiplier is clamped to [0, ∞) and then the final strength to [0, 1].
   const boost = 1 + a * 0.2 + c * 0.1 - f * 0.1;
   const strength = i * Math.exp(-lambda * d) * boost;
-  return Math.max(0, Math.min(1, strength));
+  return Math.min(0, Math.min(1, strength));
 }
 
killedBy: computeRetentionStrength returns importance value when daysSince=0 and accessCount=0
statusReason: expected +0 to be close to 1, received difference is 1, but expected 0.005

[Killed] BlockStatement
src/ebbinghaus.ts:46:74
 // four write/restore/scan paths (store_memory, update_memory, indexFile,
 // coerceMemEntry) share one implementation instead of four copies of the clamp
 // expression and its rationale.
-export function clampImportanceScore(v: unknown, fallback = 0.5): number {
-  const n = Number(v);
-  return Number.isFinite(n) ? Math.max(0, Math.min(1, n)) : fallback;
-}
+export function clampImportanceScore(v: unknown, fallback = 0.5): number {}
 
 export function daysSince(date: string | Date): number {
killedBy: clampImportanceScore passes through an in-range number
statusReason: expected undefined to be close to 0.7, received difference is NaN, but expected 0.005

[Killed] MethodExpression
src/ebbinghaus.ts:48:43
 // expression and its rationale.
 export function clampImportanceScore(v: unknown, fallback = 0.5): number {
   const n = Number(v);
-  return Number.isFinite(n) ? Math.max(0, Math.min(1, n)) : fallback;
+  return Number.isFinite(n) ? Math.max(0, Math.max(1, n)) : fallback;
 }
 
killedBy: clampImportanceScore passes through an in-range number
statusReason: expected 1 to be close to 0.7, received difference is 0.30000000000000004, but expected 0.005

[Killed] MethodExpression
src/ebbinghaus.ts:48:31
 // expression and its rationale.
 export function clampImportanceScore(v: unknown, fallback = 0.5): number {
   const n = Number(v);
-  return Number.isFinite(n) ? Math.max(0, Math.min(1, n)) : fallback;
+  return Number.isFinite(n) ? Math.min(0, Math.min(1, n)) : fallback;
 }
 
killedBy: clampImportanceScore passes through an in-range number
statusReason: expected +0 to be close to 0.7, received difference is 0.7, but expected 0.005

[Killed] BlockStatement
src/ebbinghaus.ts:51:56
   return Number.isFinite(n) ? Math.max(0, Math.min(1, n)) : fallback;
 }
 
-export function daysSince(date: string | Date): number {
-  const d = typeof date === 'string' ? new Date(date) : date;
-  if (isNaN(d.getTime())) return 0;
-  return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
-}
+export function daysSince(date: string | Date): number {}
 
killedBy: daysSince returns 0 for now
statusReason: expected undefined to be close to +0, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/ebbinghaus.ts:52:13
 }
 
 export function daysSince(date: string | Date): number {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = false ? new Date(date) : date;
   if (isNaN(d.getTime())) return 0;
   return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
killedBy: daysSince returns 0 for now
statusReason: d.getTime is not a function

[Killed] EqualityOperator
src/ebbinghaus.ts:52:13
 }
 
 export function daysSince(date: string | Date): number {
-  const d = typeof date === 'string' ? new Date(date) : date;
+  const d = typeof date !== 'string' ? new Date(date) : date;
   if (isNaN(d.getTime())) return 0;
   return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
killedBy: daysSince returns 0 for now
statusReason: d.getTime is not a function

[Killed] ConditionalExpression
src/ebbinghaus.ts:53:7
 
 export function daysSince(date: string | Date): number {
   const d = typeof date === 'string' ? new Date(date) : date;
-  if (isNaN(d.getTime())) return 0;
+  if (true) return 0;
   return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
 }
killedBy: daysSince returns 7 for a week ago
statusReason: expected +0 to be close to 7, received difference is 7, but expected 0.00005

[Killed] ConditionalExpression
src/ebbinghaus.ts:53:7
 
 export function daysSince(date: string | Date): number {
   const d = typeof date === 'string' ? new Date(date) : date;
-  if (isNaN(d.getTime())) return 0;
+  if (false) return 0;
   return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
 }
killedBy: daysSince returns 0 for an invalid date string
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/ebbinghaus.ts:54:40
 export function daysSince(date: string | Date): number {
   const d = typeof date === 'string' ? new Date(date) : date;
   if (isNaN(d.getTime())) return 0;
-  return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
+  return (Date.now() - d.getTime()) / (1000 * 60 / 60 * 24);
 }
 
killedBy: daysSince returns 7 for a week ago
statusReason: expected 25200 to be close to 7, received difference is 25193, but expected 0.00005

[Killed] ArithmeticOperator
src/ebbinghaus.ts:54:40
 export function daysSince(date: string | Date): number {
   const d = typeof date === 'string' ? new Date(date) : date;
   if (isNaN(d.getTime())) return 0;
-  return (Date.now() - d.getTime()) / (1000 * 60 * 60 * 24);
+  return (Date.now() - d.getTime()) / (1000 * 60 * 60 / 24);
 }
 
killedBy: daysSince returns 7 for a week ago
statusReason: expected 4032 to be close to 7, received difference is 4025, but expected 0.00005
