[Killed] BlockStatement
src/rrf.ts:8:24
 export function reciprocalRankFusion(
   lists: Array<Array<{ key: string; score: number }>>,
   k = 60
-): Map<string, number> {
-  const scores = new Map<string, number>();
-  for (const list of lists) {
-    const sorted = [...list].sort((a, b) => b.score - a.score);
-    sorted.forEach((item, idx) => {
-      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
-    });
-  }
-  return scores;
-}
+): Map<string, number> {}
 
killedBy: reciprocalRankFusion returns empty map for empty input
statusReason: expected undefined to deeply equal Map{}

[Killed] BlockStatement
src/rrf.ts:10:29
   k = 60
 ): Map<string, number> {
   const scores = new Map<string, number>();
-  for (const list of lists) {
-    const sorted = [...list].sort((a, b) => b.score - a.score);
-    sorted.forEach((item, idx) => {
-      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
-    });
-  }
+  for (const list of lists) {}
   return scores;
 }
killedBy: reciprocalRankFusion scores a single-item list: rank-0 gets 1/(k+1)
statusReason: expected undefined to be close to 0.01639344262295082, received difference is NaN, but expected 0.005

[Killed] MethodExpression
src/rrf.ts:11:20
 ): Map<string, number> {
   const scores = new Map<string, number>();
   for (const list of lists) {
-    const sorted = [...list].sort((a, b) => b.score - a.score);
+    const sorted = [...list];
     sorted.forEach((item, idx) => {
       scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
killedBy: reciprocalRankFusion sorts each list by score descending before ranking
statusReason: expected 0.016129032258064516 to be close to 0.01639344262295082, received difference is 0.00026441036488630484, but expected 5e-11

[Killed] ArrowFunction
src/rrf.ts:11:35
 ): Map<string, number> {
   const scores = new Map<string, number>();
   for (const list of lists) {
-    const sorted = [...list].sort((a, b) => b.score - a.score);
+    const sorted = [...list].sort(() => undefined);
     sorted.forEach((item, idx) => {
       scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
killedBy: reciprocalRankFusion sorts each list by score descending before ranking
statusReason: expected 0.016129032258064516 to be close to 0.01639344262295082, received difference is 0.00026441036488630484, but expected 5e-11

[Killed] BlockStatement
src/rrf.ts:12:35
   const scores = new Map<string, number>();
   for (const list of lists) {
     const sorted = [...list].sort((a, b) => b.score - a.score);
-    sorted.forEach((item, idx) => {
-      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
-    });
+    sorted.forEach((item, idx) => {});
   }
   return scores;
killedBy: reciprocalRankFusion scores a single-item list: rank-0 gets 1/(k+1)
statusReason: expected undefined to be close to 0.01639344262295082, received difference is NaN, but expected 0.005

[Killed] ArithmeticOperator
src/rrf.ts:13:63
   for (const list of lists) {
     const sorted = [...list].sort((a, b) => b.score - a.score);
     sorted.forEach((item, idx) => {
-      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
+      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k - idx + 1));
     });
   }
killedBy: reciprocalRankFusion lower rank = lower score within one list
statusReason: expected 0.01639344262295082 to be greater than 0.016666666666666666

[Killed] ArithmeticOperator
src/rrf.ts:13:63
   for (const list of lists) {
     const sorted = [...list].sort((a, b) => b.score - a.score);
     sorted.forEach((item, idx) => {
-      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx + 1));
+      scores.set(item.key, (scores.get(item.key) ?? 0) + 1 / (k + idx - 1));
     });
   }
killedBy: reciprocalRankFusion exact fused scores for multi-list unequal-score inputs (default k=60)
statusReason: expected 0.03361581920903955 to be close to 0.03252247488101534, received difference is 0.001093344328024208, but expected 5e-11
